[
  {
    "title": "Nvidia stock slides amid AI spending slowdown fears, increased competition",
    "content": [
      "Nvidia (NVDA) stock sank more than 2% early Tuesday as investors grew cautious that the AI spending that has fueled its rise could ease or spread to rivals.",
      "Shares of the AI chipmaker were down roughly 14% from its record high closing price of $148.88 in early November.",
      "Nvidia made a swift ascent to the top, from a graphics card company primarily used for video games to the world’s leading supplier of AI chips, as Big Tech goes all-in on generative artificial intelligence. In 2024, it has traded places with Apple (AAPL) as the world’s most valuable company, and in early November, it replaced the once-dominant Intel (INTC) in the Dow Jones Industrial Average (^DJI). Wedbush analyst Dan Ives said in a note last week he expects Nvidia’s market cap to surpass $4 trillion in 2025.",
      "But following its record close in November, Nvidia shares began to fall after commentary from Microsoft (MSFT) and Google (GOOG) indicated that their AI spending will grow at a slower pace in the future. Rumors of overheating with its latest Blackwell AI servers stoked fears of further delays to the production ramp up, sending shares down even more. Even Nvidia’s most recent blowout earnings report, which surpassed bullish analysts’ already-high expectations, did little to help the stock's trajectory.",
      "Adding to Nvidia’s troubles, China’s competition authority last week said it has launched an antitrust probe into Nvidia’s $7 billion acquisition of networking technology company Mellanox.",
      "Meanwhile, the competition is heating up. Amazon (AMZN) in early December said it’s building a supercomputer with its new servers and its own Trainium AI chips — which it’s hoping can become a viable alternative to Nvidia. Broadcom (AVGO) said in its most recent earnings report that deals with hyperscalers to supply its custom AI chips called XPUs will bring in as much as $90 billion over the next three years — sending the stock soaring and Nvidia’s in the opposite direction, despite analyst commentary that Broadcom’s success won’t come at Nvidia’s expense.",
      "Also on Tuesday, the PHLX Semiconductor Index (^SOX), which includes Nvidia and other chipmakers' stocks, dipped nearly 2%.",
      "Big Tech companies’ AI bills are still climbing to massive sums despite concerns that companies have yet to see a meaningful return on their investments. Microsoft’s capital expenditures nearly doubled from the year-ago period to $20 billion in its most recent quarterly report, while Meta's (META) expenses rose 36% to $9.2 billion over the same period. Google’s capital expenditures jumped 63% to $13 billion. At the same time, only 4% of US workers actually use AI daily, according to a recent Gallup poll cited by Bloomberg.",
      "While JPMorgan (JPM) analyst Samik Chatterjee said in a note to investors Monday that fears of a slowdown in AI spending “appear to be unfounded” but acknowledged that “2024 was likely the peak in terms of the percentage increase.” While the biggest hyperscalers’ spending on AI-related infrastructure rose 57% in 2024, it will likely rise 30% in 2025 and 25% in 2026, Chatterjee estimates.",
      "Laura Bratton is a reporter for Yahoo Finance. Follow her on X @LauraBratton5.",
      "Click here for the latest stock market news and in-depth analysis, including events that move stocks",
      "Read the latest financial and business news from Yahoo Finance"
    ],
    "url": "https://finance.yahoo.com/news/nvidia-stock-slides-amid-ai-spending-slowdown-fears-increased-competition-145636549.html",
    "timestamp": "2024-12-17T15:39:11.000Z"
  },
  {
    "title": "Fed meeting, Nvidia selloff, November retail sales: 3 Things",
    "content": [
      "US stock futures (ES=F, NQ=F, YM=F) recede Tuesday morning as the Federal Reserve begins its two-day December policy meeting today, where it is expected to announce another 25 basis point cut to interest rates tomorrow.",
      "Nvidia (NVDA) pulls back even more as its stock tumbles below a $130 share price, entering correction territory as the chip stock falls 11% since its record high above $148 on November 7.",
      "November retail sales data came out higher than economists expected with sales rising 0.7% month-over-month, bolstered by Cyber Week promotions.",
      "To watch more expert insights and analysis on the latest market action, check out more Morning Brief here.",
      "This post was written by Luke Carberry Mogan."
    ],
    "url": "https://finance.yahoo.com/video/fed-meeting-nvidia-selloff-november-141924218.html",
    "timestamp": "2024-12-17T14:19:24.000Z"
  },
  {
    "title": "Does the 'Magnificent Seven' have more room to run in 2025?",
    "content": [
      "The \"Magnificent Seven\" tech stocks — Apple (AAPL), Amazon (AMZN), Alphabet (GOOG, GOOGL), Meta Platforms (META), Microsoft (MSFT), Tesla (TSLA), and Nvidia (NVDA) — have continued to lead market gains in 2024, surging approximately 70%.",
      "Asking for a Trend Anchor Josh Lipton delves into the market momentum behind these tech giants, exploring Wall Street's perspectives on their potential for continued growth in 2025.",
      "To watch more expert insights and analysis on the latest market action, check out more Wealth here.",
      "This post was written by Angel Smith"
    ],
    "url": "https://finance.yahoo.com/video/does-magnificent-seven-more-room-190006570.html",
    "timestamp": "2024-12-16T19:00:06.000Z"
  },
  {
    "title": "Trump & chip sector: Investors need 'supply chain resilience plan'",
    "content": [
      "President-elect Donald Trump has made tariffs a key focus of his second term in the White House, proposing a 60% tariff on all goods from China. The impact of Trump's second term on the semiconductor sector, which has become especially important during the artificial intelligence (AI) era, has been debated, given the impact of tariffs and uncertainty around the CHIPS and Science Act.",
      "Moor Insights & Strategy founder, CEO, and chief analyst Patrick Moorhead and Tufts University professor of International History Christopher Miller join Seana Smith and Madison Mills on Catalysts to discuss their outlook for the chip sector under Trump 2.0.",
      "Moorhead expects Trump to be a \"net positive\" for the chip sector: \"Trump doesn't want to be the president that tanked the tech stock market, and he certainly could do that if he puts any weight on the chip stocks that have been a tremendous part of the growth over the last four years.\"",
      "\"With all of the advanced semiconductor manufacturing leaving the United States, or most of it, Trump's trying to get the best deal to bring it back in. I do not believe he will tank the stock market or major industries to make that happen,\" Moorhead notes.",
      "Miller — the author of Chip War: The Fight for World's Most Critical Technology — says Trump's chip policy is \"being defined right now by the president-elect and his incoming administration,\" adding that tariffs will likely be a key component of his approach to the semiconductor sector, though there will likely be negotiations between his proposals and the actual policies.",
      "Amid uncertainty about Trump's actual policies and their impacts on chipmakers, Moorhead cautions investors saying they \"should be looking into every one of their investment plays and seeing if they have a supply chain resilience plan. It's a what if [plan].\"",
      "Watch the video above to learn more about the US-China trade war, the impact of major chipmakers, and more.",
      "To watch more expert insights and analysis on the latest market action, check out more Catalysts here.",
      "This post was written by Naomi Buchanan."
    ],
    "url": "https://finance.yahoo.com/video/trump-chip-sector-investors-supply-173000548.html",
    "timestamp": "2024-12-16T17:30:00.000Z"
  },
  {
    "title": "No title found",
    "content": [],
    "url": "https://finance.yahoo.com/m/4205eaa9-f620-3a0b-a81a-0e82c7c9fd0b/magnificent-seven-stocks-.html",
    "timestamp": null
  },
  {
    "title": "Nvidia stock slumps into a correction — and Broadcom sinks despite its 'Nvidia moment'",
    "content": [
      "Nvidia (NVDA) stock is in correction territory, and rival chipmaker Broadcom’s (AVGO) late-year boost took a hit Tuesday morning.",
      "Shares of Nvidia fell 2.9% Tuesday trading at $128.17, after slumping into a correction by market close the day before. A correction typically refers to when a stock falls 10% or more from an all-time high closing price. Nvidia stock rallied to an all-time high of $148.87 in early November.",
      "Competing semiconductor manufacturer Broadcom ended its hot streak after closing up more than 11% Monday and ending the day at $250 apiece. Broadcom stock fell more than 5% in Tuesday morning trading, to $326.54 per share.",
      "So far this month, shares of Broadcom are up roughly 50%, putting the stock on track to have its best month ever and adding hundreds of billions to its market capitalization. Broadcom now has a market capitalization of $1.17 trillion.",
      "Nvidia stock is still up more than 170% year-to-date. Broadcom shares have climbed 130% in the same period.",
      "As Nvidia sinks and Broadcom soars, the latter chipmaker is finally having its own “Nvidia moment,” Bernstein analyst Stacy Rasgon wrote in a Monday note reported by MarketWatch (NWSA). The company’s “robust AI story is finding its own ‘Nvidia moment’ with a likely sharp new product ramp into [the second half of] 2025, and outlook for material opportunity … a few years out,” Rasgon said.",
      "Despite a “fairly lousy” core business outside of artificial intelligence, Broadcom posted promising fourth-quarter earnings last week that beat Wall Street estimates and provided upbeat guidance for the year to come.",
      "This past fiscal year, Broadcom generated a record $30.1 billion in semiconductor revenue, driven by AI revenue of $12.2 billion, the company said. AI revenue alone grew 220% on an annual basis, fueled by the company’s AI XPUs and Ethernet networking portfolio.",
      "Broadcom is expecting first quarter revenue of approximately $14.6 billion, with EBITDA (earnings before interest, taxes, depreciation, and amortization) of 66% of projected revenue over the three months. In a call with analysts, company leadership said it sees the opportunity “over the next three years in AI as massive.”",
      "For the latest news, Facebook, Twitter and Instagram."
    ],
    "url": "https://finance.yahoo.com/news/nvidia-stock-slumps-correction-while-130600029.html",
    "timestamp": "2024-12-17T15:10:40.000Z"
  },
  {
    "title": "Nvidia Falls 2% as AI Slowdown Fears, Overheating Rumors, and China Probe Hit Stock",
    "content": [
      "Early Tuesday, Nvidia Corp. (NASDAQ:NVDA) sank over 2% as investors remain worried over a possible slowing down in AI spendingwhich has propelled the company's explosive ascent over the past couple of years. Now the stock is roughly almost 14% below its record high of $148.88 in early November.",
      "After cautious comments from Microsoft (NASDAQ:MSFT) and Google (NASDAQ:GOOG) regarding slower growth in AI-related investments, Nvidia, which has become the top provider of AI chips worldwide, saw shares drop. Rumors of overheating problems with its most recent Blackwell AI systems further stoked manufacturing delayworries.",
      "Warning! GuruFocus has detected 3 Warning Signs with NVDA.",
      "Though in its most recent report posting better-than-expected earnings, Nvidia's stock trajectory has stayed under pressure. Still hopeful, Wedbush analyst Dan Ives forecasts Nvidia's market value to reach $4 trillion by 2025. Complicating matters further for Nvidia, China's competition regulator revealed this week an antitrust probe into its $7 billion purchase of Mellanox, a networking technology firm.",
      "Driven by explosive generative AI demand, Nvidia's quick climb saw it surpass Intel (NASDAQ:INTC) in the Dow Jones Industrial Average and momentarily switch places with Apple (NASDAQ:AAPL) as the most valuable company in 2024.",
      "This article first appeared on GuruFocus."
    ],
    "url": "https://finance.yahoo.com/news/nvidia-falls-2-ai-slowdown-150846730.html",
    "timestamp": "2024-12-17T15:08:46.000Z"
  },
  {
    "title": "Analyst resets price target for surging Nvidia-backed AI stock",
    "content": [
      "When Siri debuted in 2011, she didn’t just answer questions — she started a conversation.",
      "For the first time, an AI voice lived in our pockets, ready to set reminders, search the web and even crack a joke.",
      "Then came Amazon's Alexa and Google Assistant, which turned smart speakers into household staples and embedded voice commands into everyday routines.",
      "💰💸 Don’t miss the move: SIGN UP for TheStreet’s FREE Daily newsletter 💰💸",
      "But these assistants all shared a common limitation — they were tightly bound to tech giants' ecosystems. As companies scrambled to integrate voice technology into their products, many found themselves forced to give up control over branding and user data.",
      "That’s where SoundHound AI  (SOUN)  saw an opportunity.",
      "Born from its roots as a music-recognition app, the Santa Clara, Calif., company now focuses on white-label voice artificial intelligence that enables businesses to create custom voice assistants.",
      "Its clients span industries, from Mercedes-Benz to IHG Hotels and Spotify.",
      "The company is also partnering with AI-chip giant Nvidia.  (NVDA)  Earlier this year, SoundHound unveiled an in-vehicle voice assistant that uses a large language model powered by Nvidia’s Drive technology.",
      "Related: Legendary billionaire tech investor makes an amazing claim about Nvidia's stock",
      "Nvidia is also a backer of this company. In February 2024 Nvidia disclosed an investment of $3.7 million in SoundHound.",
      "As of the end of Q3, Nvidia owned 1.7 million, or 0.5%, of SoundHound's shares outstanding.",
      "The voice market is one of the fastest-growing sectors in AI. According to data from Grand View Research, it is projected to expand by nearly 30% annually from 2024 to 2030, the Motley Fool reported.",
      "SoundHound's latest earnings report shows that its growth has outpaced this projection.",
      "However, the company remains unprofitable and has not achieved positive cash flow.",
      "In November, SoundHound reported record third-quarter revenue and raised its full-year revenue forecast.",
      "The company reported an adjusted loss of 4 cents a share, beating the consensus estimate of a 7-cent loss. The company posted revenue of $25.1 million, surpassing expectations of $23 million.",
      "In the year-earlier period, it lost 9 cents a share on revenue of $13.3 million.",
      "Related: Analyst resets price target on key AI stock after runup",
      "\"This marks SoundHound's largest quarter to date as we begin expanding into key new verticals,\" SoundHound Chief Executive Keyvan Mohajer said in a statement.",
      "\"Our growing scale, coupled with strong market enthusiasm for conversational AI, allows us to advance our vision. We see voice as the 'killer app' for applied generative AI,\" Mohajer said.",
      "For the full year, the company projected sales of $83.5 million at the midpoint of its guidance, surpassing analysts' expectations of $82.6 million.",
      "Looking ahead to 2025, it forecast revenue of $165 million, above the consensus estimate of $152.1 million.",
      "Wedbush analyst Daniel Ives more than doubled the investment firm's price target on SoundHound to $22 from $10 and affirmed an outperform rating on the shares, thefly.com reported on Dec 16.",
      "“SoundHound represents an underappreciated pure-play AI company that is taking significant strides in taking share across the landscape, with its enterprise AI software platform seeing continued strength,” the analyst said.",
      "More Tech Stocks:",
      "Major Apple chip supplier is expanding into the U.S.",
      "Analysts unveil Tempus AI stock price targets",
      "Analysts update GE Vernova stock price target after investor meeting",
      "The analyst cited continued demand for voice AI solutions, representing a potential $1 trillion opportunity over the coming years.",
      "Of six analysts surveyed by TheStreet, four have a strong buy rating, and two have a hold rating for SoundHound.",
      "SoundHound stock closed at $19.69 on Dec. 16. The stock is up 9 times year-to-date.",
      "Related: Veteran fund manager delivers alarming S&P 500 forecast"
    ],
    "url": "https://finance.yahoo.com/news/analyst-resets-price-target-surging-150837508.html",
    "timestamp": "2024-12-17T15:08:37.000Z"
  },
  {
    "title": "Broadcom’s ‘Nvidia Moment’ Has Arrived. Now It Needs to Deliver",
    "content": [
      "(Bloomberg) -- Broadcom Inc.’s massive rally after last week’s earnings report is reminiscent of when Nvidia Corp. shares first started to take off back in 2023. The chipmaker now needs to prove it can follow through to become another giant of the artificial intelligence era.",
      "Most Read from Bloomberg",
      "How California Sees the World, and Itself",
      "Hong Kong's Expat Party Hub Reshaped by Chinese Influx",
      "London’s Tube Fares Are Set to Rise by 4.6% Next Year",
      "Broadcom shares have soared 38% through Monday’s close — the two trading days since it reported results — pushing the company’s market capitalization to nearly $1.2 trillion. At the heart of the rally is Broadcom’s prediction that the addressable market for AI components it designs for data center operators will be as big as $90 billion by fiscal 2027. But there’s a lot to be done to turn that opportunity into reality. Shares fell as much as 4.7% in early trading Tuesday.",
      "“This is kind of like the Nvidia moment of maybe a year-and-a-half ago where they blew the number out and everybody had to catch up and chase it,” said Ken Mahoney, chief executive officer at Mahoney Asset Management, which owns the stock. Broadcom is showing investors that the demands from AI computing are so big that there’s plenty of room for other winners aside from Nvidia, Mahoney said.",
      "Broadcom was having a strong year even before last week’s results, with solid growth in its AI business underpinning its performance as one of the top stocks in the Philadelphia Semiconductor Index. Still, it hasn’t been a completely smooth ride: The shares plunged in September after the company gave a disappointing forecast because of weakness in its non-AI operations.",
      "This quarter’s results have turned the focus squarely back to AI. Broadcom shares are now up more than 110% year-to-date, set for the best annual performance since their 2009 listing. Analysts have been scrambling to keep up, with multiple Wall Street firms hiking price targets and estimates following the earnings. Still, even a 19% jump in the average analyst target since the results has failed to keep pace with the shares, according to data compiled by Bloomberg.",
      "This trajectory has inevitably spurred comparisons with Nvidia, the stock market’s original AI winner. Nvidia followed its blowout earnings report in May 2023 with a series of estimate-beating results and quarterly forecasts. It has also defied skeptics who said 2024 would be tough for the shares. Nvidia is up about 159% this year, but has pulled back in the past few days — possibly because investors are considering the prospect of rising competition from Broadcom.",
      "“I see a lot of parallels between Broadcom and Nvidia,” said Joe Tigay, portfolio manager of the Rational Equity Armor Fund, who sees reason to believe Broadcom’s stock can show sustainable gains in the same way as Nvidia. “Obviously Broadcom still needs to deliver to justify a 38 times multiple, but it has shown good growth and execution this year.”",
      "That multiple — the price investors have to pay for shares relative to earnings projected over the next 12 months — is pushing deeper into record territory. That may suggest Broadcom has limited room for error, though Nvidia has set a bullish precedent for investors wanting to jump onto the next big potential AI winner. Nvidia’s profits grew so fast last year that the valuation actually got cheaper as the stock rose, because estimates were being raised at an even faster clip.",
      "Estimates for Broadcom’s net earnings per share for fiscal 2025 have risen 12% in the past week.",
      "Still, not every “Nvidia moment” has turned into a sustained gain, with some companies failing to live up to expectations or seeing share-price rallies stall. Arm Holdings Plc gave a bullish forecast in February, and said it was “only at the beginning” of the AI boom. That sparked a 93% surge in the stock over the next three sessions, but the shares haven’t progressed much since then and are now down more than 20% from a July peak.",
      "“It is too soon to say whether we’re going to see a series of blowout reports like we’ve gotten from Nvidia,” said Alec Young, chief investment strategist at Mapsignals. “Broadcom has done a really good job, but these things don’t always end well.”",
      "Top Tech Stories",
      "TikTok and its Chinese parent company asked the US Supreme Court to block a government ban set to take effect next month, invoking favorable comments about the popular social-media platform from President-elect Donald Trump.",
      "Alibaba Group Holding Ltd. has agreed to sell its Intime department store business to Youngor Fashion Co. for around $1 billion in a move to offload non-core assets.",
      "Kioxia Holdings Corp. was supposed to be an irresistible debutant in a hot Japanese market, heralding the rise of a homegrown chipmaker with big backers and a storied pedigree. It may get a cooler reception than anticipated.",
      "Beijing-based Zhipu raised a further 3 billion yuan ($412 million) to power its artificial intelligence development efforts.",
      "Earnings Due Tuesday",
      "Premarket",
      "Cheetah Mobile",
      "--With assistance from Subrat Patnaik and Brandon Harden.",
      "(Updates stock moves at market open)",
      "Most Read from Bloomberg Businessweek",
      "Desperate Nursing Students Turn to Fixers for Their Clinical Training",
      "How Can the World Move Beyond Combustion Cars? Look to Norway",
      "Crypto Got What It Wanted in November’s Election. Now What?",
      "Can the US Power Industry Meet AI’s Steep Energy Demands?",
      "Inflation Is Coming Down, But Prices Won’t Stand Still in 2025",
      "©2024 Bloomberg L.P."
    ],
    "url": "https://finance.yahoo.com/news/broadcom-nvidia-moment-arrived-now-103618972.html",
    "timestamp": "2024-12-17T14:54:44.000Z"
  },
  {
    "title": "No title found",
    "content": [],
    "url": "https://finance.yahoo.com/m/faa9ed6f-8ec1-3cfe-8a4b-2ff66b4a2676/nvidia-stock-slump-deepens-.html",
    "timestamp": null
  }
]