[
  {
    "title": "Apple has 50% chance of getting tariff exemptions, analyst says",
    "content": "Apple (AAPL) is in focus as a tech company heavily impacted by President Trump's tariffs on imports from China. CFRA Research senior equity analyst Angelo Zino joins Market Domination Overtime to discuss the iPhone maker's position.\n\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime here.\n\nAngel, do you think Apple could ultimately secure a special tariff exemption? A special tariff carve-out like they did during Trump 1.0?\n\nYeah, I mean, so we've increased the odds, right, to 50% from 20% and, you know, we really changed and increased our probability based on Wednesday's events. When you think about Wednesday, uh, basically the US administration reduced or eliminated or postponed the reciprocal tariffs, um, and essentially has a flat 10% rate here, um, outside of the, uh, outside of China, whereas they actually increased the China rate up to now, what, 145%, which really actually does, you know, makes no sense for Apple to even touch that capacity there. So when you start thinking about, um, you know, the situation that that is evolved there, it changes the competitive landscape in many respects because right now you've got a company like Samsung, which is their biggest competitor out there, most of their operations and capacity is in, uh, Vietnam, uh, India as well as South Korea. So in many respects, they've got a competitive advantage, especially as you start entering the holiday selling season here from, um, from a potential pricing perspective, um, and cost perspective relative to that of Apple. So it'll be interesting to kind of see how the the dynamics, you know, kind of change here over the next couple of weeks and months. But if you're talking about a company in the in an Apple, which is essentially, you know, the crown jewel for the US, and they're they're committing $500 billion into the US economy, helping to prop up kind of the the manufacturing capacity here in the US, a lot of it through funding across the supply chain to the likes of Taiwan semi so they can build their plants here, you almost have to think that you at some point in time, you're going to have to give Apple an exemption. But that's just our view.\n\nSo bottom line, you think Apple has a good argument for that exemption, whether or not the White House buys that argument, I guess, is another thing.\n\nYeah, no, absolutely. And again, we think when you start thinking about kind of the the added stress that's essentially put onto Apple kind of post Wednesday's events now kind of, you know, having a disadvantage from a competitive landscape, we just think it makes more sense to or increasing sense to to offer them that, um, you know, that exemption.\n\nAngel, do you think domestic iPhone manufacturing, US iPhone manufacturing, is that financially tenable?\n\nYeah, that's tough. I mean, any type of manufacturing for any any goods on the on the chip manufacturing side of things and the hardware side of things as far as the tech ecosystem is concerned is very difficult. We all know about the the slip up with uh with Foxconn and them trying to build a $10 billion plant in Wisconsin back in 2017 and how that never came to fruition. You know, clearly, we've seen some like the likes of Taiwan semi find some success here. So we think kind of we think Apple can move some supply chain manufacturing or push some of that here into the US in terms of, you know, getting some of the the other suppliers out there to to build bases here. But overall in terms of the assembly testing, um, you know, putting together, uh, building facilities as far as iPhones is concerned, it's just it's just a stretch to us. I mean, from a cost perspective, it does not make any sense.",
    "url": "https://finance.yahoo.com/video/apple-50-chance-getting-tariff-221741390.html",
    "timestamp": "2025-04-11T22:17:41.000Z"
  },
  {
    "title": "Why Wall Street's biggest bear isn't budging on his calls after Trump tariff pause",
    "content": "It's going to take more than a reciprocal tariff pause to keep Wall Street's biggest bear from roaming the markets and heading into hibernation.\n\n\"Based on my calculations, the tariff rate is still quite high — at least as high as anything we have seen since the 1930s,\" BCA Research chief strategist Peter Berezin told Yahoo Finance. \"There is no guarantee these so-called reciprocal tariffs are going to come down. The fact of the matter is that most countries don't have very large trade barriers with the US.\"\n\nBerezin added, \"The uncertainty is a problem — I think we are still headed into a recession, unfortunately.\"\n\nBerezin told Yahoo Finance recently he sees a 75% chance of a US recession this year and the S&P 500 dropping 15% to 4,450. He hasn't ruled out the US already being in a mild recession.\n\nListen: Why Jamie Dimon may be wrong on a recession\n\nBerezin gained attention for being the lone bear on Wall Street coming into 2025. Further, he correctly called in 2022 that there would be no US recession — despite most on the Street bracing for one. He has been an economist for more than 30 years, with stints at the International Monetary Fund (IMF), Goldman Sachs, and now BCA Research.\n\nThe bearish calls on markets and the economy come amid another turbulent week for stocks as some traders aimed to price in a recession while others took a more optimistic viewpoint.\n\nThe Dow Jones Industrial Average (^DJI) on Thursday tanked 1,014.79 points or 2.5%. The S&P 500 (^GSPC) and Nasdaq Composite (^IXIC) sold off to the tune of 3.46% and 4.31%, respectively. Investor favorites Nvidia (NVDA) and Tesla (TSLA) plunged 6% and 7.3%, respectively.\n\nMarkets essentially dialed back their excitement after a historic day on Wednesday.\n\nThe S&P 500 exploded 9.5% on Wednesday as President Trump announced a 90-day pause on reciprocal tariffs for most countries. He cranked up the pressure on China, however, taking tariffs up to 145%. The tech-heavy Nasdaq Composite surged 12% for its second-best day on record. The Dow Jones Industrial Average shot up 7.8%, or about 3,000 points.\n\nThe about-face on tariffs caused Goldman Sachs economists to reverse their baseline recession call ... made earlier that day.\n\nStocks were solidly in the red on Friday.\n\nDespite the elevated market volatility, some Wall Street strategists are aiming to search the rubble for buying opportunities. Most calls reviewed by Yahoo Finance focus on defensive stock tilts rather than buying recent dips on former highfliers in Apple (AAPL), Nvidia, and Tesla.",
    "url": "https://finance.yahoo.com/news/why-wall-streets-biggest-bear-isnt-budging-on-his-calls-after-trump-tariff-pause-124002190.html",
    "timestamp": "2025-04-11T12:40:02.000Z"
  },
  {
    "title": "Apple’s China-Centric Supply Chain, Once Its Greatest Asset, Is Now a Liability",
    "content": "The iPhone-maker, a pioneer of globalization that helped build China’s manufacturing economy, now faces a steep profit hit from tariffs.",
    "url": "https://finance.yahoo.com/m/1ea0391a-2d97-3539-945b-710b7f485e42/apple%E2%80%99s-china-centric-supply.html",
    "timestamp": "2025-04-12T02:00:00.000Z"
  },
  {
    "title": "Apple Stock’s Resilience Means This Is an Opportunity, Says BofA. Plus, Meta, Occidental, and More.",
    "content": "RESEARCH REPORTS These reports, excerpted and edited by Barron’s, were issued recently by investment and research firms. The reports are a sampling of analysts’ thinking; they should not be considered the views or recommendations of Barron’s.",
    "url": "https://finance.yahoo.com/m/06769a5e-dff7-3a42-88a5-ff56851cc27a/apple-stock%E2%80%99s-resilience.html",
    "timestamp": "2025-04-11T23:29:00.000Z"
  },
  {
    "title": "Apple Leads Magnificent 7 Stocks Higher Friday to Cap Off Volatile Week",
    "content": "NurPhoto / Contributor / Getty Images\n\nApple (AAPL) shares surged Friday, leading other Magnificent Seven members higher amid a broader market rebound to cap off a wild week fueled by tariff-driven volatility.\n\nApple shares jumped 4% to close at $198.15, posting gains for a week that included three losing sessions and the stock's best day since 1998.\n\nStill, it has yet to fully recover from the hit taken since President Trump’s tariff announcement on April 2, on worries about escalating trade tensions with China, where Apple manufactures an estimated 90% of its products.\n\nThe gains for Apple’s stock Friday came amid growing optimism the iPhone maker could win an exemption from the Trump administration’s tariffs.\n\nMizuho analyst Jordan Klein reportedly told clients in a client note Friday that “90% of investors seem to believe Apple will get a tariff exemption,” pointing to the exemption Apple received in 2018 during President Trump’s first term.\n\nCFRA Research analyst Angelo Zino said he now puts the odds of an Apple-specific exemption at 50%, up from 20%.\n\nRead the original article on Investopedia",
    "url": "https://finance.yahoo.com/news/apple-leads-magnificent-7-stocks-223132162.html",
    "timestamp": "2025-04-11T22:31:32.000Z"
  },
  {
    "title": "Why the Zacks Rank is More Important Than Ever",
    "content": "Over the last few weeks, the stock market had seen the largest monthly decline since the COVID-19 pandemic. Of course, the post-pandemic recovery would end up making the COVID-19 plunge one of those once-in-a-lifetime opportunities to reap massive returns when the market rebounded.\n\nThe current economic scenario may be different but one thing that remains the same is that the trend of earnings estimate revisions will help investors navigate which stocks to invest in, which is what the Zacks Rank is predicated on.\n\nTo that point, following the Zacks Rank will allow investors to see which companies are navigating a tariff-induced economic slowdown effectively. While it's never wise to bet against the stock market’s long-term prospects, the jitters are understandable as the Trump administration has implemented the highest tariffs on imports in over a century. This will certainly have global economic ramifications, especially with some countries likely to counter with reciprocal tariffs of their own.\n\nStill, the Zacks Rank can help, with it noteworthy that the Zacks Rank #1 (Strong Buy) stocks have more than doubled the S&P 500 with an average gain of +23.9% per year since 1998.\n\nImage Source: Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nWith many analysts calling for a recalibration in the market, famed investor and billionaire Jeffrey Gundlach has pointed out that the Cape ratio on the S&P 500 had been near its second-highest level ever at 38X, suggesting stocks are still overvalued.\n\nAlso known as the Shiller P/E ratio, the Cape ratio is used to calculate the price of the stock market or individual stocks relative to their average inflation-adjusted earnings over the last 10 years, smoothing out fluctuations caused by economic cycles. Although the forward earnings multiple on the S&P 500 is at a reasonable 20.1X, the Cape ratio still stands at 33.1X compared to its historical average of 16.9X.\n\nNotably, Gundlach has called for a 60% chance of a recession, stating that leverage investors may be at risk of bankruptcy amid large market swings while companies deal with tariff ramifications as opposed to supply chain issues during the pandemic.\n\nImage Source: YCHARTS\n\nThere is no doubt that intriguing long-term buying opportunities are being presented, and many investors may be scoping out the Mag-7 stocks such as EV leader Tesla TSLA, AI chip leader Nvidia NVDA, and electronics giant Apple AAPL.\n\nApple for instance may be placed in a difficult spot for investors to consider whether it's time to buy on the dip with AAPL recently trading near its 52-week low of $164 a share before rebounding to just under $200. While Apple’s stock is still trading 23% from its 52-week high, the company will be significantly affected by tariffs as it relies heavily on international manufacturing in China, India, and Vietnam.",
    "url": "https://finance.yahoo.com/news/why-zacks-rank-more-important-221700168.html",
    "timestamp": "2025-04-11T22:17:00.000Z"
  },
  {
    "title": "Is Apple Inc. (NASDAQ:AAPL) a NASDAQ Stock with the Highest Upside Potential?",
    "content": "We recently published a list of the 13 NASDAQ Stocks with the Highest Upside Potential. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other NASDAQ stocks with high upside potential.\n\nOn April 7, Dan Ives of Wedbush Securities joined CNBC’s ‘Squawk on the Street’ to discuss how the current tariff environment could impact tech supply chains. Musk’s actions and Trump’s tariffs have contributed to broad economic uncertainty, which Ives also referred to as the economic Armageddon for US tech in an earlier conversation. He expressed concern about the structural supply chain challenges posed by recent tariffs and geopolitical tensions. Ives highlighted that the US tech sector has historically maintained an edge over China but this could be wiped out if manufacturing were relocated to the US. The logistical hurdles of building manufacturing plants in the US are not negligible and it would take 4 to 5 years to establish facilities capable of sustaining production levels comparable to those in Asia.\n\nHe also acknowledged that he hasn’t downgraded major stocks like the ones in MAG7 but remains cautious. If these previously highlighted issues persist for months, Ives anticipates drastic cuts in earnings. This uncertainty surrounding tariffs could lead to lower demand for emerging technologies like AI and cybersecurity. He explained that this situation could severely impact the US tech companies and lead to broader cuts across the tech sector — potentially up to 25% in earnings. He also criticized Elon Musk’s political involvement, which he believes has caused permanent damage to his brand and customer base. He estimated a 20% demand destruction in Europe and 10% in the US.\n\nWe used the Finviz stock screener to select the 13 stocks with the highest analysts’ upside potential (at least 35%) as of April 8. The stocks are ranked in ascending order of their upside potential. We have also added the hedge fund sentiment for each stock, as of Q4 2024, which was sourced from Insider Monkey’s database.\n\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\n\nA wide view of an Apple store, showing the range of products the company offers.",
    "url": "https://finance.yahoo.com/news/apple-inc-nasdaq-aapl-nasdaq-212508548.html",
    "timestamp": "2025-04-11T21:25:08.000Z"
  },
  {
    "title": "iPhone Prices Could Soar Past $2,000 if China Tariffs Stay, Wedbush Says",
    "content": "If the recently announced 145 percent U.S. tariffs on Chinese imports remain in place for more than a few weeks, consumers could feel the impact directly especially through higher prices on electronics, including iPhones. That's the view from Wedbush Securities, which said Apple (NASDAQ:AAPL) may have to raise prices significantly if no carve-outs are granted.\n\nIn a note to clients, Wedbush analysts said ongoing negotiations between the U.S. and China, and the potential for tech giants like Apple, Amazon, Nvidia, and Tesla to receive exemptions, will be critical. But if the tariffs hold, Apple may be forced to price iPhones above $2,000 to offset the added costs.\n\nThe firm also pointed to China's leverage in this standoff. Despite Apple's recent efforts to shift some manufacturing to countries like India, Vietnam, and Brazil, a large portion of its production is still based in China including around half of all iPhones, more than 50 percent of Macs, and up to 80 percent of iPads.\n\nWedbush called Apple at the center of this storm and emphasized that the outcome of trade negotiations could have meaningful consequences for both the tech sector and everyday consumers.\n\nThis article first appeared on GuruFocus.",
    "url": "https://finance.yahoo.com/news/iphone-prices-could-soar-past-205932397.html",
    "timestamp": "2025-04-11T20:59:32.000Z"
  },
  {
    "title": "India Saw a Surge in Smartphone Exports Ahead of Tariffs",
    "content": "India saw a marked increase in smartphone export shipments to the U.S. from January to March, according to Pankaj Mohindroo, chairman of the India Cellular & Electronics Association. In the final days of March alone, India lifted a massive amount of air cargo—essentially phones—to the U.S., he said. “This clearly reflects that India has arrived as a very serious capacity and logistics leader in the global value chain,” said Mohindroo.",
    "url": "https://finance.yahoo.com/m/043153ad-f133-30bf-90a2-3cc450c7db67/india-saw-a-surge-in.html",
    "timestamp": "2025-04-11T20:07:11.000Z"
  },
  {
    "title": "Apple's Supply Chain Strength",
    "content": "Tony Wang, manager of T. Rowe Price's Science & Technology Equity Strategy portfolio, explains why Apple is still the portfolio's biggest holding despite US-China tariffs. He joins Caroline Hyde and Ed Ludlow on \"Bloomberg Technology.\"",
    "url": "https://finance.yahoo.com/video/apples-supply-chain-strength-183911927.html",
    "timestamp": "2025-04-11T18:39:11.000Z"
  }
]