[
  {
    "title": "No title found",
    "content": [],
    "url": "https://finance.yahoo.com/m/ac1cc5f7-f63f-3e92-972d-6da7301d8fc1/xrp%E2%80%99s-price-dives-why-the.html",
    "timestamp": null
  },
  {
    "title": "November PCE, govt. shutdown looms, Novo Nordisk: 3 Things",
    "content": [
      "US stock futures (ES=F, NQ=F, YM=F) are slipping Friday morning after the Personal Consumption Expenditures (PCE) price index rose by 2.8% in November, just 0.1% below economists' estimates",
      "A government shutdown looms after House Speaker Mike Johnson's (R-La.) bipartisan spending bill was rebuffed by President-elect Donald Trump and Elon Musk, who Trump tapped to co-lead the proposed Department of Government Efficiency (DOGE).",
      "Novo Nordisk (NVO) shares dive by over 20% in Friday's pre-market trading after its experimental weight-loss shot CagriSema helped patients lose less weight than anticipated in its clinical trial.",
      "To watch more expert insights and analysis on the latest market action, check out more Morning Brief here.",
      "This post was written by Luke Carberry Mogan."
    ],
    "url": "https://finance.yahoo.com/video/november-pce-govt-shutdown-looms-141502888.html",
    "timestamp": "2024-12-20T14:15:02.000Z"
  },
  {
    "title": "Bitcoin Pullback Deepens as US ETFs Suffer Record Daily Outflow",
    "content": [
      "(Bloomberg) -- A Bitcoin slide from a record high earlier this week extended to more than 10%, as reduced scope for looser US monetary policy dampened speculative zeal.",
      "Most Read from Bloomberg",
      "New York City’s Historic Preservation Movement Is Having a Midlife Crisis",
      "NYPD Car Chases Are Becoming More Frequent — and More Dangerous",
      "Dakar’s Air Quality Plummets as Saharan Dust Descends on Senegal",
      "Reviving a Little-Known Modernist Landmark in Buffalo",
      "The price of the original cryptocurrency dropped as low as $95,234 on Friday at 9 a.m. in London after setting an all-time high just above $108,000 earlier in the week. The downturn weighed heavier on smaller tokens like Ether and Dogecoin.",
      "A group of US exchange-traded funds investing directly in Bitcoin on Thursday snapped a 15-day streak of continuous inflows to post a record outflow of $680 million, according to data compiled by Bloomberg, underscoring the shift in sentiment.",
      "It’s “pretty typical” to see such corrections in crypto bull markets, said Strahinja Savic, head of data and analytics at FRNT Financial, while QCP Capital said in a note that the root cause of the selloff is the market’s “overly bullish” positioning.",
      "The Federal Reserve’s hawkish pivot on Wednesday weighed on most risk assets. Bitcoin is still up almost 50% since pro-crypto Donald Trump’s victory in the US presidential election on Nov. 5.",
      "“It looks like some year-end profit taking,” said Edward Chin of Parataxis. “There wasn’t anything fundamental that triggered the selloff.”",
      "With fewer Fed rate cuts now expected for 2025, some investors may be choosing to reduce their exposure and take profits.",
      "“Technically, caution is warranted in the short term,” Chris Weston, head of research at Pepperstone Group, wrote in a note. “This doesn’t mean we’re due to see a collapse in price anytime soon, but the momentum has clearly come out of the move and the buyers have lost dominance and control of the tape.”",
      "--With assistance from Olga Kharif.",
      "(Updates prices.)",
      "Most Read from Bloomberg Businessweek",
      "Office Real Estate Is Facing ‘a Year of Reckoning’ in 2025",
      "The Property Brothers Say Hold Off on the Big Home Renovation in 2025",
      "Elon Musk’s Christmas Gift to America: Chaos",
      "Phil Knight Is Using His Nike Fortune to Make Oregon a Football Powerhouse",
      "AI Giants Seek New Tactics Now That ‘Low-Hanging Fruit’ Is Gone",
      "©2024 Bloomberg L.P."
    ],
    "url": "https://finance.yahoo.com/news/bitcoin-pullback-deepens-token-record-232207066.html",
    "timestamp": "2024-12-20T09:00:50.000Z"
  },
  {
    "title": "Robinhood to add options trading in the UK at the beginning of 2025",
    "content": [
      "Robinhood (HOOD) is set to start offering options trading to its UK customers early in 2025, as it continues to expand the features available on its platform to investors outside of the US.",
      "Jordan Sinclair, president of Robinhood UK, told Yahoo Finance UK in an interview that the investment platform would launch options trading \"at the beginning of next year\".",
      "\"Many of our customers have been asking us about it already,\" he said.",
      "Robinhood had mentioned in its third-quarter results that it planned to start offering options trading in the UK in 2025, having received approval from the Financial Conduct Authority, but had not gone into any more specifics on timings.",
      "This will be the latest of its features which have been available US users to be rolled out in the UK, after Robinhood launched its trading platform here in March this year.",
      "Options trading has seen increasing interest from retail investors looking for alternatives to classic stock trading, though it is still less widely available in the UK.",
      "This strategy allows investors to buy or sell options. These are financial contracts which give investors the right – but not the obligation – to buy or sell an investment at a predetermined price within a specific time frame.",
      "They can be used on a number of different types of assets, including stocks, indices and exchange-traded funds (ETFs).",
      "Investors typically trade options for three reasons – to hedge against a potential fall in price, generate income from a stock they own, or to speculate on the direction of an investment.",
      "Read more: Robinhood's surge towards profitability brings it back to the top of the financial world",
      "For each of these objectives, there are different options trading strategies.",
      "The two main types of options that can be used in these strategies are \"calls\" which allow investors to buy the underlying asset at what is known as the \"strike price\" until the contract expires. The strike price is the price at which the option can be exercised.",
      "The other main type of option is the \"put\", which enables the investor to sell the underlying asset at the strike price.",
      "That is just a starting point and highlights that there is a lot more terminology associated with options trading, which can make it more complicated to understand than traditional ways of investing.",
      "An advantage of options trading is that they can be cheaper than buying an asset outright, as a standard contract represents 100 shares of the underlying stock. Hedging can also offer a type of insurance against investment losses in your portfolio.",
      "However, experts also emphasise the importance of understanding the terminology before getting started and that investors need to be more active in tracking these investments.",
      "In addition to this upcoming launch, Robinhood has already introduced other features in the UK. In October, it began rolling out margin investing, which allows investors to borrow cash against their existing asset holdings, enabling them to buy additional securities.",
      "Prior to this, in September, Robinhood launched share lending for UK customers, where customers can earn passive income by lending out their stock holdings. Both moves are part of Robinhood's strategy to broaden its market share internationally.",
      "Like options trading, these features can be a bit more complicated for retail investors to understand so they haven't been as widely available in the UK.",
      "Asked how Robinhood ensures that its customers are using these features responsibly, Sinclair said that when the company is building these features it considers how to \"test knowledge and experience, [and] create eligibility criteria that really make sure that the right customers are getting access to this product\".",
      "Read more: Will Santa gift investors with a stock market rally?",
      "\"But perhaps for the beginner investor, it isn't right for them and we have the right controls in place,\" he added.",
      "Robinhood made its name by offering commission-free trading in the US, disrupting the traditional brokerage model. Its user-friendly platform attracted millions of new, mostly young investors.",
      "It became associated with the \"meme stock\" craze of 2021, as it was the preferred platform of retail investors spurred on by posts on Reddit (RDDT) and Twitter (now X). They piled into stocks such as gaming retailer GameStop (GME) and US cinema chain AMC Entertainment (AMC) that were typically heavily shorted by institutional investors.",
      "Robinhood had 24.8 million customers as of its November operating data update, released in December, which was up by approximately 1.5 million year on year.",
      "It also recorded a 36% increase in total net revenues to $637m (£501m). Robinhood's transaction-based revenues were up 72% year on year to $319m, which was primarily driven by a 63% rise in options revenue of $202m.",
      "Robinhood shares are up 191% year-to-date, logging strong gains following the US presidential election. True to form, it rolled out contracts to enable users to bet on the outcome.",
      "This marks a turnaround for the company since its debut on the US stock market in July 2021, and the company landed this year's Yahoo Finance Comeback of the Year award.",
      "Revenue from cryptocurrency trading transactions were up 165% year on year, contributing $61m to the total.",
      "Bitcoin (BTC-USD) has rallied since Donald Trump's election win, topping $108,000 on Tuesday, as investors look forward to a more favorable regulatory environment for cryptocurrencies once he returns to office.",
      "Robinhood doesn't currently offer cryptocurrency trading in the UK, and its CEO Vlad Tenev suggested in an interview with The Times that the UK's policy mindset towards crypto and margin trading was \"backwards\".",
      "Read more: Best paying FTSE 100 stocks of 2024",
      "When asked whether cryptocurrency trading launch was on the cards in the UK, Sinclair said: \"Well, we always listen to our customers as the first port of call, and I think customers increasingly want access to a wide range of asset classes.",
      "\"I think in the UK recently there [have been] some really great steps in terms of a regulatory framework and published regulatory roadmap which is always a great place to start for the UK in the crypto environment. We'll continue to listen to our customers and there's some really great steps on the regulatory framework side.\"",
      "Download the Yahoo Finance app, available for Apple and Android."
    ],
    "url": "https://finance.yahoo.com/news/robinhood-options-trading-uk-2025-085604965.html",
    "timestamp": "2024-12-20T08:56:05.000Z"
  },
  {
    "title": "Bitcoin is 'the right asset' to combat the US deficit: Sen. Lummis",
    "content": [
      "With President-elect Donald Trump's return to the White House quickly approaching, investors weigh the prospect of a strategic bitcoin (BTC-USD) reserve. Senator Cynthia Lummis (R-WY), who introduced the bipartisan Lummis-Gillibrand Responsible Financial Innovation Act focused on regulating crypto, joins Catalysts Co-Hosts Seana Smith and Madison Mills to talk about her stance on the Federal Reserve holding bitcoin.",
      "\"I want our federal government to have a strategic bitcoin reserve that can help back the US dollar as the world's reserve currency and then serve as a long-term savings account, thereby offsetting our national debt, which is over $36 trillion now,\" Lummis tells Yahoo Finance.",
      "The republican senator says, \"My proposal would have the US purchase, through other assets that already owns, 200,000 bitcoin a year for five years, for a total of a million, hold it for at least 20 years, and at the numbers that we project, that would accrue a fund that's worth about $16 trillion.\"",
      "Lummis adds the reason why the federal government has not already pursued bitcoin as a solution to the national deficit is because, as indicated by Fed Chair Jerome Powell at the Fed's Decemeber meeting, it doesn't believe the central bank has the legal authority to own bitcoin. \"We need to give that to them,\" she says.",
      "Check out Yahoo Finance's full interview with Senator Lummis here. Also catch Senator Kirsten Gillibrand (D-NY) discuss crypto regulation and Trump's pick for Paul Atkins to lead the Securities and Exchange Commission (SEC) with Yahoo Finance.",
      "To watch more expert insights and analysis on the latest market action, check out more Catalysts here.",
      "This post was written by Naomi Buchanan."
    ],
    "url": "https://finance.yahoo.com/video/bitcoin-asset-combat-us-deficit-003000865.html",
    "timestamp": "2024-12-20T00:30:00.000Z"
  },
  {
    "title": "Dow snaps 10-day losing streak, Nasdaq and S&P 500 tick lower",
    "content": [
      "The Dow Jones Industrial Average (^DJI) snaps its ten-day losing streak by closing Thursday's session just 0.04% higher, while the Nasdaq Composite (^IXIC) and S&P 500 (^GSPC) move lower by nearly 10% a piece.",
      "Market Domination Overtime's Julie Hyman and Yahoo Finance markets and data editor Jared Blikre review market performances following the Federal Reserve's latest round of interest rate cuts on Thursday, including the latest moves in the bond market (^TYX, ^TNX, ^FVX), the US dollar (DX-Y.NYB), and bitcoin (BTC-USD).",
      "To watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime here.",
      "This post was written by Luke Carberry Mogan."
    ],
    "url": "https://finance.yahoo.com/video/dow-snaps-10-day-losing-210950442.html",
    "timestamp": "2024-12-19T21:09:50.000Z"
  },
  {
    "title": "Accenture, Robinhood and Coinbase, Vertex: Market Minute",
    "content": [
      "Yahoo Finance host Rachelle Akuffo dives into three stories from several of the top trending stock tickers on the Yahoo Finance platform.",
      "Accenture (ACN) shares are popping after topping its fiscal first quarter earnings estimates.",
      "Brokerage site Robinhood Markets (HOOD) and crypto exchange Coinbase Global (COIN) see their stocks move higher amid bitcoin's recent volatility (BTC-USD).",
      "Lastly, Vertex Pharmaceuticals (VRTX) shares are dropping Thursday morning in response to its Phase 2 trial results for its new non-opioid painkiller.",
      "To watch more expert insights and analysis on the latest market action, check out more Wealth here.",
      "This post was written by Luke Carberry Mogan."
    ],
    "url": "https://finance.yahoo.com/video/accenture-robinhood-coinbase-vertex-market-170142684.html",
    "timestamp": "2024-12-19T17:01:42.000Z"
  },
  {
    "title": "Bitcoin's long-term growth 'far exceeds' the US dollar: Sen. Lummis",
    "content": [
      "While Federal Reserve Chair Jerome Powell was adamant that the central bank could not own bitcoin (BTC-USD), Senator Cynthia Lummis (R-WY) believes 2025 is shaping up to be \"the year for bitcoin & digital assets\" in a social media post from earlier this week.",
      "Senator Lummis — who has championed the bipartisan Lummis-Gillibrand Responsible Financial Innovation Act (RFIA) alongside Democratic Senator Kirsten Gillibrand (D-NY) — has been a vocal supporter of President-elect Donald Trump's choice of David Sacks as the incoming administration's \"AI and crypto czar\" and what it represents for the crypto space.",
      "Senator Lummis sits down with Seana Smith and Madison Mills on Catalysts to discuss the outlook of a US strategic bitcoin reserve, calling the landmark cryptocurrency \"the right asset\" and \"digital gold\" for being a finite resource.",
      "\"Only 21 million bitcoin will ever be mined. And it has the elements of strength. And even though it's slightly volatile, it's always volatile in an upward-leaning direction. And so the goal here of holding it for 20 years is in recognition that on the short term, there is short-term volatility. On the long term, there is long-term growth that far exceeds the ability of the US dollar to keep up.\"",
      "Bitwise Asset Management CIO Matt Hougan told Yahoo Finance this week that a US investment into a strategic bitcoin reserve could propel the cryptocurrency's price to $500,000.",
      "\"The US dollar is designed to debase. The Fed has a goal of 2% per year inflation, whereas bitcoin's goal is to far, far exceed in value inflation and far exceed the value of the US dollar,\" Sen. Lummis explains. \"And so far from inception, it has done exactly that. It's grown about 55% per year. And if you look at the long term, over time, it'll drop from 55% a year to 45% a year to 35% a year. But it will continue to grow where the US dollar will continue to decline in value.\"",
      "Catch Yahoo Finance's full interview with Senator Kirsten Gillibrand (D-NY), where the lawmaker speaks more about the crypto regulation bill and Trump's choice Paul Atkins as the next chair of the Securities and Exchange Commission (SEC).",
      "To watch more expert insights and analysis on the latest market action, check out more Catalysts here.",
      "This post was written by Luke Carberry Mogan."
    ],
    "url": "https://finance.yahoo.com/video/bitcoins-long-term-growth-far-164309264.html",
    "timestamp": "2024-12-19T16:43:09.000Z"
  },
  {
    "title": "No title found",
    "content": [],
    "url": "https://finance.yahoo.com/m/0a400e57-1e36-3dd7-8779-5e2a409d1918/xrp-2025-predictions-can.html",
    "timestamp": null
  },
  {
    "title": "Stock futures recover, government shutdown, Micron: 3 Things",
    "content": [
      "US stock futures (ES=F, NQ=F, YM=F) are staging a slow recovery from yesterday's sell-off fueled by the Federal Reserve's latest interest rate cut and forecasts that illustrate the central bank's plans to cut less in 2025.",
      "Backing President-elect Donald Trump's sentiments, Elon Musk is a pivotal voice in opposing House Speaker Mike Johnson's (R) proposed funding deal, intensifying worries of a government shutdown over this weekend right before the holidays.",
      "Micron Technology (MU) shares fall lower after releasing fiscal second quarter revenue forecasts that fell below Wall Street expectations. Nike (NKE) is set to report earnings after Thursday's market close.",
      "To watch more expert insights and analysis on the latest market action, check out more Morning Brief here.",
      "This post was written by Luke Carberry Mogan."
    ],
    "url": "https://finance.yahoo.com/video/stock-futures-recover-government-shutdown-141323172.html",
    "timestamp": "2024-12-19T14:13:23.000Z"
  }
]