[
  {
    "title": "Accenture, Robinhood and Coinbase, Vertex: Market Minute",
    "content": [
      "Yahoo Finance host Rachelle Akuffo dives into three stories from several of the top trending stock tickers on the Yahoo Finance platform.",
      "Accenture (ACN) shares are popping after topping its fiscal first quarter earnings estimates.",
      "Brokerage site Robinhood Markets (HOOD) and crypto exchange Coinbase Global (COIN) see their stocks move higher amid bitcoin's recent volatility (BTC-USD).",
      "Lastly, Vertex Pharmaceuticals (VRTX) shares are dropping Thursday morning in response to its Phase 2 trial results for its new non-opioid painkiller.",
      "To watch more expert insights and analysis on the latest market action, check out more Wealth here.",
      "This post was written by Luke Carberry Mogan."
    ],
    "url": "https://finance.yahoo.com/video/accenture-robinhood-coinbase-vertex-market-170142684.html",
    "timestamp": "2024-12-19T17:01:42.000Z"
  },
  {
    "title": "No title found",
    "content": [],
    "url": "https://finance.yahoo.com/m/0a400e57-1e36-3dd7-8779-5e2a409d1918/xrp-2025-predictions-can.html",
    "timestamp": null
  },
  {
    "title": "Strength for the Dollar as the Fed Looks More Hawkish",
    "content": [
      "The Federal Reserve (‘the Fed’) cut its funds rate to 4.25-4.5% on Wednesday 18 December as widely expected, but the primary intrigue from the meeting was the new dot plot indicating that only two cuts are likely next year. This gave the dollar significant tailwinds and challenged many other instruments. This article summarises recent news and data affecting American monetary policy then looks briefly at the charts of gold and bitcoin.",
      "The likelihood of only two cuts by the Fed in 2025 is a significant change from the previous dot plot which suggested four. The Fed has also revised its expectations for growth in the USA upward compared to September; GDP is now expected to go up 2.5% in 2024 and 2.1% next year. The outlook for inflation was also revised up and unemployment down. A small majority of participants now expects the Fed to hold until the second quarter of 2025:",
      "Although there had been some possibility that the Fed would slow down further next year since last month, that wasn’t the consensus view until after the latest meeting. On the whole, GDP has been significantly stronger than expected in 2024 while inflation started to rise again in October. It’s not clear yet whether the latest increases by inflation are the beginning of a new trend, so traders are likely to watch CPI and PCE closely over the next several months for clues on when the Fed might cut again.",
      "This new situation is basically negative for gold, but the overall context is more ambiguous for cyclical instruments like shares and many cryptocurrencies. While higher rates are a challenge, the generally positive economic situation stands in sharp contrast to long-running expectations for a recession.",
      "Next week is particularly inactive in terms of scheduled news and data because of the holidays in many major countries. However, volatility might increase just before Christmas: a ‘Santa rally’ seems to be possible based on the mostly sharp reactions to the news from the Fed, but that depends on sentiment.",
      "Gold’s reaction to the news of only two likely cuts next year was pretty typical. Demand is likely to be at least somewhat lower than in the first three quarters of 2024 now that rates will probably remain higher for longer. However, demand for havens is unlikely to decrease significantly in the near future amid turbulence in Syria and Donald Trump’s upcoming inauguration.",
      "The initial reaction to the Fed’s meeting seems to have been somewhat excessive, with the price retracing around half of the loss on 19 December. There’s been no clear increase in the volume of selling. $2,600 seems like a moderately strong area of support based on the bounces from there in late November and around 6 December.",
      "However, the main strong support in focus is the 100% weekly Fibonacci extension around $2,545. The next movement might be either back to the value area between the 50 and 100 SMAs or a retest of $2,550 depending on momentum and sentiment in the next few days, but a clear longer term direction now seems unlikely to develop before the new year.",
      "Like gold, bitcoin retraced lower around the Fed’s latest meeting, which is a normal reaction as the outlook for monetary policy becomes less dovish. Bitcoin is arguably a bit less vulnerable than gold to higher rates because there are various ways for holders of transferable bitcoins, especially now that many coins are at or close to all-time highs. Participants in crypto markets view the likely policies of the incoming Republican government positively.",
      "Bitcoin’s momentum has been lower in December which makes sense as the price approached the critical and long-awaited area of $100,000. Volume has also decreased somewhat compared to the peak around the middle of last month and there’s no longer such a strong overbought signal as there had been for most of November. The latest retracement from the 100% weekly Fibonacci extension was also expected since this was the stretch target since the middle of last month.",
      "Given current strong sentiment, a move back below $90,000 seems unfavourable in the near future, but $100,000 could remain an important battleground. Now that the uptrend is clearly mature and participants seem inclined to buy more quickly during even relatively modest retracements, a retest of $108,000 seems likely in the next few weeks. However, traders should prepare for higher volatility during upcoming holidays.",
      "This article was submitted by Michael Stark, an analyst at ExnessExness.",
      "The opinions in this article are personal to the writer. They do not reflect those of Exness or FX Empire.",
      "This article was originally posted on FX Empire",
      "Tesla Shares Rise Again",
      "WisdomTree Buyers Looking Smart",
      "USD/CAD’s Uptrend Could Continue Around the NFP",
      "Limited Bounce for the Kiwi Dollar After the RBNZ",
      "Investors Learning to Love Duolingo",
      "Alphabet’s AI, Quantum Breakthroughs Drive Gains"
    ],
    "url": "https://finance.yahoo.com/news/strength-dollar-fed-looks-more-115107585.html",
    "timestamp": "2024-12-19T11:51:07.000Z"
  },
  {
    "title": "Core Scientific finds a balance in bitcoin mining and AI: CEO",
    "content": [
      "Some bitcoin (BTC-USD) miners are shifting into artificial intelligence (AI) and selling their existing power to AI data centers as Big Tech companies look for power sources capable of meeting the energy-intensive needs of AI infrastructure.",
      "Core Scientific (CORZ) CEO and president Adam Sullivan joins Madison Mills on Catalysts to talk about how the company is balancing its resources to facilitate crypto mining and AI data centers.",
      "\"We were the largest bitcoin mining company for the past three years, and that's really driven by the fact that we had to bring in traditional data center people to actually run the business. That's really been our differentiator,\" Sullivan tells Yahoo Finance.",
      "The CEO says, \"We think of ourselves as a digital infrastructure company, whether it's building data centers for bitcoin mining or whether it's building data centers to host hundreds of megawatts of [Nvidia's (NVDA)] GB200 that you guys were talking about earlier, you know, our core competency is driven through large-scale digital infrastructure.\"",
      "Looking to 2025, the company expects \"a relatively equal split\" between crypto mining and AI. Sullivan adds, \"Our expectation is to continue to grow the data center part of the business, which is just a radical shift from the high volatility bitcoin mining space moving into the data center space\" as the \"long-term contracts\" provide \"a lot of long-term and free cash-flow stability that investors really enjoy.\"",
      "Watch the video above to learn more about how Core Scientific is balancing the needs of bitcoin mining and AI customers.",
      "To watch more expert insights and analysis on the latest market action, check out more Catalysts here.",
      "This post was written by Naomi Buchanan."
    ],
    "url": "https://finance.yahoo.com/video/core-scientific-finds-balance-bitcoin-173651153.html",
    "timestamp": "2024-12-18T17:36:51.000Z"
  },
  {
    "title": "No title found",
    "content": [],
    "url": "https://finance.yahoo.com/m/f1dd84a4-67b4-3f23-9bb4-27eb6d58b28c/xrp-price-slips-why-the.html",
    "timestamp": null
  },
  {
    "title": "No title found",
    "content": [],
    "url": "https://finance.yahoo.com/m/c34baa4d-c148-30c5-827d-f98f63cc1e9f/bitcoin-price-breaks-record.html",
    "timestamp": null
  },
  {
    "title": "Nasdaq, 'super-bullish' sentiment, bitcoin: Market Takeaways",
    "content": [
      "While the Dow Jones Industrial Average (^DJI) closes lower for its ninth consecutive session, the Nasdaq Composite (^IXIC) continues to float around its all-time record high above 20,100.",
      "Yahoo Finance markets and data editor Jared Blikre joins Asking for a Trend to lay out the biggest market themes of today's trading session, including Bank of America's global fund managers survey which notes \"super-bullish\" risk sentiments from traders and bitcoin's (BTC-USD) record run above $106,000.",
      "To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend here.",
      "This post was written by Luke Carberry Mogan."
    ],
    "url": "https://finance.yahoo.com/video/nasdaq-super-bullish-sentiment-bitcoin-224500022.html",
    "timestamp": "2024-12-17T22:45:00.000Z"
  },
  {
    "title": "A US strategic reserve could push bitcoin to $500K: Bitwise CIO",
    "content": [
      "Bitcoin (BTC-USD) is hovering around its all-time high reached earlier this week, currently above $106,000. Bitwise Asset Management CIO Matt Hougan expects bitcoin's run to continue straight from here and even reach $200,000 by this time next year.",
      "\"The real story is people just wake up to bitcoin at different paces — We saw retail investors get their first, we've seen companies and financial advisors get there, we're starting to see institutions get there,\" Hougan tells Market Domination's Julie Hyman and Josh Lipton.",
      "\"And once they realize that bitcoin is not going away, that it belongs in a portfolio, they have to get off zero, get to 1%. Blackrock now says 2%. So it's just this cascading series of educational breakthroughs that brings new people into the market.\"",
      "Bitwise operates several of its own bitcoin (BITB, BITC, BTOP) and crypto (BITQ, BITW) ETFs.",
      "Hougan comments on the tailwind a US investment into a strategic bitcoin reserve could bring to the cryptocurrency's pricing, while also touching upon crypto exchange Coinbase Global's (COIN) potential growth.",
      "To watch more expert insights and analysis on the latest market action, check out more Market Domination here.",
      "This post was written by Luke Carberry Mogan."
    ],
    "url": "https://finance.yahoo.com/video/us-strategic-could-push-bitcoin-213000587.html",
    "timestamp": "2024-12-17T21:30:00.000Z"
  },
  {
    "title": "Is bitcoin the best portfolio diversifier over gold and bonds?",
    "content": [
      "With the new year just around the corner, investors may be revisiting their portfolio allocation strategy to make sure they are best positioned for 2025. Yahoo Finance host Madison Mills examines the correlation of bond yields (^FVX, ^TNX, ^TYX), gold (GC=F), and bitcoin (BTC-USD) to equity performance.",
      "Recent analysis from BlackRock shows that government bonds are heavily correlated with equity performance, while bitcoin and gold are more independent. This could suggest that cryptocurrency and commodities are better suited to be portfolio diversifiers.",
      "To watch more expert insights and analysis on the latest market action, check out more Morning Brief here.",
      "This post was written by Naomi Buchanan."
    ],
    "url": "https://finance.yahoo.com/video/bitcoin-best-portfolio-diversifier-over-180000957.html",
    "timestamp": "2024-12-17T18:00:00.000Z"
  },
  {
    "title": "Top tax tips for crypto traders ahead of tax season",
    "content": [
      "Are you a crypto investor concerned about how your digital asset investments will impact your tax bill? Gordon Law Partner Tax Attorney & CPA Andrew Gordon joins Wealth to provide guidance on cryptocurrency tax implications.",
      "\"Crypto investing is unlike investing in any other stock or security,\" Gordon states. He emphasizes that unlike traditional investments, tax reports aren't automatically generated for cryptocurrency transactions. Instead, the responsibility falls on individual crypto traders to report their activities, warning that \"if you don't report properly you could have severe penalties or even worse.\"",
      "Gordon highlights crypto donations as one potential tax reduction strategy. He explains that investors who realize capital gains on their cryptocurrency investments can donate a portion to charity, receiving a deduction that could significantly reduce their tax bill.",
      "For a detailed explanation of the new cryptocurrency regulations taking effect in 2025, and their tax implications, watch the full interview above with Gordon Law Partner Tax Attorney & CPA Andrew Gordon.",
      "To watch more expert insights and analysis on the latest market action, check out more Wealth here.",
      "This post was written by Angel Smith"
    ],
    "url": "https://finance.yahoo.com/video/top-tax-tips-crypto-traders-174500079.html",
    "timestamp": "2024-12-17T17:45:00.000Z"
  }
]