[
  {
    "title": "Is NVIDIA Corp. (NASDAQ:NVDA) a NASDAQ Stock with the Highest Upside Potential?",
    "content": "We recently published a list of the 13 NASDAQ Stocks with the Highest Upside Potential. In this article, we are going to take a look at where NVIDIA Corp. (NASDAQ:NVDA) stands against other NASDAQ stocks with high upside potential.\n\nOn April 7, Dan Ives of Wedbush Securities joined CNBC’s ‘Squawk on the Street’ to discuss how the current tariff environment could impact tech supply chains. Musk’s actions and Trump’s tariffs have contributed to broad economic uncertainty, which Ives also referred to as the economic Armageddon for US tech in an earlier conversation. He expressed concern about the structural supply chain challenges posed by recent tariffs and geopolitical tensions. Ives highlighted that the US tech sector has historically maintained an edge over China but this could be wiped out if manufacturing were relocated to the US. The logistical hurdles of building manufacturing plants in the US are not negligible and it would take 4 to 5 years to establish facilities capable of sustaining production levels comparable to those in Asia.\n\nHe also acknowledged that he hasn’t downgraded major stocks like the ones in MAG7 but remains cautious. If these previously highlighted issues persist for months, Ives anticipates drastic cuts in earnings. This uncertainty surrounding tariffs could lead to lower demand for emerging technologies like AI and cybersecurity. He explained that this situation could severely impact the US tech companies and lead to broader cuts across the tech sector — potentially up to 25% in earnings. He also criticized Elon Musk’s political involvement, which he believes has caused permanent damage to his brand and customer base. He estimated a 20% demand destruction in Europe and 10% in the US.\n\nWe used the Finviz stock screener to select the 13 stocks with the highest analysts’ upside potential (at least 35%) as of April 8. The stocks are ranked in ascending order of their upside potential. We have also added the hedge fund sentiment for each stock, as of Q4 2024, which was sourced from Insider Monkey’s database.\n\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\n\nA close-up of a colorful high-end graphics card being plugged in to a gaming computer.",
    "url": "https://finance.yahoo.com/news/nvidia-corp-nasdaq-nvda-nasdaq-004950094.html",
    "timestamp": "2025-04-14T00:49:50.000Z"
  },
  {
    "title": "Nvidia and Broadcom Helped Propel This ETF 18% Higher in a Single Day. Here's Why It's Still a Buy Now.",
    "content": "It's been a wild week for semiconductor stocks. And for good reason, as tariffs throw a wrench into global supply chains and capital spending, thereby affecting demand for chips.\n\nOne of the largest semiconductor exchange-traded funds (ETFs) by net assets is the iShares Semiconductor ETF (NASDAQ: SOXX). The fund surged 19% on Wednesday, fueled by huge gains in top holdings like Nvidia and Broadcom, as the market skyrocketed in hopes that trade tensions could ease.\n\nHere's why the ETF stands out as a solid buy for folks looking for chip companies to invest in artificial intelligence (AI) and growing global connectivity.\n\nThe iShares Semiconductor ETF is a textbook example of why a fund can hold dozens of stocks but still be highly volatile if it is tied to one theme.\n\nAs mentioned, the fund surged on Wednesday. Before that, it fell 4% on Tuesday; was up 2% on Monday, fell 7.5% on April 2; and dropped 10% on April 3. When the dust had settled, the fund was down 3% in those five days, showcasing the extent of the sell-off in chip stocks before Wednesday's monster rally.\n\nWhen equity prices are swinging this wildly to the upside and the downside, it can be difficult to stay on an even keel. But maintaining a long-term outlook is the best way to approach the semiconductor industry and the iShares Semiconductor ETF.\n\nThe fund gives investors exposure to different aspects of the chip industry. Nvidia is the undisputed leader in making graphics processing units (GPUs) for AI applications.\n\nBroadcom makes accelerator chips, or application-specific integrated circuits (ASICs) that are built for AI tasks. The company also has a growing software-as-a-service platform through its acquisition of VMware, as well as an established network connectivity hardware division.\n\nThe third-largest holding in the fund, Texas Instruments, is an established player in analog and embedded chips mainly used for the industrial and automotive sectors.\n\nQualcomm is the fourth-largest holding in the fund, with a 6.8% weighting. The company is a leader in smartphone chip manufacturing, and its processors power Samsung's generative-AI-enabled Galaxy smartphones.\n\nAdvanced Micro Devices is the fifth-largest holding. It has an entrenched position in central processing units but is trying to grow its market share in GPUs for data centers that compete with Nvidia. AMD has been relatively unsuccessful so far, a testament to Nvidia's lead over the competition.\n\nAll told, the top five holdings make up 38% of the fund. With 30 total holdings, it is well diversified across the chip industry. It's a solid way to get exposure to chip designers, manufacturers, components and equipment suppliers, and other parts of the semiconductor industry.",
    "url": "https://finance.yahoo.com/news/nvidia-broadcom-helped-propel-etf-221700118.html",
    "timestamp": "2025-04-13T22:17:00.000Z"
  },
  {
    "title": "2 AI Stocks That Could Help Set You Up for Life",
    "content": "The stock market may seem like a difficult place right now, with indexes taking new directions from day to day and even from hour to hour. President Donald Trump's tariffs on imports have stoked concern about corporate profits moving forward and the health of the general economy. The president has put a 90-day pause on his initial plan to allow for negotiations between the U.S. and trading partners, but until solutions are found, stock market volatility could persist.\n\nBut this doesn't mean you should avoid investing. In fact, now, while valuations are down, is a great moment to pick up shares of top-quality companies -- even some that could help set you up for life. What I mean by this is if you buy shares of these particular players today and hold on for the long term, you might score a major win.\n\nCompanies present in the area of artificial intelligence (AI) offer particularly strong buying opportunities as they've dropped considerably in recent weeks. Yet, many are still well positioned to gain over the long term as the AI boom continues. Let's check out two that could supercharge your portfolio.\n\nNvidia (NASDAQ: NVDA) has been the star of the AI show so far, and that's likely to continue thanks to this tech giant's focus on innovation. The company makes the highest-performance graphics processing units (GPUs), or chips, that exist today. As a result, customers are willing to wait their turn to get their hands on the latest versions. As Nvidia launched its new Blackwell architecture and chip this past winter, demand surpassed supply, and the platform brought in $11 billion in its first quarter of commercialization.\n\nEven better, Nvidia has promised to update GPUs annually and has already spoken publicly and in detail about its roadmap for the coming two years. This rapid pace of innovation should keep Nvidia ahead of the competition. And from what we can see from customer behavior so far, demand will likely remain high for Nvidia's newest releases.\n\nIt's also important to note that Nvidia sells not only chips but also a complete suite of AI products and services. The company is even expanding into quantum computing by constructing a quantum research center in Boston. So, even if Nvidia stock stagnates in the near term amid today's tariff uncertainty, the company is well positioned to benefit from AI and quantum computing growth over time.\n\nThat's why, trading for 23x forward earnings estimates right now, Nvidia stock looks like a particularly good deal -- that may eventually help put you on the path to wealth.",
    "url": "https://finance.yahoo.com/news/2-ai-stocks-could-help-221000410.html",
    "timestamp": "2025-04-13T22:10:00.000Z"
  },
  {
    "title": "Nvidia Shares Are Down 25% From 52-Week High -- Should You Buy, Hold, or Sell Now?",
    "content": "Shares of semiconductor giant Nvidia (NASDAQ: NVDA) surged 18.7% on April 9, after President Trump announced a 90-day pause on the higher \"reciprocal tariffs.\" Instead, he has authorized a \"lowered reciprocal tariff of 10%\" -- in line with the 10% baseline tariff set on all imports.\n\nInvestors had long been worried about the U.S. government's decision to impose import tariffs on products from various trading partners. Since this can lead to rising costs, disruptions in the supply chain, and retaliatory tariffs on American goods, many U.S. stocks saw a dramatic decline in early April 2025. The temporary pause in reciprocal tariffs seems well received by Wall Street.\n\nNvidia's stock is down nearly 25% from its recent high in January 2025. Although this is not a very encouraging sign, it is a solid improvement from the almost 38% drawdown from the high on April 4.\n\nSo, does valuation correction present an opportunity for investors to buy, hold, or sell Nvidia stock now? Let's find out.\n\nRegulatory risks have emerged as a primary headwind for Nvidia. In April 2025, the U.S. government announced its decision to levy a hefty 32% tariff on imports from Taiwan and a 34% tariff from China. China responded by levying 84% retaliatory tariffs on imports from the U.S. In retaliation, the U.S. government has increased tariffs on Chinese imports to 104%.\n\nAlthough semiconductors have been excluded from this round of tariffs, there are signals of a potential escalation of trade wars between the U.S. and China.\n\nJefferies analysts fear the possibility of additional sector-specific tariffs, including semiconductors, in subsequent tariff rounds. If true, it can lead to significant supply chain disruptions and margin pressures for Nvidia, considering that the company depends heavily on Taiwan Semiconductor Manufacturing's fabs for chip manufacturing.\n\nThe U.S. government has long been mulling stricter controls on chip sales to China. The Chinese government's recently introduced energy-efficiency guidelines, also urge companies to use chips adhering to strict requirements in new data centers or expansions. Since Nvidia's best-selling H20 chip does not fulfil these requirements, it may hurt the company's Chinese business -- accounting for almost 13% of its revenues in fiscal 2025 (ending Jan. 26).\n\nNvidia is also encountering competitive pressures, though other chip manufacturers are significantly behind in the artificial intelligence (AI) race. The company is also experiencing short-term gross margin pressures due to the ongoing ramp-up of its Blackwell systems.",
    "url": "https://finance.yahoo.com/news/nvidia-shares-down-25-52-194500957.html",
    "timestamp": "2025-04-13T19:45:00.000Z"
  },
  {
    "title": "NVIDIA (NVDA) To Spend Billions on US-Made AI Hardware Amid Tariffs",
    "content": "We recently published a list of 30 Best AI Stocks to Buy According to Billionaires. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against other best AI stocks to buy according to billionaires.\n\nThe optimism around the United States economy over the past few months, largely due to the AI hype, has been dampened by recent measures undertaken by the Trump administration to shore up US manufacturing. These measures, largely in the form of obscene tariffs on goods imported into the US from overseas, with a particular focus on China, have hit global stocks, resulting in a downward spiral for major indexes. The latest tariff hike has wiped trillions in market capitalization from the Magnificent Seven, a group of seven firms that dominate the benchmark US indexes and are heavily invested in AI. Latest reports from market research firm IDC indicate that if the tariffs stay in place, they are expected to trigger supply chain disruptions and inflationary challenges across various markets, including the IT sector. According to a report from news agency Reuters, global hedge funds, dominated by billionaires, scaled back their risky bets and sought safety before Trump introduced new tariffs last week.\n\nThis report was based on data gathered by investment bank Goldman Sachs. Per the data, hedge funds pulled out of bets in emerging markets of Europe and Asia ahead of the announcement of new tariffs. Research by investment bank Morgan Stanley, as seen by Reuters, also echoes these sentiments. Morgan Stanley estimates US long-short funds net leverage quickly fell to 37%, just shy of historical lows, by the end of last week, from over 50% at the beginning of the year. Net leverage measures the difference between a fund’s long and short positions against the value of what it owns including borrowings. JPMorgan also noted in a recent report that the net leverage of hedge funds has dropped to around the lowest since late 2023. The lower the net leverage, the more conservative a hedge fund’s position. Investors expect significant volatility on risk assets in the near term given the tariff uncertainties and suggest a continued risk-off stance.\n\nRead more about these developments by accessing 10 Best AI Data Center Stocks and 10 Buzzing AI Stocks According to Goldman Sachs.\n\nThe latest developments represent a reversal of positions from billionaires who, in the past few months, have often hailed AI as the next transformative technology that would shape the future of economies, industries, and society. Influential billionaires repeatedly advocated for investing heavily in AI for the immense economic value it promised. This bullish thesis was based on research from firms like McKinsey that predicted that AI could add up to $4.4 trillion annually to the global economy in the coming years. For investors, this translated into a chance to own stakes in technologies that could underpin the next generation of global growth. For billionaire investors, AI also represented both a diversification strategy and a chance to influence the direction of a powerful new technology. These investors often take strategic stakes that allow them to shape product development and scaling. Some of the biggest companies these investors made huge bets on are discussed in detail below.",
    "url": "https://finance.yahoo.com/news/nvidia-nvda-spend-billions-us-182941880.html",
    "timestamp": "2025-04-13T18:29:41.000Z"
  },
  {
    "title": "Don't Worry, AI Investors, the Artificial Intelligence Boom Is Still on -- But There Are Rising Dangers for Nvidia",
    "content": "Despite there being no signs of the artificial intelligence (AI) boom slowing down, AI stocks writ large have been hammered in 2025 due to the Trump Administration's tariff threats and policies.\n\nAI stocks have obviously risen significantly over the past two years, so they did come into the year at relatively high valuations. And the threat of economic recession has legitimately called into question the massive AI investments forecasted by leading tech companies earlier this year.\n\nFortunately, on Wednesday, April 9, the administration pared back the most extreme reciprocal tariffs. Also last week, several big tech CEOs reiterated their huge AI investment plans this year while indicating that AI demand remains incredibly strong.\n\nBut with those bullish comments also came some remarks that pose risks for the biggest AI company of all: Nvidia (NASDAQ: NVDA).\n\nFirst, the good news. Even amid the tremendous market turmoil, the AI revolution still appears to be in full swing. In fact, two \"Magnificent Seven\" company CEOs confirmed this just this week, even as markets plunged.\n\nFirst, Alphabet (NASDAQ: GOOG)(NASDAQ: GOOGL) held its Google Cloud Next 2025 event last week, which probably flew under many investors' radars. At the event, not only were there a number of exciting announcements, especially with regard to Google's new Gemini 2.5 model, but CEO Sundar Pichai also confirmed Alphabet's previously announced plans to spend a massive $75 billion on AI data centers this year. Pichai added that spending is yielding good returns, saying, \"The opportunity with AI is as big as it gets.\"\n\nAnd not only did Alphabet executives talk bullishly about their AI offerings and Google Cloud, but Google's cloud customers did, too. At the event, customer Intuit confirmed that it was \"doubling down\" on AI efforts, while another big customer, Verizon, described huge benefits from using Google's AI models.\n\nMeanwhile, it's not just the tariff fallout but also the introduction of China's low-cost model DeepSeek R1 in January that has roiled AI stocks. But on Thursday, Amazon (NASDAQ: AMZN) CEO Andy Jassy put concerns over the need for all that spending to rest in an interview on CNBC. He noted:\n\nPeople get confused. And we saw this with AWS [Amazon Web Services] too, which is, customers love when you take the cost per unit of something down, it allows them to save money on what they're doing, but they don't actually spend less. It actually unleashes them to do a lot more innovation, and in absolute they spend more.",
    "url": "https://finance.yahoo.com/news/dont-worry-ai-investors-artificial-160000300.html",
    "timestamp": "2025-04-13T16:00:00.000Z"
  },
  {
    "title": "Secretary Lutnick pours cold water on tech tariff exemptions",
    "content": "The technology sector, or at least a key part of it, breathed easier on Saturday after President Trump said that various industries, including semiconductors, computer hardware, and smartphones, would be exempt from the steep reciprocal tariffs put in place this month.\n\nThe reprieve, however, may only be temporary, according to Commerce Secretary Howard Lutnick.\n\nLutnick, a key proponent of tariffs to re-spark U.S. manufacturing, provided more insight into technology sector import taxes on Sunday. His message renews uncertainty for major U.S. technology companies, including Apple, Dell, and Nvidia, which depend heavily on overseas production to keep costs low.\n\nThe stock market's back-to-back 20% plus returns in 2023 and 2024 were largely driven by strength in America's biggest technology stocks. The so-called magnificent seven, comprising Apple, Microsoft, Amazon, Alphabet (Google), Meta Platforms (Facebook), Nvidia, and Tesla, were top performers, partly thanks to rising excitement over artificial intelligence.\n\nAfter OpenAI's ChatGPT became the fastest app to reach one million users in 2022, big tech poured billions of dollars into training and operating its own large-language AI models, or AI chatbots, and agentic AI programs designed to complement and, in some cases, replace workers.\n\nThe research has been widespread, and AI is already making an impact.\n\nBanks are using AI to manage risks, retailers are exploring its use in supply chains and to prevent theft, and manufacturers are evaluating its use to remove production bottlenecks. Even the military is in on the action, considering how it may provide an edge on the battlefield.\n\nAI's rapid adoption has meant a significant refresh cycle across all technology infrastructures.\n\nCentral processing units deployed in enterprise and cloud networks, like those run by Google, Amazon, and Microsoft, are being replaced by graphic processing units (GPUs) made by Nvidia, better suited to handling the massive compute power necessary for AI development. Similarly, servers and computers are getting upgraded, boosting revenue for players like Dell and Super Micro.\n\nIn 2025, Microsoft, Meta Platforms, Google parent Alphabet, and Amazon plan to spend about $325 on the stuff necessary to run and grow their businesses, much of it on AI.\n\nThose plans, however, could get rethought following tariffs that could increase expenses and slow the economy.",
    "url": "https://finance.yahoo.com/news/secretary-lutnick-pours-cold-water-153509854.html",
    "timestamp": "2025-04-13T15:35:09.000Z"
  },
  {
    "title": "What is the future of Nvidia’s products for the China market?",
    "content": "Investing.com -- Analysts continue to expect meaningful restrictions on Nvidia’s H20 chip in China, despite a recent media report suggesting the U.S. Commerce Department may allow shipments to proceed.\n\nThe H20, a performance-limited version of Nvidia’s flagship H100 GPU, was designed to comply with U.S. export controls by staying below a specific teraflop-per-square-millimeter performance threshold. Nvidia (NASDAQ:NVDA) has described the H20 as addressing \"a very competitive space,\" but Morgan Stanley noted its performance is roughly 75% below that of the H100, which was barred from export to China last year.\n\nWhen you force the best AI hardware company in the world to compete at what is now 85% or more below the state of the art performance level, pricing will be competitive,” analysts at Morgan Stanley wrote. They estimate gross margins on the H20 are in the 50% range, well below Nvidia’s corporate average in the 70s, and said H20 strength contributed to weaker gross margins over the past two quarters.\n\nA report on NPR.com suggested that although H20 was initially targeted for restriction, the U.S. government may now allow continued shipments. Morgan Stanley said the report \"has not been confirmed\" and maintained that restrictions remain its base case.\n\nMorgan Stanley pointed to U.S. export bans on high-end chips, which would drive Chinese firms not buy the H20, while newer Blackwell GPUs offer as much as 25 times the performance,That leaves Chinese companies with limited choices: using GPUs in foreign cloud platforms (where permitted), sourcing restricted chips through secondary markets (which is not allowed), or buying compliant chips like the H20 or AMD’s MI308.\n\nThe analysts said the public cloud is not a viable solution for all Chinese users and that back-channel procurement of high-end chips is likely overestimated, due to legal and financial risks. Which leaves companies with option 3, analyst say. And while buying performance that far behind the state of the art isn’t optimal, it’s the only option available, and companies have shown good results.\n\nRelated articles\n\nHenderson Land PT Lowered to HK$25.60 at JPMorgan\n\nJapan Hotel REIT Investment Corporation PT Raised to JPY87,746 at CLSA\n\nSnowflake Inc. PT Raised to $197 at Wolfe Research",
    "url": "https://finance.yahoo.com/news/future-nvidia-products-china-market-120003545.html",
    "timestamp": "2025-04-13T12:00:03.000Z"
  },
  {
    "title": "China Credit Expansion Beats Forecast on Bond Sale Deluge",
    "content": "(Bloomberg) -- China’s credit expanded more than expected in March as the government accelerated bond offerings to help the economy offset the impact of surging US tariffs on Chinese goods.\n\nMost Read from Bloomberg\n\nThe Secret Formula for Faster Trains\n\nNYC Tourist Helicopter Crashes in Hudson River, Killing Six\n\nEven Oslo Has an Air Quality Problem\n\nInside the Quiet, Extravagant Expansion of the Frick Collection\n\nLisbon Mayor Wants Companies to Help Fix City’s Housing Shortage\n\nAggregate financing, a broad measure of credit, rose 5.89 trillion yuan ($808 billion), according to Bloomberg calculations based on data released by the People’s Bank of China on Sunday. That compares with a median forecast of 4.96 trillion yuan by economists in a Bloomberg survey, and an increase of 4.83 trillion yuan in the same month a year ago.\n\nFinancial institutions offered 3.64 trillion yuan of new loans in the month, Bloomberg calculations showed. The median forecast was 3 trillion yuan.\n\nBigger government bond sales were a key driver of aggregate financing last month as business demand for longer-term credit stayed weak. March is also traditionally a strong month for borrowing because banks tend to extend more credit at the end of each quarter to meet lending targets.\n\nListen to the Here’s Why podcast on Apple, Spotify or anywhere you listen\n\nNet sovereign and local bond financing reached nearly 1.5 trillion yuan last month, the highest for any March since at least 2017, according to PBOC data. The bond deluge came after China vowed to front-load fiscal spending earlier this year on anticipation of looming trade tensions with the US.\n\nChina’s economy likely held up in the first quarter before the trade conflict between the world’s two biggest economies escalated. Newly added US levies on Chinese goods now stand at 145%, well above levels economists say would decimate bilateral shipments, which were worth $690 billion in 2024.\n\nThe impact of the punitively high tariffs is gradually kicking in, with US retailers suspending orders and halting shipments amid the deep uncertainty. At stake are millions of jobs in China’s sprawling manufacturing sector and Beijing’s ambitious goal of growing the economy by around 5% this year.\n\nThe US late Friday announced it exempted smartphones, computers and other electronics from its so-called reciprocal tariffs, which could provide some relief for Chinese exporters as the exclusion covers more than $101 billion in goods from the country. However, Trump’s policy flip-flop also underscores the massive uncertainty faced by the Chinese economy.",
    "url": "https://finance.yahoo.com/news/china-credit-expansion-beats-forecast-114344802.html",
    "timestamp": "2025-04-13T11:43:44.000Z"
  },
  {
    "title": "5 big analyst AI moves: Apple upgraded after pullback, Citi cautious on Nvidia",
    "content": "Investing.com -- Here are the biggest analyst moves in the area of artificial intelligence (AI) for this week.\n\nInvestingPro subscribers always get first dibs on market-moving AI analyst comments. Upgrade today!\n\nJefferies has upgraded Apple Inc (NASDAQ:AAPL) to Hold from Underperform, citing a more favorable entry point after the stock’s recent pullback.\n\nBut at the same time, the brokerage lowered its price target to $167.88 from $202.33 and cut estimates on iPhone shipments, revenue, and earnings per share (EPS) through fiscal year 2027 (FY27), reflecting mounting concerns about a potential global recession and a less robust AI outlook.\n\nJefferies reduced iPhone shipment forecasts by 3.6%, 7.7%, and 5.5% for FY25, FY26, and FY27, respectively, while revenue estimates were trimmed by up to 4.1% and EPS projections now sit below consensus by as much as 8.5%.\n\n“Our base case remains that AAPL would be exempted from U.S. tariffs, given its commitment to invest $500bn in the U.S. over the next four years, and our belief that it would make additional manufacturing investment commitment in the U.S. (to make iPhone, for example),” said analysts led by Edison Lee.\n\nStill, they caution that “a rising risk of global recession could further impact already-weak iPhone demand.”\n\nJefferies expects Apple to raise prices on upcoming models due to higher component costs, forecasting a $50 increase for the iPhone 18 (excluding the base model) and a $100 increase for all iPhone 19 variants.\n\nThe analysts also lowered long-term AI revenue assumptions, pointing to challenges that include “a lack of fast DRAM and advanced packaging solutions, which limits the AI model size” and the fact that app data access is constrained.\n\n“We believe the hardware needed to run bigger AI models on smartphones will be commercialized in 2027, and we assume AAPL will be the first smartphone OEM to adopt that (iPhone 19),” they said.\n\nBut they added that reluctance from companies like Google (NASDAQ:GOOGL) and Meta (NASDAQ:META) to share data is a more structural challenge.\n\nAs a result, AI revenue expectations starting in FY28 have been adjusted lower by reducing the install base scope and cutting the anticipated penetration rates to 20%-50%, down from previous assumptions of 50%-75%.\n\nWhile the rating has been lifted, Jefferies noted that Apple’s valuation remains stretched, highlighting its 2.2x PEG ratio for FY25.\n\nCiti has lowered its earnings and revenue forecasts for NVIDIA Corporation (NASDAQ:NVDA) and Marvell Technology this week, pointing to reduced expectations for cloud capital spending and continued macroeconomic uncertainty driven by trade tensions.",
    "url": "https://finance.yahoo.com/news/5-big-analyst-ai-moves-103010519.html",
    "timestamp": "2025-04-13T10:30:10.000Z"
  }
]