[
  {
    "title": "Nvidia, defensive consumer plays, Logitech: Trending Tickers",
    "content": "Madison Mills and Yahoo Finance Executive Editor Brian Sozzi outline what's driving interest in some of the trending tickers on Yahoo Finance's platform.\n\nCiti analysts cut their Nvidia (NVDA) price target to $150 per share, citing reduced chip sales in 2025 and 2026 due to the trade war.\n\nJefferies analysts outline their top defensive retail and consumer-facing picks, including Uber (UBER), Exxon (XOM), McDonald's (MCD), and Netflix (NFLX).\n\nLogitech (LOGI) withdraws its full-year 2026 guidance, citing tariff uncertainty.\n\nTo watch more expert insights and analysis on the latest market action, check out more Catalysts here.\n\nIt's now time for some of today's trending tickers. We're watching concerns for Nvidia GPU sales, some defensive plays and Logitech withdrawing its 2026 outlook. Let's get into it. First up, shares of Nvidia ticking higher about an hour into your trading day, up a little over 3/10 of a percent right now. City analyst cutting their Nvidia price target to $150, maintaining a buy rating. City also revising their estimates for GPU sales down by 3% for 2025 and 2026. Analysts saying the trade war could put enterprise AI projects and hyperscalar CAPEX at risk. Joining me to discuss for a moment, Brian Sozzi is still here with us. And Brian, I think what's interesting at least when I talked to my sources of the likes of Amazon, for example, they have said there has been no downturn in demand for AI, for chips. And it's interesting to hear this call coming out for, uh, Nvidia on the back of that.\n\nWhy this call sticks with me, Madison, is because it is really the first estimate cuts or downgrade I have seen on Nvidia really, at all, even since its last earnings report, because the company was heavily, heavily defended after its earnings report. So, uh, it's an immediate flag for me. Has me thinking is demand starting to slow down in video. Uh, also, keep in mind, go to the ticker page on Yahoo Finance for Nvidia, click on analysis, you can see the street remains very, very bullish. So if this is the first sign to come, you theoretically could see, uh, a leg down, another leg down in Nvidia as the street cuts estimates and potentially cuts its rating. So, uh, I give this analyst a credit. Uh, he's the first, but he may not be the last.\n\nHe certainly may not. But let's talk about some other calls this morning. Jefferies out this morning with some of their top plays for tariff uncertainty with what they say is a balance of risk and safety for the unsteady market. The note includes a range of consumer-facing names ranging from Uber to Exxon and McDonald's. And Sozzi, I know you had an interesting response to some of these calls.\n\nYeah. Yeah. I don't really agree with most of them. Uh, yeah, there we go. Uh, I don't agree that Uber is a recession-resistant play. I just don't see it. Now, they are bullish on Netflix. I get it. I don't think the economy is going to come to a point where we're cutting our Netflix subscriptions. One I do agree with, I agree with McDonald's as consumers trade down. Uh, McDonald's historically during recessions does pretty well financially, uh, and I believe stock price too, uh, as well. But again, I think this note, I appreciate what Jefferies is trying to do here. Uh, I look at Exxon. I mean, oil prices have plunged. Not sure how Exxon is going to do amazing things come earning season with oil prices off the highs. So, uh, I'm poking a couple, couple pins in this one.\n\nYeah. Price of oil per barrel right now doesn't even cover the cost of production. So an interesting call as the.\n\nThat's a stocks in translation right there. Buddy, I mean.\n\nThere you go. We'll pitch it for next week. We'll see. We'll see. All right, finally, Logitech withdrawing its fiscal year 2026 outlook due to uncertainty. That's a sentence you're going to be hearing a lot from us this quarter. Logitech reaffirming its outlook for fiscal year 2025, which did end on March 31st. The company, which produces computer accessories and software, just the latest to withdraw its forward guidance following Delta Airlines and also Walmart. Sozzi, two, we're going to keep playing.\n\nYou want to go old? I remember Madison, I remember the first camera that I had was like this circular ball from Logitech. It went on like my compact Presario. I mean, this thing was awesome. But why this bothers me from Logitech is because 40% of their production comes from one plant out in China. They have exposure to Vietnam, but I think this is the first sign of weakness in the computer, uh, not only the component parts, but also computer makers. It's an HP, uh, it's a Dell. Uh, so, uh, there's more than me. This is not just a Logitech thing. All these companies rely on China, Vietnam, Malaysia for parts. So if Logitech is warning, best believe you could see pressure on these other companies.\n\nAnd also, for our audience, you can scan the QR code here to track the best and worst performing stocks of the session with Yahoo Finances trending tickers page.",
    "url": "https://finance.yahoo.com/video/nvidia-defensive-consumer-plays-logitech-150202189.html",
    "timestamp": "2025-04-11T15:02:02.000Z"
  },
  {
    "title": "Why Wall Street's biggest bear isn't budging on his calls after Trump tariff pause",
    "content": "It's going to take more than a reciprocal tariff pause to keep Wall Street's biggest bear from roaming the markets and heading into hibernation.\n\n\"Based on my calculations, the tariff rate is still quite high — at least as high as anything we have seen since the 1930s,\" BCA Research chief strategist Peter Berezin told Yahoo Finance. \"There is no guarantee these so-called reciprocal tariffs are going to come down. The fact of the matter is that most countries don't have very large trade barriers with the US.\"\n\nBerezin added, \"The uncertainty is a problem — I think we are still headed into a recession, unfortunately.\"\n\nBerezin told Yahoo Finance recently he sees a 75% chance of a US recession this year and the S&P 500 dropping 15% to 4,450. He hasn't ruled out the US already being in a mild recession.\n\nListen: Why Jamie Dimon may be wrong on a recession\n\nBerezin gained attention for being the lone bear on Wall Street coming into 2025. Further, he correctly called in 2022 that there would be no US recession — despite most on the Street bracing for one. He has been an economist for more than 30 years, with stints at the International Monetary Fund (IMF), Goldman Sachs, and now BCA Research.\n\nThe bearish calls on markets and the economy come amid another turbulent week for stocks as some traders aimed to price in a recession while others took a more optimistic viewpoint.\n\nThe Dow Jones Industrial Average (^DJI) on Thursday tanked 1,014.79 points or 2.5%. The S&P 500 (^GSPC) and Nasdaq Composite (^IXIC) sold off to the tune of 3.46% and 4.31%, respectively. Investor favorites Nvidia (NVDA) and Tesla (TSLA) plunged 6% and 7.3%, respectively.\n\nMarkets essentially dialed back their excitement after a historic day on Wednesday.\n\nThe S&P 500 exploded 9.5% on Wednesday as President Trump announced a 90-day pause on reciprocal tariffs for most countries. He cranked up the pressure on China, however, taking tariffs up to 145%. The tech-heavy Nasdaq Composite surged 12% for its second-best day on record. The Dow Jones Industrial Average shot up 7.8%, or about 3,000 points.\n\nThe about-face on tariffs caused Goldman Sachs economists to reverse their baseline recession call ... made earlier that day.\n\nStocks were solidly in the red on Friday.\n\nDespite the elevated market volatility, some Wall Street strategists are aiming to search the rubble for buying opportunities. Most calls reviewed by Yahoo Finance focus on defensive stock tilts rather than buying recent dips on former highfliers in Apple (AAPL), Nvidia, and Tesla.",
    "url": "https://finance.yahoo.com/news/why-wall-streets-biggest-bear-isnt-budging-on-his-calls-after-trump-tariff-pause-124002190.html",
    "timestamp": "2025-04-11T12:40:02.000Z"
  },
  {
    "title": "Exclusive-Alphabet, Nvidia invest in OpenAI co-founder Sutskever's SSI, source says",
    "content": "By Kenrick Cai and Krystal Hu\n\nSAN FRANCISCO (Reuters) - Alphabet and Nvidia have joined prominent venture capital investors to back Safe Superintelligence (SSI), a startup co-founded by OpenAI's former chief scientist Ilya Sutskever that has quickly risen to become one of the most valuable artificial intelligence startups months after its launch, a source familiar with the matter said.\n\nThe funding illustrates renewed interest from the big tech and infrastructure providers in making strategic investments in the startups developing cutting-edge AI that requires massive amounts of computing power. Alphabet, which has its own AI models, earlier in the week announced a deal by its cloud computing arm to sell SSI access to tensor processing units (TPUs), its in-house AI chips.\n\nSSI, which sources say was recently valued at $32 billion in a round led by Greenoaks, is one of the highest-profile startups working on AI model research, thanks to Sutskever's stellar track record in predicting the next big thing in AI development.\n\nLike many of its competitors, it has a huge demand for chips.\n\nReuters could not determine the exact terms of Alphabet's and Nvidia's investment in SSI. Spokespeople for all three companies declined to comment.\n\nThe twin moves by Alphabet's corporate and cloud division with high-profile AI labs including SSI and Anthropic show the tech giant's evolving AI hardware strategy.\n\nGoogle originally reserved TPUs for in-house use. The deal to sell SSI chips in significant quantities to support its frontier AI research exemplifies the company's ongoing strategy to expand sales to external customers, Darren Mowry, a managing director in charge of Google's partnerships with startups, said in an interview with Reuters this week.\n\n\"With these foundational model builders, the gravity is increasing dramatically over to us,\" he said.\n\nAI developers have historically preferred Nvidia's graphics processing units, which hold more than 80% of the AI chips market.\n\nBut SSI is so far primarily using TPUs rather than GPUs for its AI research and development, two sources said.\n\nGoogle offers both Nvidia GPUs and its own TPUs through its cloud service. Its own chips are intended to excel at specific AI tasks and are more efficient than general-purpose GPUs. These chips have been used to build large-scale AI models, such as Apple and Anthropic, an OpenAI competitor that has received billions of dollars of funding from Google and Amazon.\n\nGoogle and Nvidia also face a challenger in Amazon, which is building its own competing processors called Trainium and Inferentia. Amazon has said as far back as 2023 that Anthropic would develop its technology on those chips. The tech giant announced in December that Anthropic would be the first customer to use a massive supercomputer powered by hundreds of thousands of its own chips.",
    "url": "https://finance.yahoo.com/news/exclusive-alphabet-nvidia-invest-openai-012945259.html",
    "timestamp": "2025-04-12T01:29:45.000Z"
  },
  {
    "title": "FuriosaAI Turns Down Meta's $800M Bid To Go Rogue With RNGD, As AI Chip War Between Nvidia, Google, And Meta Heats Up",
    "content": "South Korean AI hardware startup FuriosaAI has made waves in the global semiconductor industry after reportedly turning down an $800 million acquisition offer from Meta (NASDAQ:META).\n\nThe decision shows the startup's ambition to remain independent and compete directly in the rapidly evolving AI chip market dominated by NVIDIA (NASDAQ:NVDA) and increasingly encroached on by tech giants like Alphabet (NASDAQ:GOOGL, GOOG)) and Microsoft (NASDAQ:MSFT).\n\nDon't Miss:\n\nHasbro, MGM, and Skechers trust this AI marketing firm — invest pre-IPO from $0.55 per share now.\n\nMaker of the $60,000 foldable home has 3 factory buildings, 600+ houses built, and big plans to solve housing — this is your last chance to become an investor for $0.80 per share.\n\nMeta initially called FuriosaAI after months of evaluating potential acquisition targets earlier this year. While Meta’s offer was around $300 million more than FuriosaAI's estimated market value, negotiations collapsed over differences of opinion about the company's future direction and post-acquisition structure, according to a report by Maeil Business Newspaper.\n\n“Since October of last year, Meta had been looking at several AI semiconductor companies in the U.S. and Israel, and finally made FuriosaAI a viable acquisition target and negotiated it since the beginning of the year,\" an insider reportedly told Maeil Business Newspaper.\n\nFuriosaAI, founded in 2017 by CEO June Paik, specializes in designing AI inference chips for high-performance applications as a power-efficient alternative to power-hungry GPUs. The company has about 140 employees, with more than 90% of them working in the development department. The team also includes veterans from Qualcomm (NASDAQ:QCOM), Samsung, and Google.\n\nTrending: Deloitte's fastest-growing software company partners with Amazon, Walmart & Target – Many are rushing to grab 4,000 of its pre-IPO shares for just $0.26/share!\n\nThe startup's main product, RNGD (pronounced “Renegade”), is already getting serious hardware buzz. Launched at Hot Chips 2024, the RNGD chip is built on TSMC’s 5nm process and features dual HBM3 memory, achieving roughly twice the efficiency of traditional GPUs at just one-fourth of the power. In a world where energy-hungry AI models are growing fast, that's a pitch with global reach.\n\nFuriosaAI has already found some notable partners, and production of RNGD is anticipated to start in the latter part of this year. According to Maeil Business Newspaper, LG AI Research and Saudi Aramco are two of the companies that have signed up to test RNGD's capabilities.",
    "url": "https://finance.yahoo.com/news/furiosaai-turns-down-metas-800m-230222314.html",
    "timestamp": "2025-04-11T23:02:22.000Z"
  },
  {
    "title": "China's $8.2 Billion AI Fund Aims to Undercut U.S. Chip Giants",
    "content": "China has unveiled an $8.2 billion artificial intelligence funding initiative aimed at strengthening its domestic AI ecosystem and reducing reliance on U.S. semiconductor firms like Nvidia (NASDAQ:NVDA) and Broadcom (NASDAQ:AVGO).\n\nWarning! GuruFocus has detected 3 Warning Signs with NVDA.\n\nThe new state-backed AI Industry Investment Fund will prioritize early-stage projects while also targeting core parts of the AI supply chain, including computing infrastructure, algorithms, data resources, and applications. Robotics will also be a major area of focus.\n\nA large portion of the funding is being drawn from the third phase of the China Integrated Circuit Industry Investment Fund, widely known as the Big Fund. This fund was created to accelerate China's push toward chip self-sufficiency amid escalating trade friction and export controls on advanced Western technologies.\n\nThe move underscores Beijing's strategic approach to AI development, in contrast to the market-driven models seen in the U.S. According to TechInAsia, China surpassed the U.S. in global AI startup funding back in 2017 and is pursuing its goal of building a $150 billion AI industry by 2030, with projections that it could generate nearly half of the global AI-related economic value by then.\n\nThe rise of firms like DeepSeek and China's growing AI independence have served as a warning to U.S. tech leaders. Nvidia, Broadcom, and Microsoft (NASDAQ:MSFT) are all watching closely as China ramps up its state-backed ambitions.\n\nThis article first appeared on GuruFocus.",
    "url": "https://finance.yahoo.com/news/chinas-8-2-billion-ai-214752877.html",
    "timestamp": "2025-04-11T21:47:52.000Z"
  },
  {
    "title": "Michael Saylor has a biblical take on MicroStrategy’s terrific return",
    "content": "Bitcoin evangelist Michael Saylor has a biblical take on the latest return figures of his business intelligence firm, Strategy (Nasdaq: MSTR), formerly MicroStrategy.\n\nOn Apr. 11, Saylor wrote on X (formerly Twitter), “In the beginning was the Bitcoin. Then came the @Strategy.”\n\nSaylor posted an image along with comparing the 1-year return offered by the Strategy stock to that offered by other giants such as Tesla (Nasdaq: TSLA), SPDR Gold Shares (NYSEArca: GLD), Nvidia (Nasdaq: NVDA), and even Bitcoin — the king coin — itself.\n\nWhile MSTR offered a 1-year return of 92% as of Apr. 11, Elon Musk’s Tesla stood far behind with a 44% annual return.\n\nSPDR Gold Shares, one of the largest gold holders in the world, offered a 1-year return of 36%. Note that gold hit its record high of $3,237 an ounce on Apr. 11.\n\nNvidia, the leading chip manufacturer, generated a 1-year return of 36%.\n\nBitcoin, the world's largest corporate holder of which is Strategy, itself could only offer a 1-year return of 20%.\n\nExcept for Tesla, Nvidia, and Apple, other Magnificent Seven stocks performed rather poorly in terms of annual returns.\n\nWhile Meta with 4% annual return lied in the green zone, Alphabet, Amazon, and Microsoft lied in the red zone as they offered negative annual returns.\n\nThe stock market is still reeling under the drastic impact of President Donald Trump’s tariff war.\n\nThe resilience of Strategy amid such trying times had the Strategy founder founding the Genesis myth for the Bitcoin community.\n\nStrategy holds more than 500,000 Bitcoin worth $44 billion as of now.\n\nAs far as Bitcoin is concerned, it was trading at $83,871.28 at press time as per Kraken’s price feed.",
    "url": "https://finance.yahoo.com/news/michael-saylor-biblical-microstrategy-terrific-205834049.html",
    "timestamp": "2025-04-11T20:58:34.000Z"
  },
  {
    "title": "Which AI Stock, NVIDIA or Broadcom, Is the Better Bargain to Buy?",
    "content": "Advancements in artificial intelligence (AI) have made NVIDIA Corporation NVDA a Wall Street darling for some time. On the other hand, Broadcom Inc.’s AVGO recent share repurchase plan, along with its planned moves to capitalize on the growing AI field, has delighted income-oriented investors.\n\nHowever, the latest trade war between the United States and several other countries has caused market turmoil, with shares of NVIDIA and Broadcom declining 19.9% and 25.7% year to date. This presents an opportunity to buy these quality stocks at a discounted price for long-term gains. But which stock is the better bargain? Let’s explore –\n\nImage Source: Zacks Investment Research\n\nNVIDIA leads the growing graphics processing unit (GPU) market with over 80% share, giving the Jensen Huang-led company a competitive edge over its peers. More than Advanced Micro Devices, Inc.’s AMD ROCm software platform, NVIDIA’s CUDA software platform is in demand among developers.\n\nAt the same time, there is an insane demand for NVIDIA’s new Blackwell chips among notable tech firms due to their energy efficiency and faster AI interfaces. The older Hopper chips also maintain steady demand due to their higher quality compared to rival Intel Corporation’s INTC chips (read more: Can Intel Be the Turnaround Stock of 2025? Is the Time to Buy Now?).\n\nNVIDIA, meanwhile, is well-poised to make the most of the increase in AI data center spending. Top cloud computing stocks are fulfilling the increase in demand for AI workloads by acquiring GPUs and are spending $250 billion on AI data center infrastructure. One of NVIDIA’s prominent customers, Microsoft Corporation MSFT, may have reduced data center spending, but Alphabet Inc. GOOGL and Amazon.com, Inc. AMZN are now supporting NVIDIA in this aspect.\n\nBroadcom expects the demand for its custom AI accelerator to increase in the near future and the market size for its execution processing units (XPUs) to touch $60-90 billion by fiscal 2027, way higher than last year’s $12.2 billion.\n\nBroadcom’s XPUs can work on a particular workload and even outdo NVIDIA’s GPUs. Moreover, they have the competence to perform tasks more affordably than GPUs. Thus, banking on the rise in demand for accelerator chips, Broadcom is now developing a 2-nanometer AI XPU, which is unique. The company’s application-specific integrated chips (ASICs), known to support AI and machine learning, are witnessing strong demand as well.\n\nNo doubt, with GPUs and XPUs gaining popularity in the coming years, and AI infrastructure spending increasing, the future does look bright for both NVIDIA and Broadcom. However, from a long-term perspective, NVIDIA is a better choice than Broadcom.",
    "url": "https://finance.yahoo.com/news/ai-stock-nvidia-broadcom-better-190000358.html",
    "timestamp": "2025-04-11T19:00:00.000Z"
  },
  {
    "title": "Is NVIDIA Corporation (NVDA) the Top Stock in Ken Griffin’s Portfolio to Buy According to Analysts?",
    "content": "We recently published a list of Top 10 Stocks in Ken Griffin’s Portfolio to Buy According to Analysts. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against other top stocks in Ken Griffin’s portfolio to buy according to analysts.\n\nKen Griffin is one billionaire investor wary of the negative impact of US President Donald Trump’s combative approach to trade policy. Aggressive trade tariffs in the push to try and settle trade imbalances between the US and other nations have sent shockwaves in the equity markets. Likewise, Griffin believes the damage has already been done, given that the broader equity market has already pulled back significantly since Trump assumed office on January 20, 2025.\n\n“From my vantage point, the bombastic rhetoric, the damage has already been done,” Griffin said Tuesday at the UBS Financial Services Conference in Key Biscayne, Florida. “It’s a huge mistake to resort to this form of rhetoric when you’re trying to drive a bargain because … it tears into the minds of CEOs, policymakers that we can’t depend upon America, as our trading partner.”\n\nThe billionaire hedge fund manager’s remarks followed Trump’s signing of an order imposing 25% import duties on steel and aluminum. According to Ken Griffin, Trump’s trade policies have the potential to affect long-term investments for multinational companies. Companies are increasingly slowing down their investments, especially abroad, worried about the long-term impact of trade tariffs.\n\nREAD ALSO: Top 10 Growth Stocks in David Tepper’s Portfolio and Billionaire Ken Fisher’s Top 13 Growth Stock Picks.\n\n“It makes it difficult for multinationals, in particular, to think about how to plan for the next five, 10, 15, 20 years, particularly when it comes to long lead time capital investments that could be adversely impacted by a degradation of the current terms of engagement as amongst the leading Western countries when it comes to terms and trade,” he said.\n\nThe remarks come on the Fed opting to go slow on interest rate cuts for the second straight meeting after conducting three consecutive rate reductions beginning September 2024. The central bank opted to maintain the benchmark rate at 4.5%, wary of inflation ticking higher amid the ongoing trade war between the US and other countries.\n\nAccording to the US central bank, GDP growth will slow in 2025, and core inflation will be higher. This partially reflects the anticipated effects of the retaliatory actions and newly imposed U.S. tariffs. The US central bank is going slow on interest rate cuts, and the warning of a potential economic growth slowdown has rattled the equity markets.",
    "url": "https://finance.yahoo.com/news/nvidia-corporation-nvda-top-stock-180631214.html",
    "timestamp": "2025-04-11T18:06:31.000Z"
  },
  {
    "title": "Trade War, Capex Pressures Push Citi to Lower Nvidia, Marvell Outlooks",
    "content": "Citi adjusted its outlook on Nvidia (NASDAQ:NVDA) and Marvell Technology (NASDAQ:MRVL) on Friday, citing rising concerns over tariffs and a cautious capital spending environment among large tech clients.\n\nWarning! GuruFocus has detected 3 Warning Signs with NVDA.\n\nFor Nvidia, analyst Atif Malik reduced projected GPU unit shipments for calendar years 2025 and 2026 by 3% and 5%, respectively. The revision reflects updated expectations for hyperscaler capital expenditures, which now forecast spending growth of 35% in 2025 and 15% in 2026 both lower due to reduced confidence in Microsoft's (NASDAQ:MSFT) spending and broader economic uncertainty linked to the ongoing trade war.\n\nWhile Nvidia may be able to offset some of the added GPU costs through price increases, the firm expects profit margins to be affected. Malik lowered Nvidia's earnings projections by 3% for 2025 and 6% for 2026 and revised his price target to $150, while retaining a Buy rating.\n\nFor Marvell, Citi trimmed fiscal 2027 revenue and earnings forecasts by 5% and 8%, respectively. The cuts stem from lowered expectations for hyperscaler demand and revised assumptions around chip-on-a-wafer-substrate technology.\n\nMalik also cut projected AI ASIC volumes for 2026 by 20%, citing the possibility that Amazon's Trainium line may not rely solely on Marvell as a supplier going forward. Despite these revisions, Citi reiterated a Buy rating on Marvell.\n\nThis article first appeared on GuruFocus.",
    "url": "https://finance.yahoo.com/news/trade-war-capex-pressures-push-174958025.html",
    "timestamp": "2025-04-11T17:49:58.000Z"
  },
  {
    "title": "Magnificent Seven Stocks: Apple, Nvidia Rally; Meta, Tesla Sell Off",
    "content": "The Magnificent Seven stocks rose Friday, as Apple and Nvidia rallied. Meta and Tesla sold off on the stock market today.",
    "url": "https://finance.yahoo.com/m/4205eaa9-f620-3a0b-a81a-0e82c7c9fd0b/magnificent-seven-stocks-.html",
    "timestamp": "2025-04-11T17:32:42.000Z"
  }
]