[
  {
    "title": "Nvidia is still a buy, 'far ahead' of competitors: Analyst",
    "content": "While global trade officials ponder tariffs on imported semiconductors, Nvidia (NVDA) finds itself in the line of fire of any possible trade pressures. KeyBanc Capital Markets equity research analyst John Vinh comes on Yahoo Finance's Market Domination to share his perspective on Nvidia's biggest competitors and whether investors should view the chip stock as a buy.\n\nNvidia is scheduled to report first quarter earnings on Wednesday, May 28.\n\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination here.\n\nThe Trump administration spurring fears of tightening chip trade rules as well, the potential changes adding to those other mounting risks for Nvidia. The chipmaker's also facing pressure tied to custom customer Supermicro computer. Is its last, its revenue profit outlook for the third quarter. Here to decode what's ahead for semiconductors including Nvidia, we've got KeyBanc Capital Markets equity research analyst, John Vinh. John, it is always great to catch up with you, and I want to get your take first on this view of Nvidia here that we're going to continue to see this migration to more customized chips, or contract made chips from the likes of Broadcom. And it does seem like some of the sentiment is piling up against Nvidia here.\n\nYeah. I think that view is a little bit more premature at this point in time. We think we are still in the very early stages of generative AI, you know, the view that it's a zero-sum game between whether someone's going to go with a custom AI chip, or with a merchant GPU from Nvidia. I, I don't think we're quite there yet. If, if the market starts to mature and we're in the latter innings, then you got to be more mindful about what that split looks like. But at this point, um, you know, it's very early stages and Nvidia is so far ahead of the competition, you know, Broadcom does have a flagship customer in Google's TPU, which is a very competitive chip. But outside of the Google TPU, there are limited proof points out there of another customer having a competitive chip to what Nvidia offers, or what, what Google makes with, with Broadcom.\n\nJohn, there was another headline that certainly got attention. I want your take on this one. Reuters reported, and this was late yesterday, that Trump officials are working to change a Biden era AI trade rule capping access to US AI chips, potentially making it stricter. I'm wondering, John, listen, you're an Nvidia investor, you read that. What should you make of a headline like that?\n\nYeah. I think there's certainly a lot of angst around the diffusion rule, right? You know, it's supposed to go into effect in mid-May, I want to say May 17th, May 18th, right? And you know, I think there's, there is, some rightfully consternation around it because what it is, in effect trying to limit, is the ability, or of the US's competitors, or rivals, to get access to Nvidia's GPUs, right? You know, obviously we've got a straight direct ban on China, but we also know that there is a gray market in which our competitors, including Chinese constituents, are able to get access to Nvidia GPUs through other gray market channels by importing them through, through other countries. So, yeah, I think there is some, some angst and consternation in terms of how it kind of plays out is unclear, right? I mean, I'm seeing the same headlines as you that they're reconsidering it, but we'll have to see how it plays out. But it certainly is a concern, and a little bit of a near-term overhang on Nvidia's stock at this point.\n\nSo John, bottom line, is Nvidia still a buy, or even more of a buy at these levels after the declines it's seen?\n\nI certainly believe so. The, the valuation is not fully pricing anything in. I think if you look at our numbers, it's trading at less than 20 times earnings, historically. I mean, Nvidia has traded, you know, 35, 45 times, 35 to 40 times. And it's trading at a pretty significant discount. You've got the China chip ban. So we've taken, you know, 12 billion dollars out of our numbers this year, so you could argue that a lot of that is de-risked. Um, so at these levels, it's not pricing in a whole lot and we still believe that they are significantly ahead of their competitors at this point. With this new platform that they're rolling out, GB 200, NVL 72. They have certainly put a lot of room between themselves and their nearest competitors.",
    "url": "https://finance.yahoo.com/video/nvidia-still-buy-far-ahead-221000824.html",
    "timestamp": "2025-04-30T22:10:00.000Z"
  },
  {
    "title": "Why Big Tech may be set for a surprise rebound through MAGMAN",
    "content": "Large-cap tech stocks have quietly become one of the most undervalued areas in the market, despite strong earnings revisions and rising buybacks.\n\nRaymond James CIO Larry Adam breaks down why “MAGMAN” — the Magnificent Seven's Microsoft (MSFT), Apple (AAPL), Alphabet (GOOG, GOOGL), Meta Platforms (META), Amazon (AMZN), and Nvidia (NVDA), excluding Tesla (TSLA) — could offer investors contrarian opportunities.\n\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination here.\n\nMag Man.\n\nYes. That's your your version of your flavor of Mag 7. Um, what does that mean and why should people maybe be looking at that area right now?\n\nSo Mag Man is the largest uh mega cap tech stocks minus Tesla because we think that's more of a car company. But that is one of my favorite areas in the market. Number one, I think there's a big disconnect out there when it comes to what's happening in their performance. If you look at Mag Man, they're down about 13% year to date. Their earnings revisions have actually gone higher so far this year by about 0.2%. The rest of the market's down 3%. Their earnings have been revised down 4%. So big difference there. And then when I look at valuations, believe it or not, those large cap tech stocks are the cheapest valuations versus the S&P since 2017. That's a long time. I think that's an opportunity. And when I look at what they're doing with their cash hoard, they're increasing their buybacks. That's up 27%. I think that I know you had the previous uh speaker on. I think that when you look at the spending, the CAPEX, I still think it's going to be relatively strong. Between those four hyperscalers he's talking about, you're talking about over $300 billion this year. I think that's pretty robust spending. So I think that's going to continue. And the last thing I'd say is that as opposed to where it was a year ago where everybody loved Big Cap Tech, now it's got the largest underweight in institutional portfolios since 2022. So from a contrarian perspective, I think you could see those those stocks do well over the coming, you know, quarters.",
    "url": "https://finance.yahoo.com/video/why-big-tech-may-set-124521031.html",
    "timestamp": "2025-04-30T12:45:21.000Z"
  },
  {
    "title": "As Trump Completes 100 Days As President, Elon Musk, Jeff Bezos, Mark Zuckerberg And Other Billionaire Backers See $195 Billion Wealth Wipeout Amid Market Turmoil",
    "content": "Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\n\nAs President Donald Trump marks 100 days in office, four tech giants who backed his second term have seen their fortunes and their companies’ stock values take a hit.\n\nWhat Happened: Tesla (NASDAQ:TSLA) CEO Elon Musk, Amazon (NASDAQ:AMZN) Founder Jeff Bezos, Meta (NASDAQ:META) CEO Mark Zuckerberg, and Nvidia CEO (NASDAQ:NVDA) Jensen Huang who have donated or attended Trump’s inauguration have collectively lost nearly $195 billion since Jan. 20, as per Bloomberg Billionaire Index.\n\nTrending: Maker of the $60,000 foldable home has 3 factory buildings, 600+ houses built, and big plans to solve housing — you can become an investor for $0.80 per share today.\n\nMusk, serves as an advisor to the Trump administration, has experienced the most significant wealth decline of $114 billion, despite remaining the world’s richest person. After protests targeting Tesla Inc. Musk announced last week that he will scale back his involvement with the White House DOGE office in May. Tesla shares have fallen nearly 25% this year after underwhelming quarterly earnings.\n\nBezos's fortune—mostly linked to his Amazon Inc shares—has dropped $36 billion since January 20. Analysts say Amazon is especially exposed to Trump's trade war and the 145% tariff on China due to the high volume of Chinese goods sold on its platform.\n\nZuckerberg's fortune, tied to Meta Platforms, is under pressure as the company faces a government antitrust lawsuit. At the same time, Huang's wealth—largely based on Nvidia Corporation stock—has taken a hit since his appearance at the inauguration. Nvidia shares are down over 21% year to date, and the company expects a $5.5 billion blow to first-quarter earnings due to Trump's restrictions on chip exports to China.\n\nThe news was first reported by Business Insider.\n\nSee Also: Maximize saving for your retirement and cut down on taxes: Schedule your free call with a financial advisor to start your financial journey – no cost, no obligation.\n\nWhy It Matters: Trump’s reciprocal tariffs have threatened to undermine billion-dollar AI infrastructure projects being spearheaded by leading tech companies. These tariffs have been described as ‘Armageddon’ for the sector, with tech leaders who backed Trump losing a combined $1.8 trillion due to tariffs by April 18.\n\nFurthermore, the European Commission president Ursula von der Leyen warned that big U.S. tech firms could end up paying up if Trump tariff talks collapse, EU threatened additional taxes on American tech giants amid ongoing trade war.",
    "url": "https://finance.yahoo.com/news/trump-completes-100-days-president-025618011.html",
    "timestamp": "2025-05-01T02:56:18.000Z"
  },
  {
    "title": "NVIDIA Corporation (NVDA): Is the AI Hype Overpriced? Seaport Initiates With a Rare ‘Sell’ Call",
    "content": "We recently published a list of 12 AI Stocks Making Waves Today. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against other AI stocks making waves today.\n\nChina’s foreign ministry recently released a video on its social media feeds, complete with a voice-over in American-accented English, comparing the acceptance of U.S. President Donald Trump’s 145% tariffs to “drinking poison”.\n\n“China won’t kneel down, because we know standing up for ourselves keeps the possibility of cooperation alive, while compromise snuffs it out… Imperialists are always arrogant. If they show a bit of reason it’s only because they are forced to do so”\n\nA Chinese official revealed that Beijing believes yielding or compromising now would only weaken China in the future and that it would authorize Trump to change the terms later. These ongoing tariff riots aren’t superficial, rather, they are a reflection of deeper tensions in the ongoing US-China rivalry, particularly over dominance in emerging technologies such as artificial intelligence.\n\nREAD ALSO: 12 AI Stocks Analysts Are Talking About Right Now and 10 AI Stocks in the Spotlight This Week.\n\nIn the initial days of the tariff frenzy, former Canadian Deputy Prime Minister Chrystia Freeland had called on President Donald Trump to take the threat of tariffs off the table. She argued that the U.S. will need Canadian energy in the race to achieve dominance in artificial intelligence.\n\nFreeland has deemed the tariffs as “the dumbest trade war in history,” stating how the U.S.-Canada trade relationship is largely balanced when oil, gas, and electricity are excluded. She said that the tariff threat needs to be taken “definitively off the table.”\n\n“You are really lucky that Canada is the country that sells you oil and gas and electricity. We are a much more reliable supplier than, say, Venezuela. And the fact is, particularly with AI, America’s needs for energy are only going to increase.”\n\nCanada aside, the artificial intelligence boom is being slowed due to the overall global trade war triggered by the Trump administration. Upcoming earnings reports from tech giants and utilities powering the massive data centers will reveal whether tit-for-tat tariffs, particularly between the U.S. and China, are making businesses change their plans for building data centers and other infrastructure.\n\nChina plays an important role in the production of AI hardware. It was excluded from a 90-day tariff reprieve earlier. According to analysts, the 145% U.S. tariffs on Chinese goods will sharply increase data center costs if an exemption on electronics is rolled back.",
    "url": "https://finance.yahoo.com/news/nvidia-corporation-nvda-ai-hype-002208574.html",
    "timestamp": "2025-05-01T00:22:08.000Z"
  },
  {
    "title": "Closing Bell Movers: Snap falls 14% after Q1 results, no guidance",
    "content": "In the opening 90 minutes of the evening session, U.S. equity futures are softer – Dow Industrials are flat, but S&P 500 is off by 0.2% and Nasdaq 100 is down 0.4%. In energy, WTI crude oil is extending Tuesday’s decline toward the $60 per barrel level after the largest build in API crude stocks data in four weeks. In metals, Gold is slightly lower below $3,330 per ounce.\n\nDiscover companies with rock-solid fundamentals in TipRanks' Smart Value Newsletter.\n\nReceive undervalued stocks, resilient to market uncertainty, delivered straight to your inbox.\n\nA busy afterhours earnings session saw a mixed picture in the Semiconductors and Tech space. Seagate jumped 9% on earnings beat and much better than expected Q2 outlook, pulling up Western Digital. Super Micro, on the other hand, cut its guidance, falling over 15% and dragging down Nvidia (NVDA). Digital advertising space was also weak after disappointing numbers from Snap, along with its management’s decision to defer guidance. Finally, the Consumer Cyclical sector was highlighted by weaker than expected Q2 results and another comps decline from Starbucks.\n\nCheck out this evening’s top movers from around Wall Street, compiled by The Fly.\n\nHIGHER AFTER EARNINGS –\n\nOddity Tech (ODD) up 24.1%\n\nSeagate (STX) up 9.1%; Western Digital (WDC) up 3.2% in sympathy\n\nQorvo (QRVO) up 9.0%\n\nFlowserve (FLS) up 5.7%\n\nQuad/Graphics (QUAD) up 3.1%\n\nMondelez (MDLZ) up 1.8%\n\nVisa (V) up 0.6%\n\nDOWN AFTER EARNINGS –\n\nTenable (TENB) down 15.1%\n\nSnap (SNAP) down 13.8%; Meta Platforms (META) down 1.0%, Reddit (RDDT) down 3.4% , Pinterest (PINS) down 3.0% in sympathy\n\nFirst Solar (FSLR) down 10.4%\n\nLendingClub (LC) down 8.5%\n\nStarbucks (SBUX) down 6.2%\n\nWerner Enterprises (WERN) down 5.0%\n\nBooking Holdings (BKNG) down 3.3%\n\nALSO LOWER –\n\nSuper Micro Computer (SMCI) down 15.3% after cutting Q4 guidance; NVIDIA (NVDA) down 1.9% in sympathy\n\nPublished first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>>\n\nSee Insiders’ Hot Stocks on TipRanks >>\n\nRead More on ODD:\n\nDisclaimer & DisclosureReport an Issue\n\nODDITY Tech Reports Record Q1 2025 Results and Raises Outlook\n\nOddity raises FY25 adjusted EPS view to $1.99-$2.04 from $1.94-$1.98\n\nOddity reports Q1 adjusted EPS 69c, consensus 63c\n\nOddity price target lowered to $50 from $56 at JPMorgan\n\nOddity price target lowered to $50 from $52 at KeyBanc",
    "url": "https://finance.yahoo.com/news/closing-bell-movers-snap-falls-234039126.html",
    "timestamp": "2025-04-30T23:40:39.000Z"
  },
  {
    "title": "NVIDIA CEO Jensen Huang discusses U.S. chip investment at White House event",
    "content": "Investing.com -- NVIDIA (NASDAQ:NVDA) CEO Jensen Huang discussed the company’s recently announced $500 billion agreement to manufacture the most advanced AI chips in the United States with President Donald Trump at a White House event on Wednesday. This marks the first time such technology will be produced entirely domestically. NVIDIA, known for reinventing computing, aims to leverage artificial intelligence and robotics to create state-of-the-art manufacturing facilities in the U.S.\n\nHuang highlighted the significance of this technological leap, noting that the computer architecture has remained largely unchanged since the 1960s. He emphasized that the new NVIDIA processors, weighing 70 pounds and consisting of 60,000 parts, represent the next generation of computing. The complexity of these chips is such that their manufacturing and testing require advanced robotics and even a supercomputer, respectively.\n\nThe NVIDIA CEO credited President Trump’s leadership and policies for accelerating the pace of manufacturing in the U.S., stating that modern manufacturing is driven by technology rather than low-cost labor. Huang expressed gratitude for the administration’s support, which includes an industry-oriented energy policy essential for the growth of new industries like artificial intelligence.\n\nHuang conveyed that the support from the Trump administration is crucial for fostering the new AI industry, which he believes will revolutionize various sectors such as healthcare, financial services, and education. He stressed the importance of having the fundamental infrastructure for AI in the United States to enable innovation across these industries.\n\nThe partnership with the U.S. government signifies a major step for NVIDIA and the technology sector, with the potential to transform the landscape of artificial intelligence and manufacturing. The White House event served as a platform to underscore the collaborative effort between the administration and NVIDIA in shaping the future of AI and industry in America.\n\nRelated articles\n\nNVIDIA CEO Jensen Huang discusses U.S. chip investment at White House event\n\nOlo mulls potential sale amid takeover interest - Bloomberg\n\nNVIDIA stock gains as Meta boosts AI capex... again",
    "url": "https://finance.yahoo.com/news/nvidia-ceo-jensen-huang-discusses-225259390.html",
    "timestamp": "2025-04-30T22:52:59.000Z"
  },
  {
    "title": "Nvidia CEO Says All Companies Will Need ‘AI Factories,’ Touts Creation of American Jobs",
    "content": "Jensen Huang said data-center proliferation is essential for skilled jobs as his company pursues U.S. manufacturing plans.",
    "url": "https://finance.yahoo.com/m/122c2f3e-43d4-35cc-b998-fce8868f043e/nvidia-ceo-says-all-companies.html",
    "timestamp": "2025-04-30T22:44:00.000Z"
  },
  {
    "title": "Advanced Micro Devices, Inc. (AMD) Started With a Buy Rating by Investment Bank",
    "content": "Investment bank Seaport Global recently started coverage of chip maker Advanced Micro Devices, Inc. (AMD) with a $110 price target and a Buy rating. Seaport is upbeat about AMD's ability to gain market share and its execution.\n\nSurpassing Intel (INTC) and a Viable Challenger to Nvidia (NVDA)\n\nAdvanced Micro Devices, Inc. (AMD) recently overtook Intel in the data center space, due to its strong execution, according to Seaport.\n\nWhat's more, Advanced Micro Devices, Inc. (AMD) can challenge NVDA in the AI chip sector, the firm stated.\n\nAMD's AI chips are competitive with those of NVDA, but AMD hasn't built related software and services offerings that are comparable to those of NVDA. Still, AMD is working on developing these systems, according to Seaport.\n\nAssessing AMD's Outlook in AI\n\nAMD's AI business is likely to grow slowly and steadily, Seaport believes.\n\nThe chip maker should focus on adhering to its plans on the AI front, rather than seeking to boost the revenue generated by its AI offerings in the shorter term, the investment bank believes.\n\nThe Recent Price Action of AMD Stock\n\nIn the last month, the stock has dropped 7.4%, while it's down 19% in the last three months.\n\nWhile we acknowledge the potential of Advanced Micro Devices, Inc. (AMD), our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than AMD but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\n\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires\n\nDisclosure: None. This article is originally published at Insider Monkey",
    "url": "https://finance.yahoo.com/news/advanced-micro-devices-inc-amd-214525987.html",
    "timestamp": "2025-04-30T21:45:25.000Z"
  },
  {
    "title": "Nvidia (NVDA) Will “Walk Away” From China, Strategist Says",
    "content": "Nvidia's (NVDA) business in China has been largely eliminated by America's export restrictions, Morningstar Equity Strategist Brian Colello told Yahoo Finance recently.\n\nAs a result, the giant chip maker is likely to completely abandon the world's second-largest economy, he stated.\n\nThe Last Straw\n\nWashington 's decision to prevent Nvidia (NVDA) from selling its H20 chip in China \"was probably the final straw\" for NVDA's ability to market \"halfway decent chips\" in the country, Colello said.\n\nAs a consequence, he believes that China-based Huawei can now sell higher-quality chips than NVDA in China or will soon be able to do so.\n\nThe Silver Lining for NVDA\n\nThe percentage of revenue that Nvidia (NVDA) obtains from China has already dropped, Colello said. Moreover, the company can still grow significantly even though it will only focus on the U.S. and Europe going forward, he said.\n\nThe Recent Price Action of NVDA Stock\n\nIn the last month, the shares have lost 3.5%, while they have retreated 14% in the last three months.\n\nWhile we acknowledge the potential of NVDA, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than NVDA but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\n\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires\n\nDisclosure: None. This article is originally published at Insider Monkey",
    "url": "https://finance.yahoo.com/news/nvidia-nvda-walk-away-china-212958761.html",
    "timestamp": "2025-04-30T21:29:58.000Z"
  },
  {
    "title": "Supermicro Warning Takes Down AI Data Center Stocks",
    "content": "A negative preannouncement from Supermicro pulled down stocks tied to the buildout of AI data centers on Wednesday. SMCI stock and others fell.",
    "url": "https://finance.yahoo.com/m/b9ed67a6-4831-3cbf-a6a5-f9c09cd2b5c7/supermicro-warning-takes-down.html",
    "timestamp": "2025-04-30T21:05:13.000Z"
  }
]