[
  {
    "title": "The Dow gets hit with a sledgehammer — how worried should you be?",
    "content": [
      "This is The Takeaway from today's Morning Brief, which you can sign up to receive in your inbox every morning along with:",
      "The chart of the day",
      "What we're watching",
      "What we're reading",
      "Economic data releases and earnings",
      "On big down days for the stock market or prolonged stretches of sell-offs, it's good to have a trusted playbook.",
      "Think of it as a guide to keeping your sanity amidst the chaos and, hopefully, your portfolio flush with long-term gains.",
      "For me, the sell-off playbook is a twofold exercise honed over years of reporting on business news.",
      "First, chat up the smartest people I know in markets and business. What are they doing and saying, and why? Do they sound or look fearful?",
      "And two, think deeply on whether something truly has changed in the market or if investors are in a tizzy over splashy headlines.",
      "Suffice it to say, I had to dust off this sell-off playbook this week. The end assessment: Relax, folks, this isn't the start of a bear market even though the tape feels punishing.",
      "Why, you ask?",
      "A lot of the smartest people in the room, so to speak, have valid reasons to stay long on stocks AND the economy isn't falling off a cliff AND we are likely to still get rate cuts in 2025 AND we have a pro-business president in Trump taking office in less than a month.",
      "\"Big picture, with record earnings, record profit margins, strong productivity, and overall improving consumer and small business sentiment, it is hard to think that this bull market is over,\" Carson Group chief market strategist Ryan Detrick told me.",
      "Says Truist co-chief investment officer Keith Lerner, \"The bull market is still intact, but we are seeing a short-term gut check.\"",
      "A gut check, indeed.",
      "The Dow Jones Industrial Average promptly finished Wednesday's session down more than 1,100 points. It rallied slightly on Thursday, but the selling pressure renewed on Friday.",
      "The index of 30 well-known stocks such as Salesforce (CRM) and Disney (DIS) is off by almost 4% in December as losing stretches have begun to pile on one another amid renewed uncertainty on rate cuts.",
      "The S&P 500 is down 3% this month. Market leader Nvidia (NVDA) is down 6% in December.",
      "What has spooked the markets is the Fed not committing to aggressive rate cutting in 2025.",
      "The consensus among Fed officials is now for two rate cuts next year, down from four previously forecast in September, as the monetary policy body remains concerned about the inflationary outlook. The outlook for inflation is further clouded by potential moves by the incoming Trump administration, such as possibly inflationary tariffs on China.",
      "\"I don't see many [economic] red flags. People are cautiously optimistic if they own businesses, whether they're small, medium, or large,\" San Francisco Fed president Mary Daly said on Yahoo Finance's Opening Bid podcast.",
      "But again, nothing I heard from Daly suggested she is concerned about the demand outlook in the US despite inflation being stickier than she and other voting Fed members would like.",
      "\"The Fed was hawkish but I think people are jumping the gun on assuming rate cuts are over — that’s not what Powell said (plus he just gave markets 100 bps of easing in 2024),\" Sevens Report Research founder Tom Essaye told me.",
      "\"I do think 2025 could start a bit bumpy as Washington may be a bit dysfunctional (as we’re seeing now) and the Fed isn’t as dovish anymore, but I don’t think either are fatal to the bull market unless we see growth start to roll over.\"",
      "Then on the topic of demand, all signs point to an economy continuing to do quite well and supportive of strong earnings growth in 2025.",
      "Nike (NKE) called out double-digit percentage e-commerce growth this week for Black Friday on its earnings call. The latest retail sales report was strong.",
      "Salesforce co-founder and CEO Marc Benioff tells me he is securing new AI deals at a rapid clip, just weeks after announcing earnings.",
      "The AI thesis remains intact and will likely be a key driver of profits and valuation multiples in 2025.",
      "\"There are strong indicators that this could be a tough year — and, potentially, decade — for the stock market. I’m going to be bold and say we will see the opposite. I have no doubt that AI will drive the stock market in both the short and long term. Countries that lead in AI will see the fastest GDP growth, as well as a significant improvement in standard of living and defense capabilities. And, whoever leads with AI as a company will lead in their industry, regardless of their sector,\" former Cisco (CSCO) CEO John Chambers flagged this week as one of his 2025 predictions.",
      "So, while things feel as if they have changed in the market this week, drill down and it looks similar to what has powered the gains in 2024. Nothing lasts forever, and stocks don't go up in a straight line — two phrases to live by in life and in investing.",
      "Three times each week, I drive insight-filled conversations and chats with the biggest names in business and markets on Opening Bid. You can find more episodes on our video hub or watch on your preferred streaming service.",
      "Brian Sozzi is Yahoo Finance's Executive Editor. Follow Sozzi on X @BrianSozzi and on LinkedIn. Tips on deals, mergers, activist situations, or anything else? Email brian.sozzi@yahoofinance.com.",
      "Click here for the latest stock market news and in-depth analysis, including events that move stocks",
      "Read the latest financial and business news from Yahoo Finance"
    ],
    "url": "https://finance.yahoo.com/news/the-dow-gets-hit-with-a-sledgehammer--how-worried-should-you-be-133022256.html",
    "timestamp": "2024-12-22T13:30:22.000Z"
  },
  {
    "title": "Down 44%, This AI Stock Is a Screaming Buy Right Now (Hint: It's Not Nvidia)",
    "content": [
      "Nvidia has dominated the AI narrative in the stock market, captivating investors and the media after soaring 2,190% over the past five years and becoming the most valuable company in the world for a brief period (it's currently No. 2).",
      "However, Nvidia is far from the only opportunity in the AI or semiconductor space. In fact, one chipmaker just reported 400%-plus year-over-year data center revenue growth and overall revenue growth of 84% to $8.7 billion in its latest earnings report (for the quarter ending Nov. 28).",
      "I'm talking about Micron Technology (NASDAQ: MU), the memory-chip specialist that is surprisingly down 44% from its recent peak, despite that blowout growth. That discount and its potential in AI make the stock an appealing buy right now. Let's review the company's recent results first and then get into the buy case.",
      "Micron is a leader in memory chips, including DRAM, NAND, and high bandwidth memory (HBM). The company is also an integrated device manufacturer, meaning it both designs and manufactures its own chips like Intel and Samsung do.",
      "Memory chips are a highly cyclical business, prone to price fluctuations and industry gluts, and owning its own foundries makes Micron more exposed to the boom and bust cycle in semiconductors. Running foundries requires a high level of capital, but the integrated business model allows the company to better capture margins when the business is performing well.",
      "The chart below, which shows Micron's price compared to its previous high, gives a sense of how volatile the stock has been. As you can see, over the last decade, the stock has fallen by 40% or more on four occasions before hitting a new all-time high.",
      "Cyclicality and volatility are part of the risk in investing in Micron, but there's no question the semiconductor sector is in a boom right now, driven by the explosive growth of AI, though some subsectors like PCs and smartphones are weaker. In addition to Nvidia's blowout growth, industry bellwether Taiwan Semiconductor Manufacturing recently reported revenue growth of 36% in the third quarter to $23.5 billion, showing strong growth in the sector.",
      "Noting strong AI demand, management said that data center revenue topped 50% of total revenue for the first time in the quarter, following a trail first blazed by Nvidia in the chip sector. That now makes the vast majority of Micron's revenue from the data center, where AI computing is taking place.",
      "After reporting fiscal first-quarter earnings on Wednesday, Micron stock plunged as much as 19% on Thursday on its weak second-quarter guidance. However, the company has a history of being conservative with its guidance, and the weakness was due to consumer markets like smartphones, whereas the AI business remains strong.",
      "HBM, the part of the business closely tied to AI, is seeing impressive growth. The company said it's on track to achieve its HBM target for the fiscal year and reach a \"substantial record\" in HBM revenue, including \"significantly improved profitability, and free cash flow\" in the fiscal year.",
      "Micron expects a sequential decline in revenue and adjusted earnings per share (EPS) in the second quarter, falling from $8.7 billion to $7.9 billion and for adjusted EPS to slip from $1.79 to $1.43.",
      "However, management's explanation for the weak outlook should reassure investors. CEO Sanjay Mehrotra said the company had warned previously that seasonality and customer inventory reductions in consumer-facing segments like smartphones would affect Q2 results. He added, \"We are now seeing a more pronounced impact of customer inventory reductions,\" and continued, \"We expect this adjustment period to be relatively brief and anticipate customer inventories reaching healthier levels by spring, enabling stronger bit shipments in the second half of fiscal and calendar 2025.\"",
      "In other words, the issues causing the weak second-quarter guidance look like just a speed bump for the company rather than a sustained headwind, and management expects to return to sequential growth in the second half of the year. For a stock to fall 17% on a one-time guidance cut feels like a misread by the market and a buying opportunity for investors.",
      "A sell-off driven by short-term news often presents a good buying opportunity, but there's more to Micron's buy case than that. Micron is clearly capitalizing on the AI boom with the surge in data center revenue, and with its largest customer, which is believed to be Nvidia, now making up 13% of its revenue. A close relationship with Nvidia is clearly a tailwind at this stage of the AI boom as Nvidia just reported 94% growth in year-over-year revenue in its Q3 report.",
      "Micron's results are notoriously lumpy and cyclical, but it has the ability to generate huge profits under the right circumstances -- and those seem to be shaping up as the AI boom plays out. For example, Micron expects the addressable market for HBM to jump from $16 billion in 2024 to $64 billion in 2028 and to $100 billion in 2030. Even if it just maintains its market share in that segment, its HBM revenue will be up 4x in four years and 6x and six years.",
      "Finally, Micron stock is also much cheaper than its AI and chip stock peers, trading at a forward P/E of just 10 based on this year's estimates. While those estimates are likely to come down after its guidance, Micron still looks like a bargain at any price near that.",
      "Micron investors should monitor the chip and AI cycle closely, but there's a lot of upside potential in the stock. Getting back to its peak this summer would mean a 75% jump for the stock, and shares could continue to rally further over the next year or two, especially if it continues to see strong growth in the data center.",
      "Micron is the rare AI stock that offers rapid growth and a good value right now.",
      "Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.",
      "On rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:",
      "Nvidia: if you invested $1,000 when we doubled down in 2009, you’d have $349,279!*",
      "Apple: if you invested $1,000 when we doubled down in 2008, you’d have $48,196!*",
      "Netflix: if you invested $1,000 when we doubled down in 2004, you’d have $490,243!*",
      "Right now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon.",
      "See 3 “Double Down” stocks »",
      "*Stock Advisor returns as of December 16, 2024",
      "Jeremy Bowman has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Intel, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy.",
      "Down 44%, This AI Stock Is a Screaming Buy Right Now (Hint: It's Not Nvidia) was originally published by The Motley Fool"
    ],
    "url": "https://finance.yahoo.com/news/down-44-ai-stock-screaming-171500258.html",
    "timestamp": "2024-12-22T17:15:00.000Z"
  },
  {
    "title": "Is Nvidia (NVDA) Overvalued? Cramer Explains Why the AI Leader’s Stock is Still a Buy",
    "content": [
      "We recently compiled a list of the 7 Stocks that Jim Cramer Recently Discussed. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against the other stocks that Jim Cramer has recently discussed.",
      "Jim Cramer, host of Mad Money, recently addressed how investors can sometimes lose sight of the broader market perspective. He reminded his audience that the key to successful investing is simple: buy good stocks at reasonable prices and sell poor-performing stocks, even at a loss.",
      "Cramer also touched on the current market environment, noting that we're nearing the beginning of a rate-cutting cycle. While some may argue it’s not yet a cutting cycle, Cramer believes it is, regardless of whether it proceeds gradually. He pointed out that there’s another important factor to consider, an environment that is heavily oversold.",
      "READ ALSO: 6 Stocks Jim Cramer Talked About This Week and Jim Cramer’s Lightning Round: 7 Stocks to Watch.",
      "As Cramer looked at the market, he expressed his focus on identifying high-quality stocks that have seen significant declines. He noted that, in a market that has already experienced substantial gains, the only place to find true value is among the laggards. Specifically, he pointed to the healthcare sector, where 62 healthcare stocks in the S&P 500 are currently down by an average of 19.7% from their peaks. Cramer acknowledged that some of this decline is tied to real risks within the sector, such as President-elect Trump's focus on addressing middlemen in the drug industry, including pharmacy benefit managers and drug distributors. However, he believes much of the risk has already been priced into these stocks, making them potentially attractive investments at this point.",
      "Cramer also drew attention to the medical device and technology sector, where stocks are on average down 17.6% from their highs.",
      "For this article, we compiled a list of 7 stocks that were discussed by Jim Cramer during the recent episode of Mad Money on December 17. We listed the stocks in ascending order of their hedge fund sentiment as of the third quarter, which was taken from Insider Monkey’s database of 900 hedge funds.",
      "Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).",
      "Number of Hedge Fund Holders: 193",
      "Cramer discussed that NVIDIA Corporation (NASDAQ:NVDA) has recently been unjustifiably torn apart. He explained:",
      "Cramer, highlighting the success of companies with custom silicon businesses, added:",
      "NVIDIA (NASDAQ:NVDA) provides solutions for graphics, compute, and networking. Its GPUs, combined with the power of its proprietary CUDA software platform, have become essential to the infrastructure supporting AI applications. This combination has fueled significant growth for the company as major technology companies race to build increasingly sophisticated AI models.",
      "The company's revenue surged by 135% during the first nine months of its fiscal year 2025, reaching $91.2 billion. The growth trajectory of the company has been driven by the continued demand for its cutting-edge technologies, particularly its Hopper architecture, which is gaining traction in the AI space. Additionally, the launch of its Blackwell products is expected to further boost revenue.",
      "For the fourth quarter of fiscal 2025, NVIDIA (NASDAQ:NVDA) anticipates total revenue of approximately $37.5 billion. This projection reflects both the sustained demand for the Hopper architecture and the ramp-up of Blackwell products. Despite strong demand outpacing supply, its management has expressed confidence in surpassing its previous Blackwell revenue estimate, with visibility into supply chains improving steadily.",
      "As the Blackwell architecture continues to ramp up, the company expects its gross margins to moderate to the low 70s. However, when Blackwell is fully scaled, NVIDIA anticipates margins will stabilize in the mid-70s.",
      "Overall, NVDA ranks 1st on our list of stocks that Jim Cramer has recently discussed. While we acknowledge the potential of NVDA as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. If you are looking for an AI stock that is more promising than NVDA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.",
      "READ NEXT: 8 Best Wide Moat Stocks to Buy Now and 30 Most Important AI Stocks According to BlackRock.",
      "Disclosure: None. This article is originally published at Insider Monkey."
    ],
    "url": "https://finance.yahoo.com/news/nvidia-nvda-overvalued-cramer-explains-152452029.html",
    "timestamp": "2024-12-22T15:24:52.000Z"
  },
  {
    "title": "2 Quantum Computing Stocks That Could Supercharge Your Portfolio",
    "content": [
      "Quantum computing stocks have emerged as one of 2024's hottest investment themes, with the Defiance Quantum ETF (NASDAQ: QTUM) soaring 49.4% year to date, nearly doubling the S&P 500's robust 24.3% gain. While widespread commercial quantum computers might take years to develop, major technological breakthroughs have sparked an early rush into what many see as the next computing revolution.",
      "The excitement isn't just speculative hype. Quantum computing achieved two groundbreaking milestones in 2024, suggesting we're approaching a technological tipping point.",
      "Alphabet (NASDAQ: GOOG) (NASDAQ: GOOGL) made history with its Willow quantum computing system, which demonstrated the ability to reduce errors as the number of qubits increases exponentially. This breakthrough solves a challenge that has stumped researchers for nearly 30 years. Even more impressively, Willow completed a benchmark computation in under five minutes that would require today's fastest supercomputers 10 septillion years to solve -- a timespan far greater than the universe's age.",
      "Meanwhile, quantum computing start-up Infleqtion, working with Nvidia (NASDAQ: NVDA), achieved another first by demonstrating a practical materials science application using logical qubits. This breakthrough, which delivered a 6x boost in computational accuracy, hints at quantum computing's potential to revolutionize everything from battery technology to superconductors.",
      "While quantum computing remains in its infancy, these early breakthroughs, spurred by tech giants Alphabet and Nvidia, suggest we might be at the dawn of a computing revolution. Two companies are pioneering this transformative technology that could supercharge your portfolio in 2025 and beyond.",
      "Trapped-ion quantum computing leader IonQ (NYSE: IONQ) has emerged as one of 2024's standout quantum computing stocks. The company's novel approach uses ionized atoms as the heart of its quantum systems, enabling longer and more sophisticated calculations with fewer errors than competing approaches. IonQ's platform integrates with all major cloud providers and supports multiple programming languages, making quantum computing highly accessible to developers and researchers.",
      "The company's competitive advantages come from deep academic roots in ion trap technology spanning over 25 years of research and proven commercial traction through government and enterprise partnerships. IonQ has also expanded into quantum networking, working at the intersection of quantum computing and the future quantum internet.",
      "However, despite IonQ's impressive 258.5% stock gain in 2024, the company remains unprofitable and faces significant technological and commercialization risks. The quantum computing industry is still in its early stages, with uncertain timelines for achieving practical advantages over classical computers. Competition from tech giants and other quantum start-ups and the potential for technological obsolescence represent key risks to IonQ's market position.",
      "While IonQ's valuation may seem steep after its stellar 2024 run, with shares trading at nearly 250 times trailing sales, the company's growing commercial momentum, expanding quantum networking business, and strong balance sheet of $382.8 million at the end of the most recent quarter put it in pole position to capture a significant share of what could become a multitrillion-dollar quantum computing market. For investors with a high risk tolerance and a long-term horizon, IonQ offers pure-play exposure to one of technology's most promising frontiers.",
      "Quantum computing pioneer Rigetti Computing (NASDAQ: RGTI) takes a fundamentally different approach to quantum computing than IonQ, using superconducting circuits instead of trapped ions. The company's vertically integrated strategy includes Fab-1, the industry's first dedicated quantum foundry, giving Rigetti control over the entire quantum chip development process. This in-house manufacturing capability allows for rapid innovation cycles and helps protect against supply chain risks.",
      "The company's latest Ankaa quantum processor architecture has achieved 98% two-qubit gate fidelity, marking significant progress in quantum performance. Rigetti's strategy focuses heavily on scalability through a modular chip design that allows larger quantum systems to be built from smaller, identical components. The company has also built strong partnerships across government, research, and commercial sectors.",
      "However, like other quantum companies, Rigetti faces major technological hurdles and remains unprofitable. The stock's 851.2% surge in 2024 and valuation at 130 times sales indicate investors are pricing in significant future growth potential. Still, with its integrated manufacturing approach, improving quantum performance metrics, and clear technology roadmap through 2025, Rigetti offers an intriguing pure-play option for investors seeking exposure to superconducting quantum computing technology.",
      "While tech giants like Alphabet and Nvidia have made significant strides in quantum computing, their massive market capitalizations mean quantum breakthroughs will likely have minimal impact on their stock prices. Pure-play quantum companies like IonQ and Rigetti offer more direct exposure to the technology's potential, though with considerably higher risk. Each represents a different technological approach -- trapped ions versus superconducting circuits -- and both could emerge as winners in what may become a massive new computing market.",
      "Given quantum computing's early stage and technical complexity, however, many investors may prefer a more diversified approach. The Defiance Quantum ETF offers exactly that, balancing pure-play quantum stocks with established tech leaders advancing the technology. With quantum computing potentially approaching an inflection point, investors now have multiple ways to position themselves for what could become one of the most transformative technologies of our time.",
      "Before you buy stock in IonQ, consider this:",
      "The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and IonQ wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.",
      "Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $825,513!*",
      "Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.",
      "See the 10 stocks »",
      "*Stock Advisor returns as of December 16, 2024",
      "Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. George Budwell has positions in IonQ and Nvidia. The Motley Fool has positions in and recommends Alphabet and Nvidia. The Motley Fool has a disclosure policy.",
      "2 Quantum Computing Stocks That Could Supercharge Your Portfolio was originally published by The Motley Fool"
    ],
    "url": "https://finance.yahoo.com/news/2-quantum-computing-stocks-could-150000454.html",
    "timestamp": "2024-12-22T15:00:00.000Z"
  },
  {
    "title": "Should You Buy This Artificial Intelligence (AI) Stock Before 2025?",
    "content": [
      "A skeptical market is finally starting to see International Business Machines (NYSE: IBM) as a leading name in the artificial intelligence (AI) market. As a result, IBM's stock has gained a market-beating 37% in 2024 -- or 44% if you look at total returns with reinvested dividends.",
      "Is Big Blue still a buy after this swift rise, or is the growth engine running out of rocket fuel? Let's see how the company and stock are positioned just before 2025.",
      "At first glance, IBM's recent results may not look too impressive.",
      "Sales rose just 2% year over year in the recent third-quarter report. Foreign exchange effects explained the entire revenue increase. Bottom-line earnings per share (EPS) came in 5% higher, partly thanks to a slightly lower tax rate. Am I boring you to sleep yet? That's a safe and stable report, broadly aligned with analyst expectations and hardly anything to get excited about.",
      "But when you dig deeper, you'll see that IBM's flattish results actually are impressive. The beefy infrastructure segment showed a 7% revenue dip, led by a 19% downturn in the very cyclical IBM Z mainframe business. This division rises and falls with mainframe product cycles, and the next refresh of IBM Z systems is due in 2025. That release should see more AI features powered by IBM's custom AI chips.",
      "Balancing out that cyclical headwind, IBM's software and services pulled their weight. Automation revenues rose 13%, the Red Hat hybrid cloud business came in 14% higher, and AI revenues ticked 5% higher.",
      "That's another disappointing figure, right? AI is supposed to be a leading growth driver, not a modest single-digit revenue booster. So, it's nice to see other businesses make up for the predictable mainframe slowdown. But why is the AI growth so limited?",
      "The thing is, IBM doesn't make quick sales. Instead, it sets up long-term subscription and technical support contracts. The setup phase can be quite slow, especially regarding complicated ideas like setting up generative AI systems. Many prospective clients go through several rounds of technical testing, management approval, and budget processes before signing on the dotted line.",
      "But when they do, IBM will have a lucrative customer for the long haul.",
      "In the spring of 2023, the company launched a generative AI platform called watsonx. One year later, watsonx had amassed more than $2 billion of firm multiyear contracts.",
      "One quarter later, the watsonx order book had grown by another $1 billion. That's a 50% order increase in three months, also known as a tipping point. Big Blue will convert these paper contracts into cash sales over time while also signing more AI deals.",
      "This dynamic has been fairly obvious since watsonx was introduced. This is how IBM works, and you're watching the company finally take advantage of a strategy shift nearly a decade in the making.",
      "And next year's AI-boosted System Z mainframes will represent the bullish half of a multiyear business cycle. Adding that business driver to the AI contract activity should result in soaring sales and generous cash flows.",
      "\"Our portfolio is well positioned to deliver an upward inflection in growth in 2025,\" IBM CEO Arvind Krishna said in the third-quarter earnings call. That's a modest way of saying IBM's results should impress Wall Street next year.",
      "The recent price gains have also increased the stock's valuation ratios. That's just how math works, I'm afraid. But IBM shares still look affordable in comparison to other AI giants, especially when you focus on the all-important cash profits. Whether you measure each stock by price to sales or price to free cash flow, Big Blue is a bargain-bin buy next to Nvidia or Microsoft:",
      "AI Stock",
      "Price to Free Cash Flow (TTM)",
      "Price to Sales (TTM)",
      "Market Cap",
      "IBM",
      "16.5",
      "3.3",
      "$207 billion",
      "Nvidia",
      "58.3",
      "29.1",
      "$3.30 trillion",
      "Microsoft",
      "44.7",
      "12.8",
      "$3.2 trillion",
      "Data sourced from Finviz.com on Dec. 20, 2024. TTM = trailing 12 months.",
      "I'm excited about the AI boom and don't mind taking a slow approach to investing in that game-changing revolution. Therefore, I highly recommend grabbing some IBM shares while they are cheap. Nvidia and Microsoft can wait.",
      "Next year's business growth should leave 2024's modest gains far behind, especially if you keep an eye on IBM's future-proofing watsonx contracts.",
      "Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.",
      "On rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:",
      "Nvidia: if you invested $1,000 when we doubled down in 2009, you’d have $349,279!*",
      "Apple: if you invested $1,000 when we doubled down in 2008, you’d have $48,196!*",
      "Netflix: if you invested $1,000 when we doubled down in 2004, you’d have $490,243!*",
      "Right now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon.",
      "See 3 “Double Down” stocks »",
      "*Stock Advisor returns as of December 16, 2024",
      "Anders Bylund has positions in International Business Machines and Nvidia. The Motley Fool has positions in and recommends Microsoft and Nvidia. The Motley Fool recommends International Business Machines and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.",
      "Should You Buy This Artificial Intelligence (AI) Stock Before 2025? was originally published by The Motley Fool"
    ],
    "url": "https://finance.yahoo.com/news/buy-artificial-intelligence-ai-stock-144300863.html",
    "timestamp": "2024-12-22T14:43:00.000Z"
  },
  {
    "title": "3 Bold Stock Market Predictions for 2025",
    "content": [
      "The year is almost over, and it's time to make some bold predictions for 2025.",
      "In this article, three Motley Fool contributors draw on their experience to forecast what may be in store for the stock market next year. Here's what they have to say about Artificial Intelligence (AI) software stocks, Ark Innovation ETF, the Magnificent Seven, and more!",
      "Jake Lerch (AI software stocks): My prediction is that 2025 will be the year of software stocks. Think about it: Hardware stocks were some of the top-performing stocks of 2024. Semiconductor companies like Nvidia, Broadcom, and ARM Holdings saw their stocks skyrocket as demand for high-powered chips went through the roof.",
      "However, as the calendar turns from 2024 to 2025, I predict that the stock market may begin to shift its attention away from chip stocks and toward software stocks like SoundHound AI and Palantir.",
      "Indeed, over the last few months, a shift has already started, with the stocks of application-makers like SoundHound and Palantir outpacing semiconductor stocks like Nvidia and AMD.",
      "What's more, some of these software companies remain relatively small in terms of market cap. As of this writing, SoundHound AI sports a market cap of about $8 billion. That makes it a potential acquisition target for deep-pocketed tech mega-caps. For example, Meta Platforms has over $70 billion in cash on hand -- more than enough to snap up SoundHound with tens of billions in cash left over.",
      "But it's not just the upstarts that could benefit from the shifting focus to software. Companies in the digital advertising and digital learning spaces could also benefit as stock market participants look beyond AI hardware to some of its practical applications. Reddit is testing an AI-powered answering tool that could help the company draw more users -- and ad dollars. Learning app Duolingo is expanding beyond language learning by incorporating music and math lessons. Those new lessons -- powered by AI -- will help Duolingo attract more users and subscribers.",
      "In short, the everyday uses of AI are nearly limitless -- and they're just starting to roll out. Because of that, I predict 2025 will be the year that AI-powered software shines bright.",
      "Will Healy (Ark Innovation ETF): Although many investors profited from the latest bull market, the rally was not broad-based. Instead, most of the benefit went to the top stocks. One can see this when comparing the performance of the S&P 500 over the last two years to that of the Russell 2000.",
      "This has worked against Cathie Wood's Ark Innovation ETF (NYSEMKT: ARKK), as most of its holdings are not S&P 500 stocks. The ETF is up by just over 20% this year, and all of that gain occurred following the U.S. presidential election.",
      "Fortunately for Ark Holdings, many of these stocks left behind by the current rally seemed to move off their lows in recent weeks. As interest rates fall and post-election optimism rises, this should bode well for Cathie Wood's flagship ETF.",
      "To see this, one only has to look at its holdings. Of its top 10 positions, only Tesla (NASDAQ: TSLA) and Palantir (NASDAQ: PLTR) are S&P 500 stocks. However, the recovery is now trickling down to the non-S&P holdings.",
      "For example, its second-largest holding, Roku (NASDAQ: ROKU), makes up more than 9% of the fund and appeared to miss most of the current tech rally. While Roku is still more than 80% lower than its 2021 high, its stock has risen by over 60% from its August low, an improvement helping the Ark Innovation ETF.",
      "The improvement is more profound for fourth place holding Roblox (NYSE: RBLX), which is around 6% of the Ark Innovation ETF. Although that stock has stagnated since the 2022 bear market, it has doubled in value from its May low. The rally started even earlier for a stock that is 5% of the fund, Robinhood Markets (NASDAQ: HOOD), which is up over 240% this year!",
      "Such improvements are indicators that the tech rally has finally moved beyond the Magnificent Seven and other top stocks. As we move into 2025 and the rest of the tech sector finally begins to rally, a long-awaited recovery for the Ark Innovation ETF appears to be at hand.",
      "Justin Pope (Magnificent Seven): Anyone with investment exposure to the Magnificent Seven stocks, including Apple, Alphabet, Amazon, Meta Platforms, Microsoft, Nvidia, and Tesla, has likely enjoyed the past two years. The Magnificent Seven represents approximately 32% of the S&P 500 index, so their widespread outperformance has helped carry the stock market.",
      "My 2025 prediction is that some of these names will start running out of steam.",
      "These companies lead or compete in a handful of high-growth end markets, including e-commerce, digital advertising, cloud computing, semiconductors, artificial intelligence (AI), robotics, and more. If you're investing for the long term, the Magnificent Seven should still be a winning choice.",
      "However, some of these companies have risen so much that their valuations have gotten ahead of the underlying businesses, which could lead to a down year for some big names in 2025. For example, Apple's AI tech, Apple Intelligence, may not be the home run investors hoped for. Yet, the stock trades at 34 times earnings despite analysts forecasting under 10% annualized long-term growth. That's a pretty steep valuation.",
      "Tesla has rallied hard since the presidential election but trades at 177 times its earnings despite soft sales in its core vehicle business. Analysts estimate Tesla will grow earnings by 8% annually over the next several years, which is nowhere near enough to justify such a high price-to-earnings (P/E) ratio.",
      "Some Magnificent Seven names could keep running next year. Alphabet and Meta trade at P/E ratios of 24 and 27, respectively. Meanwhile, analysts believe they will each grow earnings by 16% to 18% annually over the long term. That's far more growth at a better price than you're getting from Apple and Tesla.",
      "The bottom line? Investors should pay close attention to the growth they're getting and the price they pay for it. Indiscriminately buying the Magnificent Seven has worked for two years, but that trend may soon end.",
      "Before you buy stock in Ark ETF Trust - Ark Innovation ETF, consider this:",
      "The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Ark ETF Trust - Ark Innovation ETF wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.",
      "Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $825,513!*",
      "Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.",
      "See the 10 stocks »",
      "*Stock Advisor returns as of December 16, 2024",
      "John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Jake Lerch has positions in Alphabet, Amazon, Duolingo, Nvidia, Reddit, Roblox, and Tesla. Justin Pope has positions in Roku. Will Healy has positions in Roku. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, Palantir Technologies, Roblox, Roku, and Tesla. The Motley Fool recommends Broadcom and Duolingo and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.",
      "3 Bold Stock Market Predictions for 2025 was originally published by The Motley Fool"
    ],
    "url": "https://finance.yahoo.com/news/3-bold-stock-market-predictions-130000068.html",
    "timestamp": "2024-12-22T13:00:00.000Z"
  },
  {
    "title": "The Best Stocks to Invest $1,000 in Right Now",
    "content": [
      "After soaring in 2024, the stock market is approaching the end of December in a volatile fashion. On Friday, Dec. 20, artificial intelligence (AI) chip designer Nvidia is down by 11% in a month.",
      "The stock is still up by 161% year to date, but that's a pretty sharp correction. If you have been looking for an opportunity to buy Nvidia shares at a lower price, this just might be the correction you've been waiting for.",
      "Even so, market darling Nvidia isn't my favorite stock pick right now. The shares are still pricey at 52 times trailing earnings or 58 times free cash flow, and there are lots of modestly priced alternatives out there.",
      "If you have $1,000 to invest after paying the holiday bills, here are two of my favorite stock-buying opportunities right now. Fiverr International's (NYSE: FVRR) growth prospects are ridiculously undervalued, and Intel (NASDAQ: INTC) isn't used to playing the underdog, but I see great promise in its ongoing strategy shift.",
      "Many investors saw Fiverr as a direct play on the coronavirus pandemic. Lots of people were stuck at home for months, with uncertain income sources and rising costs of living. Why not take advantage of a freelance services expert like Fiverr to bolster that aching wallet for a while?",
      "On the flip side, the same investors who rode Fiverr's stock to lofty highs in 2020 and 2021 have been avoiding the stock in recent years. The lockdowns are over, so the unique and temporary business opportunity is gone forever.",
      "Right?",
      "Well, no. As it turns out, Fiverr's business slowed down after the widespread return to offices, but it never stopped growing. The company is also quite profitable, especially in the shareholder-friendly realm of free cash flows.",
      "Yet, the stock has continued to lag behind the broader market in this bull market. Fiverr's shares are up by a measly 9% in two years, while the S&P 500 (SNPINDEX: ^GSPC) gained 55% over the same period. The stock trades at a very affordable 14.6 times free cash flows, and its forward-looking price-to-earnings valuation is also low.",
      "The company expects healthy revenue growth in 2025, driven by more optimistic market outlooks among small and medium-sized business owners. As a preview of what to expect in 2025 and beyond, Fiverr shares rose 35% in a week after crushing analyst targets in October's third-quarter report. That bullish price correction was a good start, but Fiverr's market makers have more work to do.",
      "All things considered, Fiverr's stock deserves a richer valuation. This growth story looks deeply undervalued, and I expect good news on that front in the near future.",
      "Semiconductor giant Intel is trying out a very different business plan. And when I say \"trying out,\" I mean that the company is pulling every available lever to make radical strategy changes. The company's capital expenses were about $15 billion a year before the COVID-19 crisis. Building one of the world's largest third-party chip manufacturing services isn't cheap, so those costs rose to approximately $25 billion in the last three years.",
      "Intel expects to have the second-largest external chip foundry in the world by 2030. This ambition is potentially good for Intel's business results and stock owners and serves an important market function. Most of Intel's chipmaking facilities are springing up in places like Arizona and Ohio, making advanced semiconductor manufacturing available on American soil.",
      "This is important for national security purposes. Due to a long-running exchange of American trade restrictions and border-crossing tariffs with the chip centers in China and Taiwan, this approach sets Intel up for long-term success.",
      "The company is currently unprofitable, and the stock trades at bargain-bin valuation ratios in this painful period. Technology genius Pat Gelsinger was recently forced to retire as large-scale Intel investors grew impatient with his extreme focus on long-term results. In my view, this imbalance between Gelsinger's clear-eyed legacy and an overly bearish market reaction adds up to a fantastic buying opportunity for Intel stock right now.",
      "Before you buy stock in Fiverr International, consider this:",
      "The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Fiverr International wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.",
      "Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $825,513!*",
      "Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.",
      "See the 10 stocks »",
      "*Stock Advisor returns as of December 16, 2024",
      "Anders Bylund has positions in Fiverr International, Intel, and Nvidia. The Motley Fool has positions in and recommends Fiverr International, Intel, and Nvidia. The Motley Fool recommends the following options: short February 2025 $27 calls on Intel. The Motley Fool has a disclosure policy.",
      "The Best Stocks to Invest $1,000 in Right Now was originally published by The Motley Fool"
    ],
    "url": "https://finance.yahoo.com/news/best-stocks-invest-1-000-123900730.html",
    "timestamp": "2024-12-22T12:39:00.000Z"
  },
  {
    "title": "Here's How Many Shares of Accenture You Should Own to Get $1,000 in Yearly Dividends",
    "content": [
      "One of the more closely watched stocks in the tech world lately has been consulting company Accenture (NYSE: ACN). That's because it's plunging deep into the rapaciously hungry market for artificial intelligence (AI) know-how.",
      "Unlike the typical tech (or tech-adjacent) stock, Accenture is a steady, and reliable, dividend payer, handing out a shareholder distribution every quarter. For investors who believe in the company, here's how much of a stake is required to draw $1,000 annually from its dividends.",
      "In October, Accenture and top AI equipment and solutions supplier Nvidia announced a significant expansion of their existing partnership. The cornerstone of this is Accenture's formation of the Nvidia Business Group, an in-house consultancy unit devoted solely to helping clients harness AI solutions powered by the hotly popular chip maker.",
      "Accenture's AI division will be sizable. It said that it'll be \"supported\" by more than 30,000 people receiving specialized training for this cutting-edge consultancy work.",
      "Generative AI has already contributed generously to Accenture's fundamentals, to the tune of $3 billion worth of client bookings in its recently concluded 2024 fiscal year. It's easy to imagine that figure rising steeply if the company sells and manages that service effectively.",
      "Getting around to that dividend, $1,000 annually in shareholder payouts requires owning 169 shares of Accenture stock. As of Thursday's market close, this costs $58,820 and change.",
      "With that level of commitment, we have to ask whether the distribution is sustainable. I think it is.",
      "The disciplined and reliably profitable Accenture tends to generate around $8.5 billion annually in free cash flow (FCF), which is more than enough to fund the dividend payout. This expense totaled $3.2 billion in fiscal 2024, for example. Much of the remainder is usually swallowed by share repurchases ($4.5 billion that year).",
      "To me, Accenture is a fine and somewhat under-the-radar way to play the AI explosion we're currently witnessing. The company is tied tightly to a leading supplier in the business, and it should see a commensurate rise in its fundamentals as a result.",
      "Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.",
      "On rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:",
      "Nvidia: if you invested $1,000 when we doubled down in 2009, you’d have $349,279!*",
      "Apple: if you invested $1,000 when we doubled down in 2008, you’d have $48,196!*",
      "Netflix: if you invested $1,000 when we doubled down in 2004, you’d have $490,243!*",
      "Right now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon.",
      "See 3 “Double Down” stocks »",
      "*Stock Advisor returns as of December 16, 2024",
      "Eric Volkman has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Accenture Plc and Nvidia. The Motley Fool recommends the following options: long January 2025 $290 calls on Accenture Plc and short January 2025 $310 calls on Accenture Plc. The Motley Fool has a disclosure policy.",
      "Here's How Many Shares of Accenture You Should Own to Get $1,000 in Yearly Dividends was originally published by The Motley Fool"
    ],
    "url": "https://finance.yahoo.com/news/heres-many-shares-accenture-own-113700667.html",
    "timestamp": "2024-12-22T11:37:00.000Z"
  },
  {
    "title": "Is Nvidia Stock a Buy?",
    "content": [
      "Nvidia's (NASDAQ: NVDA) stock has been a huge winner each of the past two years. After surging over 238% in 2023, the stock has soared approximately 164% this year, as of this writing. Those are two huge back-to-back year gains that have propelled the company to become one of the largest in the world.",
      "The question is, can the stock hit the market with a three-peat of outsized gains in 2025? Interestingly, the stock has been able to generate returns of 30% or more for three straight years on four previous occasions and returns of 50% or greater for three straight years twice. It has never had four years in a row of 30% or more returns, but it did have one stretch where its stock rose by 25% or more for five straight years from 2013 to 2017.",
      "Let's look at why I think Nvidia can turn in another year of strong performance in 2025.",
      "Any investment in Nvidia centers around spending on artificial intelligence (AI) infrastructure. The graphics processing units (GPUs) that it designs have become the backbone of the AI infrastructure buildout, as GPUs can perform many calculations at the same time, making them ideal for use in training large language models (LLMs) and running AI inference.",
      "Meanwhile, as AI models become more sophisticated, they need exponentially more computing power, and thus GPUs, to advance. For example, both Amazon's Llama 4 LLM and xAI's Grok 3 model were trained on 10 times as many GPUs as their predecessors trained on.",
      "Demand for GPUs is being driven by large hyperscale (companies with massive data centers) tech companies (such as Microsoft, Alphabet, Amazon, and Meta Platforms) as well as well-funded AI start-ups like OpenAI and Elon-Musk backed xAI. Currently, these companies are all racing to create the best and most powerful AI models, leading to what Nvidia has called \"insane\" demand for its newest-generation Blackwell GPUs.",
      "However, growth is not expected to stop, with Nvidia's largest customers, by and large, indicating that they plan to spend more on building out data centers to help power their AI ambitions. Nvidia customers such as Meta Platforms and Alphabet have said the biggest risk with AI infrastructure is underinvesting, as they look to capitalize on what they see as a generational opportunity. Oracle, meanwhile, has said it expects strong AI infrastructure growth to continue over the next five to 10 years.",
      "Nvidia isn't the only company that makes GPUs, but it has been able to create a wide moat in large part due its CUDA software platform. GPUs were originally developed to speed up graphics rendering (hence the name) in applications like video games. However, as Nvidia looked to expand the use case for these chips, it created a free software program that allowed developers to program its chips for other tasks.",
      "While it took time, this led to CUDA becoming the standard on which developers learned to program GPUs for various tasks, creating the wide moat it has today. Meanwhile, it was arguably the use of its GPUs in cryptocurrency mining that really helped set the groundwork for Nvidia's current AI success today, as it demonstrated the power of its GPUs in high-performance computing.",
      "Nvidia has not sat still following its initial CUDA development and in the years since it has built domain-specific microservices and libraries on top of Cuda, called CUDA X, to better optimize it for AI. Meanwhile, the company has also sped up its development cycle for its GPUs to once a year in order to remain at the forefront of GPU technology.",
      "The company's biggest challenge at the moment appears to be coming from custom AI chips, such as those Broadcom helps develop for customers. These are custom chips designed for very specific tasks, and thus they can be more efficient. However, it also takes time to design and manufacture custom chips, and like most custom things, they are more expensive. In a world racing for AI, Nvidia's chips are more accessible and cheaper and have an array of AI-specific microservices and libraries through CUDA X.",
      "As such, while custom AI chips will likely continue to take some share, Nvidia still looks like it will remain the king of AI chips for the foreseeable future.",
      "The final reason why I think Nvidia is poised for another year of outperformance in 2025 is its valuation. Despite its huge gains over the past two years, the stock only trades a forward price-to-earnings (P/E) ratio of about 30 based on 2025 analyst estimates, and a price/earnings-to-growth (PEG) ratio of approximately 0.95. A PEG ratio under 1 is typically viewed as undervalued, but growth stocks will often have PEG ratios well above 1.",
      "For a company that just saw its revenue grow by 94% year over year last quarter and which is projected to see 50% revenue growth in 2025, that's an attractive valuation. With AI looking to be still in its early innings and the company having a wide moat, the stock looks like a buy heading into 2025.",
      "Before you buy stock in Nvidia, consider this:",
      "The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.",
      "Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $825,513!*",
      "Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.",
      "See the 10 stocks »",
      "*Stock Advisor returns as of December 16, 2024",
      "John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Geoffrey Seiler has positions in Alphabet. The Motley Fool has positions in and recommends Alphabet, Amazon, Meta Platforms, Microsoft, Nvidia, and Oracle. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.",
      "Is Nvidia Stock a Buy? was originally published by The Motley Fool"
    ],
    "url": "https://finance.yahoo.com/news/nvidia-stock-buy-113000828.html",
    "timestamp": "2024-12-22T11:30:00.000Z"
  },
  {
    "title": "3 Stocks That Could Join the Trillion-Dollar Market Cap Club Next Year",
    "content": [
      "Believe it or not, there are now nine publicly traded U.S. companies worth $1 trillion or more.",
      "They are Apple, Microsoft, Nvidia, Amazon, Alphabet, Meta Platforms, Tesla, Broadcom, and Taiwan Semiconductor. Berkshire Hathaway was briefly a member of the group, but its market cap has dipped slightly below the threshold this month. Still, it seems likely that it will rise back above the mark again, effectively making the conglomerate the tenth trillion-dollar company.",
      "Just a few years ago, there weren't any U.S. companies worth more than $1 trillion, and at the end of 2023, there were only five (the first five named on the list above).",
      "Thanks to the artificial intelligence (AI) boom, a resilient U.S. economy, and falling interest rates, membership in the club isn't quite as exclusive as it once was. Assuming this bull market continues in 2025, there are a few more companies that could reach a $1 trillion market cap -- including these three.",
      "Walmart (NYSE: WMT) has been one of the biggest surprises on the stock market over the last few years as the brick-and-mortar retail giant reinvented itself as a cohesive omnichannel business with growth avenues in e-commerce, a third-party marketplace, and advertising. Meanwhile, it performed well in the inflationary period thanks to its strength in groceries and its economies of scale, which allowed it to beat competitors on price and also pass along price increases to customers.",
      "Walmart's market cap has more than doubled over the last three years, and the stock was up 81% year to date through Dec. 18 thanks to solid growth on the top and bottom lines. Wall Street also seems to be rerating the stock in recognition of the value of its competitive advantages. Walmart now has a market cap of $763.8 billion.",
      "From there, its market cap would have to increase by 31% in 2025 for it to cross the $1 trillion threshold. That won't be an easy climb, especially after this year's steep rise, but it could get there.",
      "Walmart is unlikely to deliver 31% earnings growth, but it could benefit from continued multiple expansion, as its P/E of 39.2 is still a significantly lower valuation than Costco's P/E of 57.",
      "Eli Lilly (NYSE: LLY) is now the most valuable pharmaceutical company in the U.S. thanks to the strong sales of its weight-loss and diabetes drugs Zepbound and Mounjaro (both of which are brands of the same compound, the GLP-1 inhibitor tirzepatide). It nearly reached a $1 trillion market cap earlier this year, but broader pressure in the pharma sector sent the stock lower in the second half of the year.",
      "Lilly is now up 32% year to date, with a market cap of $689.5 billion, meaning it would need to grow by 45% to get to $1 trillion.",
      "However, a look at Eli Lilly's recent results shows why that's very much within reach for the company. Revenue in the third quarter rose 20% to $11.4 billion, driven by sales growth from Mounjaro and Zepbound. As those drugs have gained adoption, Lilly's profits have soared: Adjusted net income jumped by more than 1,000% year over year to $1.06 billion in the quarter. Those drugs also have a lot of potential to be big sellers outside of the U.S. as well.",
      "The analysts' consensus estimate is that Lilly's adjusted EPS will jump from $13.15 in 2024 to $22.60 next year, but the company could easily top that forecast. If sales of its new weight-loss drugs continue to grow and its addressable market expands, a $1 trillion market cap could be within Lilly's reach.",
      "No banks have yet reached the $1 trillion market cap level, but JPMorgan Chase (NYSE: JPM) could become the first. It's the nation's largest bank by assets, and its diversified business model across commercial and investment banking, and CEO Jamie Dimon's balanced stewardship, have given it a market cap that's head and shoulders above its competitors.",
      "Year to date, the bank is up 35%, and its market cap is $648.6 billion. At that valuation, it would need to jump another 54% to reach $1 trillion. That might make it a long shot to hit that mark next year, but a perfect storm could be brewing for JPMorgan Chase.",
      "First, bank investors are hopeful that the incoming Trump administration will bring a looser new regulatory framework on the antitrust front that would encourage more mergers and acquisitions. That would benefit investment banks like JPMorgan Chase which collect large fees for advising and facilitating M&A deals. Friendlier regulatory oversight could also enliven the IPO market, which could yield another windfall for JPMorgan. Additionally, investors are betting that a Republican-controlled Congress and White House will cut taxes, which would favor banks by leaving more money available for investment. Finally, interest rates have remained elevated and the Fed just cut back its forecast for rate cuts next year from four to two. Higher interest rates make it easier for JPMorgan Chase to earn more money on loans.",
      "A strong, less-regulated economy with high interest rates may be the ideal scenario for JPMorgan Chase stock. And with the stock trading a price-to-earnings ratio of 12.8, it has plenty of room for multiple expansion as well.",
      "Before you buy stock in Walmart, consider this:",
      "The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Walmart wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.",
      "Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $825,513!*",
      "Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*.",
      "See the 10 stocks »",
      "*Stock Advisor returns as of December 16, 2024",
      "JPMorgan Chase is an advertising partner of Motley Fool Money. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Jeremy Bowman has positions in Amazon, Broadcom, and Meta Platforms. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Berkshire Hathaway, Costco Wholesale, JPMorgan Chase, Meta Platforms, Microsoft, Nvidia, Taiwan Semiconductor Manufacturing, Tesla, and Walmart. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.",
      "3 Stocks That Could Join the Trillion-Dollar Market Cap Club Next Year was originally published by The Motley Fool"
    ],
    "url": "https://finance.yahoo.com/news/3-stocks-could-join-trillion-103400941.html",
    "timestamp": "2024-12-22T10:34:00.000Z"
  }
]