[
  {
    "title": "Trump tariffs to hit tech heavyweights, chip giants could be next",
    "content": [
      "President Donald Trump’s 10% tariffs on goods made in China take effect Tuesday, putting electronics ranging from PCs to smartphones in the crosshairs. Trump has also signaled that he is considering tariffs on chips and products associated with chips, which could put further pressure on the tech industry.",
      "The tariffs on Chinese-made goods are part of a package Trump has put into place on China, Canada, and Mexico. On Monday, Trump said he was pausing tariffs on Mexico for a month after productive talks with Mexican President Claudia Sheinbaum.",
      "Read more: The latest news and updates as Trump's tariff deadline approaches",
      "The tech industry depends on manufacturing facilities in China to build the electronics Americans rely on. It’s up to each company to determine how it will respond to the 10% tariff. While some might be able to absorb the impact, paying for it themselves, others will have to pass the cost on to their customers, driving up the prices of consumer and enterprise products.",
      "And if Trump decides to enact tariffs on chips, those goods could end up costing even more money at a time when consumers are still grappling with inflation.",
      "“It's going to have a pretty significant impact,” John Vinh, KeyBanc Capital Markets equity research analyst, told Yahoo Finance in a live interview. “As those prices increase, we think there's probably going to be a negative impact to end demand. And ultimately that's going to flow upstream to all the chip companies.”",
      "Shares of chip stocks including Nvidia (NVDA), AMD (AMD), and Intel (INTC) were broadly down in late-afternoon trading Monday.",
      "Apple (AAPL) is perhaps the tech company most at risk from Trump’s initial round of tariffs on China. The company has a massive manufacturing base in the country, which means everything from the iPhone and iPad to the MacBook Pro is facing 10% tariffs.",
      "Add 10% to a base iPhone 16 Pro, which costs $999, and you’re looking at an increase of $99. Slap an extra 10% on the cost of a $1,599 MacBook Pro, and consumers will be on the hook for an extra $159. Apple could always swallow all or part of the 10% tariff, but that will dent profit margins.",
      "According to BofA Global Research analyst Wamsi Mohan, Apple could be forced to rely on manufacturing facilities in other countries to avoid the majority of the tariff impacts. Mohan estimates that if Apple can source 80% of products from outside of China, the company will only face a $0.05 impact on earnings.",
      "But if it can only source 50% of its devices, that number rises to between $0.07 and $0.12 depending on whether Apple raises prices.",
      "Apple has been working with manufacturing partners in India over the last few years to ensure it can build the latest iPhone in the country, giving it a solid base to pull devices from.",
      "While working around these tariffs is doable for a company like Apple, Trump has also floated the idea of raising tariffs as high as 60%, which would have far larger implications for the iPhone maker and its customers.",
      "Trump provided Apple with tariff exemptions during his first term in office and could do so again this time around. But so far, he hasn’t.",
      "While Trump’s latest tariffs don’t hit the most advanced chips on the market, he has already signaled that he plans to levy separate duties on them in the future. That would force chipmakers to either raise prices on their goods or deal with the increase on their own.",
      "If chip companies do raise prices, the increase would be passed down to device partners, including PC manufacturers, which could deal with the higher costs or simply pass them on to consumers and enterprise customers.",
      "For companies like Amazon (AMZN), Google (GOOG, GOOGL), Meta (META), and Microsoft (MSFT), which are pouring money into AI chips, any price increase would mean having to pay far more to build out their data centers.",
      "Tariffs won’t get chip companies to start building manufacturing facilities overnight either. It takes years to construct a semiconductor fabrication plant, or fab. And while companies like TSMC and Samsung are building chip fabs in the US, they will still rely on facilities in other countries as well.",
      "Wedbush analyst Dan Ives, however, says the risk to chip companies is low in the near term, especially as it relates to the AI trade.",
      "“Tariffs are not going to dent the AI Revolution trade as we continue to believe even if the tariffs continue for some time (60 days-90 days) there will be exemptions to this policy which likely include Apple products and Nvidia chips,” Ives wrote in an investor note.",
      "Still, there’s no guarantee that a trade fight would be that short-lived or that companies will get carve-outs as they previously did. It’s all in Trump’s hands for now.",
      "Email Daniel Howley at dhowley@yahoofinance.com. Follow him on Twitter at @DanielHowley.",
      "For the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here",
      "Read the latest financial and business news from Yahoo Finance"
    ],
    "url": "https://finance.yahoo.com/news/trump-tariffs-to-hit-tech-heavyweights-chip-giants-could-be-next-214319603.html",
    "timestamp": "2025-02-03T21:43:19.000Z"
  },
  {
    "title": "As Trump’s tariffs add risk to chips and consumer stocks, investors may look to defensive plays",
    "content": [
      "Investors breathed a sigh of relief Monday after President Trump confirmed 25% tariffs on imports from Mexico will be suspended for a month. Stocks bounced off their lows of the session as Wall Street bet on the implications the delay could have on the Trump administration’s broader trade strategy.",
      "But the market may still be too optimistic about how Trump's tariff agenda will unfold. Experts warn President Trump is \"unabashedly pro tariff” and investors may still be underpricing associated risks.",
      "Read more: The latest news and updates as Trump's tariff deadline approaches",
      "“There is an expectation on the Street that [Treasury Secretary] Scott Bessent is the one running the show … I disagree with that sentiment,” Henrietta Treyz of Veda Partners warned on Yahoo Finance's Catalysts this morning.",
      "And while Mexican tariffs may be delayed for now, Trump has yet to back down on plans to implement a 25% tariff on Canada and an additional 10% on China.",
      "“Tariffs are a negotiating tactic but I’m taking the China tariffs quite seriously,” Treyz added. “It’s a tax on US consumers … It's a very different scenario, very different environment than in 2018.”",
      "It's a risk to the market's valuation, argues Goldman Sachs' David Kostin. In a note to clients, Kostin wrote that rising policy uncertainty will likely weigh on equity valuation multiples, suggesting that the recent uncertainty increase should reduce the forward 12-month P/E multiple by about 3%.",
      "For investors, the Tech sector (XLK) is among the most exposed to risk from a geopolitical escalation between the US and China, as analysts warn of a \"pretty significant impact\" on demand for products.",
      "\"The bigger impact is really going to be the impact on end demand. If you think about products that are made in China, it's going to be PCs, smartphones, and consumer electronics,\" KeyBanc's John Vinh explained to me. \"As prices increase, we think there's probably going to be a negative impact to end demand, and ultimately that's going to flow upstream to all the chip companies.\"",
      "That signals greater downside risk for names like Qualcomm (QCOM), Qorvo (QRVO), Skyworks (SWKS), Intel (INTC), and Nvidia (NVDA), Vinh warns.",
      "Goldman Sachs' analysis of S&P 500 companies with explicit reported revenue exposure to Greater China of 25% or more includes many of those tech names, along with other consumer-facing firms. Among them are Las Vegas Sands (LVS), Wynn Resorts (WYNN), and Lam Research (LRCX), all of whose shares were under pressure as of midafternoon trading on Monday.",
      "Meanwhile, Evercore's Mark Mahaney sees Amazon (AMZN) as most at risk of Trump's tariff playbook, noting the White House's recent rhetoric toward its other largest trading partners.",
      "\"Amazon is most at risk ... to the extent that hurts manufacturers and retailers,\" Mahaney said.",
      "Given the uncertainty, Wall Street pros are advising investors proceed with caution.",
      "Ritholtz Wealth Management’s chief market strategist Callie Cox told me this morning that “sitting in a little bit more cash might make more sense,” while others advise investors look toward “evergreen themes.\"",
      "“The new economic regime is here with the February 1 tariff announcement,” Global X’s head of investment strategy Scott Helfstein wrote Monday. “Investors may want to look for ports in the geopolitical storm in areas like U.S. infrastructure, defense technology, and U.S. energy infrastructure.”",
      "Seana Smith is an anchor at Yahoo Finance. Follow Smith on X @SeanaNSmith. Tips on deals, mergers, activist situations, or anything else? Email seanasmith@yahooinc.com.",
      "Click here for in-depth analysis of the latest stock market news and events moving stock prices",
      "Read the latest financial and business news from Yahoo Finance"
    ],
    "url": "https://finance.yahoo.com/news/as-trumps-tariffs-add-risk-to-chips-and-consumer-stocks-investors-may-look-to-defensive-plays-194617006.html",
    "timestamp": "2025-02-03T19:46:17.000Z"
  },
  {
    "title": "AMD to report Q4 earnings as tariffs take hold, DeepSeek fears linger",
    "content": [
      "AMD (AMD) will report its fourth quarter earnings after the bell on Tuesday, just as President Trump’s 10% tariffs on goods made in China come into effect and a little over a week after China-based DeepSeek rocked the AI world.",
      "AMD shares have struggled throughout the last 12 months as the company has fought to gain ground in the AI data center space, falling 34% compared to rival Nvidia (NVDA), which has jumped 68%. Still, that’s better than archnemesis Intel (INTC), which has seen shares fall 53% in the same time period.",
      "AMD, along with the rest of the PC space, also continues to contend with slow sales despite the broader industry push toward AI PCs — computers that feature specialized processors designed to power AI tasks.",
      "For the quarter, Wall Street expects AMD to report earnings per share of $1.09 on revenue of $7.5 billion, according to Bloomberg consensus estimates. The company’s Data Center business, its largest segment by revenue, is expected to generate $4.09 billion for the quarter, up from $2.28 billion in the same period last year.",
      "AMD’s Client segment, which includes chips for PCs, is set to bring in $1.98 billion, versus the $1.36 billion it saw last year. Gaming will generate $487 million, a steep drop from the $1.36 billion the group brought in during Q4 2023.",
      "While Trump’s tariffs on Chinese-made goods won’t impact the majority of the high-end chip market, since many are manufactured in areas like Taiwan, the broader market for electronics, including servers and PCs, which are built in China, will be impacted.",
      "Read more: The latest news and updates as Trump's tariff deadline approaches",
      "If businesses and consumers are turned off by higher prices on those systems and devices, chip manufacturers like AMD could face slowing sales.",
      "Beyond the tariffs on Chinese goods, Trump has also raised the specter of tariffs specifically targeting semiconductors and products associated with them. Tariffs on chips could drive up prices for consumers and enterprises over a long stretch of time, as building chip manufacturing facilities is a complex task that requires careful planning.",
      "In addition to Trump’s tariffs, DeepSeek is expected to be on investors’ minds during AMD’s earnings call. The Chinese AI startup sent shockwaves through Wall Street last week as investors and analysts digested news that DeepSeek produced its own AI model that’s as capable as Silicon Valley’s leading-edge models for millions of dollars less.",
      "Investors dumped stocks in AI chipmakers including AMD, sending shares lower for the month, with Nvidia falling 19% and AMD dropping more than 9%.",
      "Email Daniel Howley at dhowley@yahoofinance.com. Follow him on Twitter at @DanielHowley.",
      "For the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here",
      "Read the latest financial and business news from Yahoo Finance"
    ],
    "url": "https://finance.yahoo.com/news/amd-to-report-q4-earnings-as-tariffs-take-hold-deepseek-fears-linger-184143763.html",
    "timestamp": "2025-02-03T18:41:43.000Z"
  },
  {
    "title": "Bill Gates: There's a possibility quantum computing will become useful in 3 to 5 years",
    "content": [
      "Listen and subscribe to Opening Bid on Apple Podcasts, Spotify, YouTube or wherever you find your favorite podcasts.",
      "Microsoft (MSFT) co-founder Bill Gates thinks useful quantum computing won't need decades to arrive.",
      "\"There is the possibility that he [Nvidia founder and CEO Jensen Huang] could be wrong. There is the possibility in the next three to five years that one of these techniques would get enough true logical Qubits to solve some very tough problems. And Microsoft is a competitor in that space,\" Gates said on Yahoo Finance's Opening Bid podcast (video above; listen below).",
      "Microsoft said in November 2024 that it was co-designing and building \"the world's most powerful quantum machine.\"",
      "It's expected to be released later this year.",
      "\"And I regularly review that work [at Microsoft]. And I'm quite impressed with it, but Jensen is correct, it could take longer. This is both in terms of how you build a quantum computer and what software you write that can solve problems that other computers couldn't write. There's some hard work to be done, and Microsoft has been in this field a long time, as well as Google and many, many, many players,\" Gates explained.",
      "Gates is on the other side of the quantum computing trade, it seems.",
      "Nvidia (NVDA) founder Jensen Huang kicked off the quantum controversy in January at the Consumer Electronics Show (CES).",
      "“If you said 15 years for very useful quantum computers, that would probably be on the early side,” Huang opined. “If you said 30, it’s probably on the late side. But if you picked 20, I think a whole bunch of us would believe it.”",
      "Watch: Google is a monopoly, warns founder of search competitor",
      "Huang is still bullish on Nvidia's role in developing quantum computing through its artificial intelligence chip technology.",
      "Then fellow tech billionaire and Huang's friend Meta (META) founder Mark Zuckerberg tossed cold water on quantum computing.",
      "Zuckerberg said on the Joe Rogan podcast he sees quantum's potential as still a \"decade-plus out.\"",
      "“I’m not really an expert on quantum computing — my understanding is that’s still quite a ways off from being a very useful paradigm,” Zuckerberg said.",
      "The downbeat commentary wreaked havoc on the red-hot quantum computing trade, which kicked off in early December when Google unveiled its high-power quantum chip, dubbed Willow.",
      "D-Wave Quantum (QBTS) and Rigetti Computing (RGTI) — the two main quantum trades being played by retail investors — are down 36% and 22.5%, respectively year to date.",
      "Rigetti's stock is up 992% in the past year, outperforming D-Wave's 552% advance.",
      "\"We are in the investment mode right now,\" Rigetti Computing CEO Subodh Kulkarni warned bullish investors on Yahoo Finance's Opening Bid podcast. \"We do have some sales, but that's mostly government contract kind of opportunities. Assuming the timeline I described earlier holds and we start seeing material sales opportunities three to five years from now, we certainly expect the company to start becoming cash flow break-even around that time period and beyond that, profitability will come along.\"",
      "Gates thinks it's easier to get a handle on the pace of AI development and how it will shape businesses moving forward.",
      "\"There's a great deal of uncertainty there [on quantum computing],\" Gates added. \"In the meantime, the AI stuff, that's improving at a very, very rapid rate. That, in a sense, is more predictable that over the same three to five years that will get extremely powerful.\"",
      "—",
      "Three times each week, I field insight-filled conversations and chats with the biggest names in business and markets on Opening Bid. You can find more episodes on our video hub or watch on your preferred streaming service.",
      "Brian Sozzi is Yahoo Finance's Executive Editor. Follow Sozzi on X @BrianSozzi and on LinkedIn. Tips on deals, mergers, activist situations, or anything else? Email brian.sozzi@yahoofinance.com.",
      "Click here for the latest technology news that will impact the stock market",
      "Read the latest financial and business news from Yahoo Finance"
    ],
    "url": "https://finance.yahoo.com/news/bill-gates-theres-a-possibility-quantum-computing-will-become-useful-in-3-to-5-years-152007398.html",
    "timestamp": "2025-02-03T15:20:07.000Z"
  },
  {
    "title": "NVIDIA Corporation (NVDA) Approves Samsung’s HBM3E Memory Chips for AI Processors, Competing with SK Hynix",
    "content": [
      "We recently compiled a list of the 10 Trending AI News and Ratings You Must Take a Look At. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against the other AI stocks.",
      "AI continues to evolve quite fast and it is influencing different sectors with its potential to transform business operations and improve efficiencies. As AI technology advances, there is a noticeable shift towards making its tools more accessible, especially for startups and smaller enterprises that can benefit from cost reductions in computing. While large businesses have already integrated AI into their operations with significant returns, the growing trend of AI adoption is driving a deeper focus on making the technology more affordable and scalable.",
      "Umesh Sachdev, Co-Founder and CEO of Uniphore shared his thoughts on the recent DeepSeek innovation and its impact on AI adoption in an interview with CNBC. He believes DeepSeek has brought a positive shift in reducing computing costs, which makes it easier for startups and consumer AI to integrate these technologies. However, he noted that for large enterprises, especially in industries like banking and telecom, the cost reduction has less of an impact since they had already seen high returns on their AI investments and weren’t waiting for lower costs to drive adoption.",
      "Sachdev also highlighted security concerns, especially regarding potential links to the Chinese government, which are a top issue for regulated American enterprises. Despite these concerns, he praised DeepSeek for open-sourcing its technology, making its claims about low-cost AI model development more credible.",
      "He further compared the current AI infrastructure developments to the early days of the internet and noted that just as the internet's growth was fueled by affordable mobile devices, AI adoption will similarly accelerate as the cost of computing continues to drop. Uniphore focuses on providing the application layer that enables enterprises to derive significant ROI from large AI models. CEOs are now looking to integrate AI across entire businesses by 2025, which marks a shift toward more widespread AI adoption.",
      "For this article, we selected AI stocks by reviewing news articles, stock analysis, and press releases. We listed the stocks in ascending order of their hedge fund sentiment taken from Insider Monkey’s database of 900 hedge funds.",
      "Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).",
      "A close-up of a colorful high-end graphics card being plugged in to a gaming computer.",
      "Number of Hedge Fund Holders: 193",
      "NVIDIA Corporation (NASDAQ:NVDA) creates AI platforms for data centers, autonomous vehicles, robotics, and cloud computing.",
      "As per a Bloomberg report from January 30, Nvidia (NASDAQ:NVDA) has approved Samsung’s 8-layer HBM3E memory chips for use in AI processors aimed at the Chinese market. While this marks progress for Samsung, it still lags behind SK Hynix, which remains Nvidia’s main supplier of the most advanced HBM technology. SK Hynix was the first to mass-produce both 8-layer and 12-layer HBM3E chips. Nvidia’s CEO acknowledged that Samsung needs to improve its design but expressed confidence in its efforts. As demand for high-bandwidth memory grows, both Samsung and SK Hynix are preparing to mass-produce HBM4 chips later this year, competing for Nvidia’s future supply needs.",
      "Overall NVDA ranks 3rd on our list of the trending AI stocks in news and ratings investors must take a look at. While we acknowledge the potential of NVDA as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than NVDA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.",
      "READ NEXT: 20 Best AI Stocks To Buy Now and Complete List of 59 AI Companies Under $2 Billion in Market Cap",
      "Disclosure: None. This article is originally published at Insider Monkey."
    ],
    "url": "https://finance.yahoo.com/news/nvidia-corporation-nvda-approves-samsung-042705686.html",
    "timestamp": "2025-02-04T04:27:05.000Z"
  },
  {
    "title": "The Best Stock to Invest in With $500",
    "content": [
      "The question of which stock each person should invest in depends on factors such as income, risk tolerance, goals, investment horizon, etc., all of which differ from one investor to the next. That's why it's always hard to come up with a single \"best\" stock to buy with any amount of money, but let's give it a shot anyway. With $500, long-term investors (other than income-seekers) can hardly do better than Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B), whose Class B shares are trading for just under $469 as of this writing. Here's why.",
      "Some of the most popular stocks on the market can be had for less than $500. Nvidia, the high-flying chipmaker that is cashing in more than any other corporation on the rise of artificial intelligence (AI), is trading for just $121 apiece. However, recent events out of China, where a company called DeepSeek developed an AI chatbot for pennies on the dollar compared to well-established leaders in the field, threaten Nvidia's prospects. The chipmaker might overcome this headwind just fine, but this episode highlights Nvidia's reliance on AI. In other words, Nvidia's business is not well diversified.",
      "While some leading corporations on the market are more diversified than Nvidia, few can match Berkshire Hathaway's level of diversification. Berkshire Hathaway is a conglomerate with more than 60 companies under its umbrella. These businesses span many industries, including insurance -- which occupies a prominent role in Berkshire Hathaway's empire -- furniture, railroad, fast food, clothing, battery manufacturing, energy, utilities, brick manufacturing, private aviation, and more.",
      "Though many of these businesses don't meaningfully impact the company's earnings, there is more. Berkshire Hathaway owns a portfolio of stocks spanning many industries and sectors. The company makes a substantial amount of money from gains from its investments. Between its portfolio of publicly traded companies and the private businesses it owns, Berkshire Hathaway is like a tiny economy. Some of its subsidiaries will occasionally struggle while others are doing fine and vice versa. That's the power of diversification.",
      "And even though entire economies experience downturns, Berkshire Hathaway's presence in industries such as insurance and utilities, which tend to perform better than most sectors during recessions, can keep it afloat, at least somewhat. So, Berkshire Hathaway isn't a particularly risky or volatile company.",
      "Perhaps the most critical factor in a company's success is its leadership team. Those who invest in Berkshire Hathaway would be putting their money into a corporation led by Warren Buffett, the man considered the greatest investor of all time. Since taking control of Berkshire Hathaway in the mid-'60s, the Oracle of Omaha has delivered market-beating returns to its shareholders. It's hard to overstate how difficult it is to do so for such a long time.",
      "Buffett would undoubtedly be a strong candidate for the No. 1 pick if there were a Wall Street CEO draft. Some might point out that the Oracle of Omaha is well into his 90s. His longtime partner, Charlie Munger, died in late 2023. Buffett might not be around for much longer, but a CEO that shrewd would have made sure to create a culture and pick a team of leaders who can thrive after him. That's what Buffett did, having chosen Greg Abel, CEO of Hathaway Energy, to take the helm once he's gone. The company won't be doomed once Buffett is no longer its CEO.",
      "Berkshire Hathaway isn't a leader in AI, the weight loss medicines market, or any other popular investing themes on Wall Street. However, the company has a strategy that has worked for decades, a vast number of businesses and stocks under its umbrella, and an excellent leadership team that knows how to increase shareholder value. For all those reasons, Berkshire Hathaway is one of the best stocks investors can buy with $500.",
      "Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.",
      "On rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:",
      "Nvidia: if you invested $1,000 when we doubled down in 2009, you’d have $311,343!*",
      "Apple: if you invested $1,000 when we doubled down in 2008, you’d have $44,694!*",
      "Netflix: if you invested $1,000 when we doubled down in 2004, you’d have $526,758!*",
      "Right now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon.",
      "Learn more »",
      "*Stock Advisor returns as of February 3, 2025",
      "Prosper Junior Bakiny has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway and Nvidia. The Motley Fool has a disclosure policy.",
      "The Best Stock to Invest in With $500 was originally published by The Motley Fool"
    ],
    "url": "https://finance.yahoo.com/news/best-stock-invest-500-024400206.html",
    "timestamp": "2025-02-04T02:44:00.000Z"
  },
  {
    "title": "Nvidia Calls China's DeepSeek an \"Excellent AI Advancement\": Should Investors Press the Buy Button?",
    "content": [
      "One might think that artificial intelligence (AI) chip king Nvidia (NASDAQ: NVDA) might not be so pleased with the Chinese company DeepSeek, considering that news of DeepSeek's achievement in the AI space led to an intense single-day sell-off that erased roughly $600 billion of Nvidia's market cap on Jan. 27.",
      "However, Nvidia -- along with analysts and investors -- has taken a more constructive view, arguing that DeepSeek's ability to design an AI chatbot comparable to OpenAi's ChatGPT should be lauded, and that its may represent an opportunity for the entire AI market. With that in mind, should investors buy the dip on Nvidia?",
      "When DeepSeek surged into the public consciousness, the market initially responded by selling off Nvidia because the Chinese start-up claimed to have created a chatbot similar to ChatGPT at a fraction of the cost.",
      "Th Chinese company says it spent only $5.6 million to train its large language model, and used less powerful graphics processing units (GPUs) that are compliant with U.S. export restrictions. The U.S. has banned companies like Nvidia from selling some of their most advanced chips to China due to concerns about how that country might use their capabilities.",
      "Part of the investment thesis for Nvidia lately has been that it has an enormous competitive moat, thanks to its cutting-edge GPUs and its CUDA platform.",
      "Its high gross profit margins -- in the 74% to 79% range last year -- support this premise, showing that it has near-complete control of the AI chip market and its own pricing power. But all this could be threatened if a company with fewer than 200 employees spent less than $10 million and used old Nvidia chips to replicate the current state of the art in AI software.",
      "Many doubt that the cost of DeepSeek's chatbot was only $5.6 million, and have questioned what inputs actually went into its design. That's why it was interesting to see Nvidia's commentary about DeepSeek. An Nvidia spokesperson praised it as \"an excellent AI advancement\" that illustrates how new models can be created \"leveraging widely available models and compute that is fully export control compliant.\"",
      "The company also said that DeepSeek shows that Nvidia's chips are useful in China, a material revenue driver for the company, and that this market will need more of its chips to meet demand.",
      "Analysts largely refuted the idea that DeepSeek's rise could mean the end of Nvidia. Most actually see it as an opportunity for the broader AI trend. Daniel Newman, chief strategist at global tech researcher The Futurum Group, called the sell-off an overreaction: \"If we can use compute more efficiently ... the companies that we're saying aren't driving enough revenue will be able to build their models cheaper. They'll be able to create solutions with less overhead expense, and they're going to drive more [earnings per share].\"",
      "Although companies like Meta Platforms have pledged to spend tens of billions on AI infrastructure, they could also likely benefit if it turns out that some of this spending is not necessary, although that would open the door for competitors as well.",
      "Do I think Nvidia is done for? Absolutely not. Companies like Nvidia with tons of resources tend to find ways to not only survive but also get ahead of competitors.",
      "If DeepSeek does make AI software more widespread, that could drive more uses and boost demand for Nvidia's chips. Following the big sell-off on Jan. 27 and a mild rebound on Jan. 28, the company's forward price-to-earnings ratio (P/E) stood slightly above its five-year average.",
      "My issue with Nvidia and its \"Magnificent Seven\" cohort is that they are still trading at high multiples in a bull market that has lasted for more than two years. There is still a lot we don't know about AI and how widespread it will actually become.",
      "If anything, the arrival of DeepSeek demonstrates how early we still are in the AI game. Similar events also happened in the dot-com bubble. That was followed by a steep pullback among internet stocks that had run too high too quickly -- but eventually, the internet ultimately changed everything.",
      "If you plan to hold the stock for 10 to 20 years, then you can definitely buy Nvidia now. However, I think it could be a bumpy ride in the near term.",
      "Before you buy stock in Nvidia, consider this:",
      "The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.",
      "Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $735,852!*",
      "Now, it’s worth noting Stock Advisor’s total average return is 903% — a market-crushing outperformance compared to 176% for the S&P 500. Don’t miss out on the latest top 10 list.",
      "Learn more »",
      "*Stock Advisor returns as of February 3, 2025",
      "Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Bram Berkowitz has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Meta Platforms and Nvidia. The Motley Fool has a disclosure policy.",
      "Nvidia Calls China's DeepSeek an \"Excellent AI Advancement\": Should Investors Press the Buy Button? was originally published by The Motley Fool"
    ],
    "url": "https://finance.yahoo.com/news/nvidia-calls-chinas-deepseek-excellent-020300716.html",
    "timestamp": "2025-02-04T02:03:00.000Z"
  },
  {
    "title": "Why Did Apple and Meta Platforms Rise While Nvidia Fell 17% in 1 Day?",
    "content": [
      "Jan. 27 was a wild day in the stock market as investors reacted to Chinese start-up DeepSeek's R1 \"reasoning\" model that competes with OpenAI's o1 model.",
      "Semiconductor stocks Nvidia (NASDAQ: NVDA), Broadcom, and Taiwan Semiconductor Manufacturing -- which constitute over $5 trillion in combined market cap -- fell between 13% and 17% in a single session.",
      "But outside of chip stocks and some artificial intelligence (AI)-focused companies, the rest of the market largely held up. In fact, Apple (NASDAQ: AAPL) jumped 3%. And Meta Platforms (NASDAQ: META), which is one of the largest investors in AI, gained 2%.",
      "Here's a look at how markets are reacting to DeepSeek's impact on AI and why Meta Platforms stands out as a top AI stock to buy now.",
      "Reports indicate that DeepSeek was able to build its model at a far lower cost than OpenAI's solution, which led to fears of slowing demand for AI infrastructure like Nvidia graphics processing units (GPUs) or Broadcom's application-specific integrated circuits. The news marks a potential step change in the way AI investments are viewed.",
      "The Donald Trump-backed $500 billion Stargate AI project is tasked with building out data centers to support AI workflows. Microsoft is on track to spend around $80 billion on AI in fiscal 2025. If highly sophisticated AI tools can be built fairly inexpensively, more scrutiny may be warranted on AI spending. And investors won't applaud a company just because it is throwing money at AI.",
      "However, a subsequent 9% rebound in Nvidia the following day on Jan. 28 came as some investors and analysts viewed efficiency improvements as a net positive, arguing that overall compute demand could increase if AI became more affordable for smaller companies.",
      "A similar comparison would be the price of an iPhone over time. When the iPhone first came out in 2007, it cost $499 for the 4 GB version and $599 for the 8 GB model. Inflation-adjusted, that cost is closer to $780 for the 4 GB and $930 for the 8 GB. But the new iPhone 16 starts at just $799, so the cost of an iPhone has stayed about the same since its release despite product innovation and exponential storage increases. Rather, Apple has grown by several folds since then, both in terms of earnings and the stock price, because the iPhone became a consumer staple and Apple expanded its ecosystem across accessories and services. The same could occur with Nvidia. If the market for its products grows, Nvidia won't need to rely so much on pricing power, which could benefit the company long-term.",
      "As of market close on Jan. 24, Apple was the worst-performing component of the Dow Jones Industrial Average year to date. So a rebound in Apple, which may be viewed as less of a pure AI play than companies like Nvidia, makes some sense. But what may come as a surprise is Meta, which blasted to a new all-time high on Tuesday.",
      "In October, I predicted that Meta would be worth more than Alphabet and Amazon by 2026, which I still think will happen.",
      "Meta is one of the clearest examples of AI fueling rapid growth and margin expansion. AI is instrumental in Meta's algorithms for delivering engaging content to users so they stay on the platform longer and, therefore, see more ads. Meta AI is also helpful for creators to customize content, engage with their audiences, and more.",
      "So although Meta is spending a substantial amount of money on research and development (R&D), it is still growing its revenue and operating income at a breakneck pace. Meta has operating margins around 40%, even considering around 27 cents for every dollar in revenue goes toward R&D.",
      "The results are even more impressive once factoring in steep (and growing) losses from Meta's Reality Labs division, which makes hardware and metaverse software, and invests in AI.",
      "Meta has a price-to-earnings (P/E) ratio of just 31.8 and a forward P/E of 26.5, which is a reasonable valuation for a high-octane growth stock. But again, the valuation is even more attractive once considering Reality Labs' impact on earnings.",
      "In the first three quarters of 2024, Meta lost $12.76 billion on Reality Labs and reported net income of $41.52 billion. So if you take out Reality Labs, the amount that investors are paying for the rest of Meta (the advertising business) is actually dirt cheap.",
      "The sell-off in Nvidia is a painful reminder of the importance of knowing what you own and why you own it, and aligning your investments with your risk tolerance.",
      "Nvidia is a phenomenal, highly innovative company. But its value is also based on continued rapid earnings growth. Meta isn't expected to grow earnings as quickly as Nvidia and is a better value.",
      "Still, Nvidia could be worth owning if you have a high risk tolerance and believe in the long-term investment thesis. But the stock could continue to be highly volatile while investors re-evaluate Nvidia's role in the future of AI.",
      "Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.",
      "On rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:",
      "Nvidia: if you invested $1,000 when we doubled down in 2009, you’d have $311,343!*",
      "Apple: if you invested $1,000 when we doubled down in 2008, you’d have $44,694!*",
      "Netflix: if you invested $1,000 when we doubled down in 2004, you’d have $526,758!*",
      "Right now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon.",
      "Learn more »",
      "*Stock Advisor returns as of February 3, 2025",
      "Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool’s board of directors. Daniel Foelber has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom and recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.",
      "Why Did Apple and Meta Platforms Rise While Nvidia Fell 17% in 1 Day? was originally published by The Motley Fool"
    ],
    "url": "https://finance.yahoo.com/news/why-did-apple-meta-platforms-010000706.html",
    "timestamp": "2025-02-04T01:00:00.000Z"
  },
  {
    "title": "Dan Ives Just Called DeepSeek the \"Temu of AI.\" Here's What That Means, and Why I Think He's Right.",
    "content": [
      "For the last couple of days, it's been nearly impossible to tune into financial news programming and not hear about Chinese artificial intelligence (AI) start-up DeepSeek.",
      "While reporting on the DeepSeek story is fluid, initial claims from the company are that engineers built the AI model using Nvidia (NASDAQ: NVDA) A100 and H800 graphics processing units (GPUs). These are Nvidia's older and allegedly less capable chipsets. Given the impressive feats demonstrated by DeepSeek so far, some investors have turned bearish overnight, calling into question the necessity of Nvidia's next-generation and more sophisticated architectures.",
      "One voice of reason I tend to follow closely on Wall Street is technology analyst Dan Ives of Wedbush Securities. Recently, Ives posted on social media that DeepSeek is the \"Temu of AI\" -- a nod to Chinese e-commerce marketplace Temu.",
      "Comparing DeepSeek to Temu just because they are both products from China isn't the point Ives is making. Below, I'll explore his commentary and explain why I think he's making an apt comparison.",
      "Temu is owned by Chinese e-commerce business PDD Holdings. When it first launched in late 2022, some Wall Street skeptics began declaring the low-cost marketplace an existential threat to Amazon.",
      "The table below shows Amazon's online sales growth over the last couple of years:",
      "Category",
      "2022",
      "2023",
      "Online sales revenue ($)",
      "$217.4 billion",
      "$231.9 billion",
      "Online sales % growth year over year",
      "(2%)",
      "7%",
      "Data source: Investor Relations.",
      "While Amazon's e-commerce sales witnessed a nominal decline in 2022, this was not because of Temu. Remember, 2022 was when inflation peaked around 9%, and the Federal Reserve was amid aggressive interest rate hikes.",
      "The combination of historically high levels of inflation and rising borrowing costs served as a one-two punch to purchasing power for the average consumer. Amazon's e-commerce business experienced a resilient comeback in 2023, and published results for 2024 have been encouraging -- the company's online sales are up 6% year over year through September.",
      "My interpretation of Ives' words is that DeepSeek does not represent a doomsday situation for existing (and expensive) models from OpenAI, Perplexity, or Anthropic, among others -- just as Temu hasn't destroyed Amazon's e-commerce dominance.",
      "I often encourage investors to zoom out and consider the big picture whenever a new megatrend or breaking story is developing. In the case of Temu and Amazon, consider the idea that the addressable market for e-commerce is expanding.",
      "According to Grand View Research, the global market size for e-commerce was estimated to be worth $25.9 trillion in 2023 and forecasted to grow at a compound annual growth rate (CAGR) of 19% between 2024 and 2030. Given the rapid expansion of e-commerce adoption, it's natural that new entrants, such as Temu, would emerge. In other words, there is more than enough room for multiple competitors.",
      "On top of that, I'd argue that one of the key reasons Amazon is still able to generate meaningful growth from its online business despite its massive scale is the sticky nature of the company's ecosystem. Amazon offers far more than online shopping. The company provides grocery delivery, streaming and entertainment, and much more through its Prime subscription model. This is actually quite lucrative as Amazon has unlocked multiple streams to generate revenue from its customer base, keeping them fiercely loyal in the process.",
      "I think these same dynamics can be said about AI. Like e-commerce, AI is a growing market with a multitude of applications across both hardware and software. Moreover, Nvidia has also identified multiple ways to generate value from its enterprise customers -- selling them GPU hardware and accompanying software, known as compute unified device architecture (CUDA).",
      "To me, the introduction of DeepSeek really proves only one thing: There's room for more than one large language model (LLM) in the AI arena. Even if DeepSeek is as capable or superior to existing infrastructure, I think it's highly unlikely that developers and large enterprises will transition their AI workloads off of OpenAI and other legacy LLMs and begin adopting DeepSeek. Such an idea is much easier said than done, and it would be a costly endeavor to essentially ditch your existing framework in lieu of something else.",
      "At the end of the day, I do not think DeepSeek is an existential threat to ChatGPT, Nvidia, or any other hyperscaler pushing the AI narrative forward.",
      "Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.",
      "On rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:",
      "Nvidia: if you invested $1,000 when we doubled down in 2009, you’d have $311,343!*",
      "Apple: if you invested $1,000 when we doubled down in 2008, you’d have $44,694!*",
      "Netflix: if you invested $1,000 when we doubled down in 2004, you’d have $526,758!*",
      "Right now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon.",
      "Learn more »",
      "*Stock Advisor returns as of February 3, 2025",
      "John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Adam Spatacco has positions in Amazon and Nvidia. The Motley Fool has positions in and recommends Amazon and Nvidia. The Motley Fool has a disclosure policy.",
      "Dan Ives Just Called DeepSeek the \"Temu of AI.\" Here's What That Means, and Why I Think He's Right. was originally published by The Motley Fool"
    ],
    "url": "https://finance.yahoo.com/news/dan-ives-just-called-deepseek-230000016.html",
    "timestamp": "2025-02-03T23:00:00.000Z"
  },
  {
    "title": "These Stocks Moved the Most Today: Tesla, GM, Nvidia, Constellation Brands, Idexx, Palantir, and More",
    "content": [
      "Electric-vehicle maker Tesla and traditional auto manufacturers General Motors and Ford fall but claw back losses with the U.S. delaying tariffs on Mexico for a month."
    ],
    "url": "https://finance.yahoo.com/m/c61e8b88-db46-3fa7-8bdd-b9338bf63336/these-stocks-moved-the-most.html",
    "timestamp": "2025-02-03T22:11:00.000Z"
  }
]