[
  {
    "title": "Palantir's commercial sales 'momentum' may continue in 2025",
    "content": [
      "Palantir (PLTR) stock soars during Monday's extended-hours trading after the company reported fourth quarter earnings that beat on the top and bottom lines and delivered stronger-than-expected guidance for the upcoming quarter and full year.",
      "Third Bridge senior analyst Jordan Berger joins Market Domination Overtime with Julie Hyman and Josh Lipton to share his reaction to Palantir's results.",
      "Berger highlights the company's shift to commercial offerings, expanding beyond their government contracts. \"Their pivot to commercial has been a long time coming, and we really saw that come to a head one year ago,\" he says. \"Are they going to maintain that same type of momentum? And I think with this initial release, we see the answer is yes; they're continuing with that momentum into the next year.\"",
      "\"They've been hyper-focused on moving into the commercial market and making it easier to sell this historically very challenging product to sell in these shorter-term time frames, and it seems that we've been seeing that pay off,\" Berger adds. \"And now, really, all eyes will be on how those new lands really start to expand into those massive 7- and 8-figure deals that they're so well known for.\"",
      "Watch the video above to hear more from the analyst about Palantir's competition, artificial intelligence (AI) opportunities, and the impact of Trump 2.0 and Elon Musk's Department of Government Efficiency (DOGE).",
      "To watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime here.",
      "This post was written by Naomi Buchanan."
    ],
    "url": "https://finance.yahoo.com/video/palantirs-commercial-sales-momentum-may-215229973.html",
    "timestamp": "2025-02-03T21:52:29.000Z"
  },
  {
    "title": "Palantir Stock Soars 23% as Artificial Intelligence (AI) Demand Drives 75% Earnings Growth",
    "content": [
      "Palantir Technologies (NASDAQ: PLTR) stock is skyrocketing in after-hours trading on Monday following the artificial intelligence (AI)-powered software platforms operator's release of better-than-expected fourth-quarter results and 2025 guidance. The stock is up 22.6% as of this writing at 7:34 p.m. ET.",
      "Along with the better-than-expected Q4 revenue and earnings and 2025 guidance, there was likely another catalyst for investors sending Palantir stock soaring: In Q4, U.S. commercial revenue growth was a powerful 64% year over year. The company's early heavy dependence on government spending had concerned some investors.",
      "Palantir's release of its newest platform, AIP [artificial intelligence platform], in mid-2023 has revved up its financial results. And the AI revolution is still in its earliest stages, which is great news for the company and its investors.",
      "Metric",
      "Q4 2023",
      "Q4 2024",
      "Change*",
      "Revenue",
      "$608 million",
      "$828 million",
      "36%",
      "GAAP operating income",
      "$66 million",
      "$11 million",
      "(83%)",
      "Adjusted operating income",
      "$209 million",
      "$373 million",
      "78%",
      "GAAP net income",
      "$93 million",
      "$79 million",
      "(15%)",
      "Adjusted net income",
      "$190 million",
      "$342 million",
      "80%",
      "GAAP earnings per share (EPS)",
      "$0.04",
      "$0.03",
      "(25%)",
      "Adjusted EPS",
      "$0.08",
      "$0.14",
      "75%",
      "Data source: Palantir Technologies. GAAP = generally accepted accounting principles. Calculations by author except for revenue growth, which was provided by Palantir.",
      "Investors shouldn't be concerned that GAAP figures declined year over year. This was driven by the stock appreciation rights (SARs) expense, which a company incurs when employees exercise their SARs. Excluding the SARs expense, GAAP operating income, net income, and EPS are $142 million, $165 million, and $0.07, respectively.",
      "Investors should focus on the adjusted numbers, which exclude one-time items.",
      "Wall Street was looking for adjusted EPS of $0.11 on revenue of $781.2 million, so Palantir sprinted by both expectations, with the profit beat particularly impressive. It also exceeded its own guidance, which was for revenue between $767 million to $771 million. The company doesn't issue earnings guidance.",
      "Palantir generated cash of $460 million from running its operations during the quarter, up 53% from the year-ago period. Its adjusted free cash flow was $517 million, up 70% year over year. The company ended the quarter with cash, cash equivalents, and short-term investments of $5.2 billion, up 44% from the year-ago period. It has no long-term debt.",
      "All percentage growth figures are year over year.",
      "Commercial revenue grew 31% to $372 million, accounting for 45% of total revenue.",
      "Government revenue grew 40% to $455 million, or 55% of total revenue.",
      "By region, U.S. revenue grew 52% to $558 million, accounting for 67% of total revenue. (Non-U.S. revenue accounted for the other 33% of revenue.)",
      "Total customer count increased 43%.",
      "The company closed 129 deals over $1 million, 58 deals of at least $5 million, and 32 deals of at least $10 million.",
      "U.S. commercial revenue jumped 64% to $214 million.",
      "U.S. commercial customer count surged 73%.",
      "U.S. commercial total contract value (TCV) deals closed jumped 134% to $803 million.",
      "U.S. commercial remaining deal value soared 99% to $1.79 billion.",
      "U.S. government revenue grew 45% to $343 million. This market began with defense and intelligence agencies but now also includes other agencies.",
      "Here's a snippet from CEO Alex Karp's shareholder letter:",
      "Q1 guidance:",
      "Revenue of $858 million to $862 million. This equates to growth of 35% to 36% year over year.",
      "Adjusted income from operations of $354 million to $358 million. This equates to growth of 56% to 58% year over year.",
      "Going into the release, Wall Street had been modeling for Q1 revenue of $799.4 million, or 26% growth, so Palantir's guidance crushed this expectation.",
      "Annual guidance:",
      "Metric",
      "2025 Guidance",
      "Wall Street Estimate",
      "Change Implied by Guidance* YOY",
      "Total revenue",
      "$3.741 billion to $3.757 billion",
      "$3.53 billion",
      "31%",
      "U.S. commercial revenue",
      "Greater than $1.079 billion",
      "N/A",
      "At least 54%",
      "Adjusted operating income",
      "$1.551 billion to $1.567 billion",
      "N/A",
      "38% to 39%",
      "Adjusted free cash flow",
      "$1.5 billion to $1.7 billion",
      "N/A",
      "20% to 36%",
      "GAAP operating income and GAAP net income",
      "Both positive in each quarter",
      "N/A",
      "--",
      "Data source: Palantir Technologies. YOY = year over year. *Calculations by author except for U.S. commercial revenue growth guidance, which Palantir provided.",
      "This 2025 guidance is fantastic. Investors should remember it's generally standard practice for companies to issue somewhat conservative initial annual guidance because a lot can happen with the economy in nearly a year. In other words, the above outlook is probably conservative.",
      "Palantir's Q4 2024 results and 2025 guidance are astounding.",
      "As I wrote in Nov. 2024, Palantir stock has what it takes to be the \"next Nvidia stock\" -- that is, a massive long-term winner.",
      "Ever feel like you missed the boat in buying the most successful stocks? Then you’ll want to hear this.",
      "On rare occasions, our expert team of analysts issues a “Double Down” stock recommendation for companies that they think are about to pop. If you’re worried you’ve already missed your chance to invest, now is the best time to buy before it’s too late. And the numbers speak for themselves:",
      "Nvidia: if you invested $1,000 when we doubled down in 2009, you’d have $311,343!*",
      "Apple: if you invested $1,000 when we doubled down in 2008, you’d have $44,694!*",
      "Netflix: if you invested $1,000 when we doubled down in 2004, you’d have $526,758!*",
      "Right now, we’re issuing “Double Down” alerts for three incredible companies, and there may not be another chance like this anytime soon.",
      "Learn more »",
      "*Stock Advisor returns as of February 3, 2025",
      "Beth McKenna has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Palantir Technologies. The Motley Fool has a disclosure policy.",
      "Palantir Stock Soars 23% as Artificial Intelligence (AI) Demand Drives 75% Earnings Growth was originally published by The Motley Fool"
    ],
    "url": "https://finance.yahoo.com/news/palantir-stock-soars-23-artificial-013000523.html",
    "timestamp": "2025-02-04T01:30:00.000Z"
  },
  {
    "title": "Palantir Surges on Outlook Fueled by ‘Untamed’ AI Demand",
    "content": [
      "(Bloomberg) -- Palantir Technologies Inc. shares jumped after giving a full-year revenue forecast that exceeded analysts’ estimates, thanks to what Chief Executive Officer Alex Karp described as “untamed organic growth” in demand for its artificial intelligence software.",
      "Most Read from Bloomberg",
      "New York’s First ‘Passive House’ School Is a Model of Downtown Density",
      "When French Communists Went on a Brutalist Building Boom",
      "State Farm Seeks Emergency California Rate Hike After LA Fires",
      "Trump Paves the Way to Deputize Local Police on Immigration",
      "How the 2025 Catholic Jubilee Is Reshaping Rome",
      "Sales will be about $3.75 billion in 2025, the Denver-based company said Monday in a statement. Adjusted operating income will be about $1.56 billion. Analysts, on average, projected revenue of $3.54 billion and operating profit of $1.37 billion.",
      "Best known for its national security work, and more recently its AI platform, Palantir’s stock surged 340% in 2024. The company rode a wave of investor excitement for AI, and more commercial and government customers started using Palantir’s data analysis software.",
      "Fourth-quarter revenue jumped 36% to $827.5 million, compared with analysts’ average estimate of $775.9 million. Profit, excluding some items, was 14 cents a share. Analysts, on average, estimated 11 cents.",
      "The shares gained more than 23% in extended trading after closing at a record $83.74 in New York.",
      "As the company deepens its connection with the US Defense Department, sales to the US government jumped 45% to $343 million. US commercial revenue gained 64% to $214 million in the period ended Dec. 31.",
      "On a conference call after the results, Palantir Chief Technology Officer Shyam Sankar was asked about the potential effects of US President Donald Trump’s efforts to cut the federal government’s budget led by the Elon Musk-run Department of Government Efficiency.",
      "“Palantir’s real competition is a lack of accountability in government,” Sankar said. “DOGE is going to bring meritocracy and transparency to government” and prompt it to function more like the commercial market.",
      "Palantir projected US commercial sales in 2025 will rise about 54% to $1.08 billion.",
      "Karp, in a letter to shareholders, said Palantir is in “a new phase” and warned against the “technical complacency” of other US companies failing to step up and serve US interests.",
      "“We love disruption,” Karp said on the call. “Disruption at the end-of-the day exposes things that aren’t working, there’ll be ups and down. There’s a revolution. Some people get their heads cut off.”",
      "The company’s technology is now used across all US military branches, and by American allies in Ukraine and Israel. Palantir also recently expanded one of its deals with the US Army to as much as $619 million through 2028, and extended its AI work with the US Special Operations Command.",
      "As Silicon Valley embraces defense tech firms, Palantir has broadened its work with other tech companies. It tightened an existing partnership with weapons maker Anduril Industries Inc. and struck a new relationship with AI startup Anthropic to bring its large language models to US intelligence and defense operations. The moves represent the beginning of what Palantir executives envision as America’s new defense ecosystem led by software-first companies — not traditional defense companies.",
      "After Trump’s election, investors showed enthusiasm for Palantir stock and the company’s promise to bolster US defense and manufacturing. Sankar in October published what he described as a blueprint for the resurrection of the American industrial base and has often appeared before US Congress to testify in favor of defense innovation and acquisition reform.",
      "“We have to realize that the AI race is winner-take-all and it’s going to be a whole of nation effort that extends well beyond the DoD in order for us as a nation to win,” Sankar said on the call.",
      "Citing the late political scientist Samuel Huntington, Karp wrote that “the rise of the West was not made possible ‘by the superiority of its ideas or values or religion, but rather by its superiority in applying organized violence.’”",
      "(Updates with comments from executives on the conference call beginning in the seventh paragraph.)",
      "Most Read from Bloomberg Businessweek",
      "Elon Musk Inside the Treasury Department Payment System",
      "The Internet Almost Killed Barnes & Noble, Then Saved It",
      "Indy Pass, the Anti-Vail Seasonal Ski Ticket, Is Gaining Fans",
      "What America’s Tech Billionaires Really Bought When They Backed Donald Trump",
      "Musk Pitches New Narrative as Tesla Sales Fall",
      "©2025 Bloomberg L.P."
    ],
    "url": "https://finance.yahoo.com/news/palantir-gives-strong-2025-outlook-210630313.html",
    "timestamp": "2025-02-03T23:46:23.000Z"
  },
  {
    "title": "Palantir Earnings Demolish Expectations on AI Growth. The Stock Is Zooming.",
    "content": [
      "Palantir Technologies posted a big beat with its fourth-quarter results on Monday afternoon. Earnings per share were up annually by 75% to 14 cents, compared with Wall Street’s consensus estimate of 11 cents, according to FactSet. Commercial revenue grew by 31% to $372 million from 2023, and government revenue grew by 40% to $455 million."
    ],
    "url": "https://finance.yahoo.com/m/414b3d35-4b95-3677-a92e-37ecaf311d65/palantir-earnings-demolish.html",
    "timestamp": "2025-02-03T23:33:00.000Z"
  },
  {
    "title": "Palantir Technologies Inc. (PLTR) Beats Q4 Earnings and Revenue Estimates",
    "content": [
      "Palantir Technologies Inc. (PLTR) came out with quarterly earnings of $0.14 per share, beating the Zacks Consensus Estimate of $0.11 per share. This compares to earnings of $0.08 per share a year ago. These figures are adjusted for non-recurring items.",
      "This quarterly report represents an earnings surprise of 27.27%. A quarter ago, it was expected that this company would post earnings of $0.09 per share when it actually produced earnings of $0.10, delivering a surprise of 11.11%.",
      "Over the last four quarters, the company has surpassed consensus EPS estimates three times.",
      "Palantir Technologies , which belongs to the Zacks Technology Services industry, posted revenues of $827.52 million for the quarter ended December 2024, surpassing the Zacks Consensus Estimate by 6.44%. This compares to year-ago revenues of $608.35 million. The company has topped consensus revenue estimates four times over the last four quarters.",
      "The sustainability of the stock's immediate price movement based on the recently-released numbers and future earnings expectations will mostly depend on management's commentary on the earnings call.",
      "Palantir Technologies shares have added about 9.1% since the beginning of the year versus the S&P 500's gain of 2.7%.",
      "While Palantir Technologies has outperformed the market so far this year, the question that comes to investors' minds is: what's next for the stock?",
      "There are no easy answers to this key question, but one reliable measure that can help investors address this is the company's earnings outlook. Not only does this include current consensus earnings expectations for the coming quarter(s), but also how these expectations have changed lately.",
      "Empirical research shows a strong correlation between near-term stock movements and trends in earnings estimate revisions. Investors can track such revisions by themselves or rely on a tried-and-tested rating tool like the Zacks Rank, which has an impressive track record of harnessing the power of earnings estimate revisions.",
      "Ahead of this earnings release, the estimate revisions trend for Palantir Technologies: favorable. While the magnitude and direction of estimate revisions could change following the company's just-released earnings report, the current status translates into a Zacks Rank #2 (Buy) for the stock. So, the shares are expected to outperform the market in the near future. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.",
      "It will be interesting to see how estimates for the coming quarters and current fiscal year change in the days ahead. The current consensus EPS estimate is $0.11 on $797.85 million in revenues for the coming quarter and $0.48 on $3.54 billion in revenues for the current fiscal year.",
      "Investors should be mindful of the fact that the outlook for the industry can have a material impact on the performance of the stock as well. In terms of the Zacks Industry Rank, Technology Services is currently in the top 35% of the 250 plus Zacks industries. Our research shows that the top 50% of the Zacks-ranked industries outperform the bottom 50% by a factor of more than 2 to 1.",
      "Viant Technology (DSP), another stock in the same industry, has yet to report results for the quarter ended December 2024.",
      "This advertising software company is expected to post quarterly earnings of $0.23 per share in its upcoming report, which represents a year-over-year change of +64.3%. The consensus EPS estimate for the quarter has remained unchanged over the last 30 days.",
      "Viant Technology's revenues are expected to be $52.3 million, up 22.8% from the year-ago quarter.",
      "Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report",
      "Palantir Technologies Inc. (PLTR) : Free Stock Analysis Report",
      "Viant Technology Inc. (DSP) : Free Stock Analysis Report",
      "To read this article on Zacks.com click here.",
      "Zacks Investment Research"
    ],
    "url": "https://finance.yahoo.com/news/palantir-technologies-inc-pltr-beats-232522426.html",
    "timestamp": "2025-02-03T23:25:22.000Z"
  },
  {
    "title": "These Stocks Moved the Most Today: Tesla, GM, Nvidia, Constellation Brands, Idexx, Palantir, and More",
    "content": [
      "Electric-vehicle maker Tesla and traditional auto manufacturers General Motors and Ford fall but claw back losses with the U.S. delaying tariffs on Mexico for a month."
    ],
    "url": "https://finance.yahoo.com/m/c61e8b88-db46-3fa7-8bdd-b9338bf63336/these-stocks-moved-the-most.html",
    "timestamp": "2025-02-03T22:11:00.000Z"
  },
  {
    "title": "Palantir Earnings Top Estimates. Full Year 2025 Revenue Guidance Beats.",
    "content": [
      "Palantir earnings for the December quarter topped estimates. Full-year 2025 revenue guidance for Palantir stock beat expectations."
    ],
    "url": "https://finance.yahoo.com/m/a887dee3-f434-3c04-a265-a9cd1df366f3/palantir-earnings-top.html",
    "timestamp": "2025-02-03T21:58:58.000Z"
  },
  {
    "title": "Palantir Stock Pops on Strong Outlook Amid AI Boom",
    "content": [
      "Palantir's (PLTR) fourth-quarter revenue and outlook for 2025 topped analysts' expectations, sending shares higher in extended trading Monday.",
      "The analytics software provider’s revenue grew 36% year-over-year to $828 million, surpassing the analyst consensus from Visible Alpha on strong demand for the company's Artificial Intelligence Platform.",
      "Earnings came in at $79.01 million, or 3 cents per share, down from $93.39 million, or 4 cents per share, a year earlier, and below expectations, thanks in part to one-time expenses related to stock appreciation rights. However, earnings after adjustment jumped 80% to $341.95 million, or 14 cents per share, topping the analyst consensus.",
      "\"Our business results continue to astound, demonstrating our deepening position at the center of the AI revolution,\" said Palantir CEO Alex Karp in a release.",
      "Palantir said it anticipates 2025 revenue of $3.74 billion to $3.76 billion, above the analyst consensus of $3.51 billion.",
      "Shares of Palantir surged 15% in extended trading Monday following the release. The stock closed at a record high of $83.74 Monday and has quintupled in value over the past 12 months.",
      "Read the original article on Investopedia"
    ],
    "url": "https://finance.yahoo.com/news/palantir-stock-pops-strong-outlook-214810905.html",
    "timestamp": "2025-02-03T21:48:10.000Z"
  },
  {
    "title": "Palantir Technologies Beats Fourth-Quarter Estimates, Shares Climb After Hours",
    "content": [
      "Palantir Technologies (PLTR) late Monday reported fourth-quarter results that topped analysts' estim"
    ],
    "url": "https://finance.yahoo.com/news/palantir-technologies-beats-fourth-quarter-214113307.html",
    "timestamp": "2025-02-03T21:41:13.000Z"
  },
  {
    "title": "Palantir (NASDAQ:PLTR) Delivers Strong Q4 Numbers, Stock Jumps 15.8%",
    "content": [
      "Data-mining and analytics company Palantir (NYSE:PLTR) reported Q4 CY2024 results beating Wall Street’s revenue expectations , with sales up 36% year on year to $827.5 million. On top of that, next quarter’s revenue guidance ($860 million at the midpoint) was surprisingly good and 7.2% above what analysts were expecting. Its non-GAAP profit of $0.14 per share was 23.7% above analysts’ consensus estimates.",
      "Is now the time to buy Palantir? Find out in our full research report.",
      "Revenue: $827.5 million vs analyst estimates of $775 million (36% year-on-year growth, 6.8% beat)",
      "Adjusted EPS: $0.14 vs analyst estimates of $0.11 (23.7% beat)",
      "Adjusted Operating Income: $372.5 million vs analyst estimates of $304.6 million (45% margin, 22.3% beat)",
      "Management’s revenue guidance for the upcoming financial year 2025 is $3.75 billion at the midpoint, beating analyst estimates by 6.3% and implying 30.8% growth (vs 28.5% in FY2024)",
      "Operating Margin: 1.3%, down from 10.8% in the same quarter last year",
      "Free Cash Flow Margin: 55.3%, down from 59.9% in the previous quarter",
      "Billings: $877 million at quarter end, up 40.3% year on year",
      "Market Capitalization: $187.9 billion",
      "“Our business results continue to astound, demonstrating our deepening position at the center of the AI revolution. Our early insights surrounding the commoditization of large language models have evolved from theory to fact,” said Alexander C. Karp, Co-Founder and Chief Executive Officer of",
      "Started by Peter Thiel after seeing US defence agencies struggle in the aftermath of the 2001 terrorist attacks, Palantir (NYSE:PLTR) offers software as a service platform that helps government agencies and large enterprises use data to make better decisions.",
      "Organizations generate a lot of data that is stored in silos, often in incompatible formats, making it slow and costly to extract actionable insights, which in turn drives demand for modern cloud-based data analysis platforms that can efficiently analyze the siloed data.",
      "A company’s long-term sales performance signals its overall quality. Even a bad business can shine for one or two quarters, but a top-tier one grows for years. Thankfully, Palantir’s 22.9% annualized revenue growth over the last three years was decent. Its growth was slightly above the average software company and shows its offerings resonate with customers.",
      "This quarter, Palantir reported wonderful year-on-year revenue growth of 36%, and its $827.5 million of revenue exceeded Wall Street’s estimates by 6.8%. Company management is currently guiding for a 35.6% year-on-year increase in sales next quarter.",
      "Looking further ahead, sell-side analysts expect revenue to grow 22.3% over the next 12 months, similar to its three-year rate. This projection is noteworthy and implies the market is baking in success for its products and services.",
      "Unless you’ve been living under a rock, it should be obvious by now that generative AI is going to have a huge impact on how large corporations do business. While Nvidia and AMD are trading close to all-time highs, we prefer a lesser-known (but still profitable) stock benefiting from the rise of AI. Click here to access our free report one of our favorites growth stories.",
      "Billings is a non-GAAP metric that is often called “cash revenue” because it shows how much money the company has collected from customers in a certain period. This is different from revenue, which must be recognized in pieces over the length of a contract.",
      "Palantir’s billings punched in at $877 million in Q4, and over the last four quarters, its growth was impressive as it averaged 25.4% year-on-year increases. This alternate topline metric grew slower than total sales, meaning the company recognizes revenue faster than it collects cash - a headwind for its liquidity that could also signal a slowdown in future revenue growth.",
      "The customer acquisition cost (CAC) payback period measures the months a company needs to recoup the money spent on acquiring a new customer. This metric helps assess how quickly a business can break even on its sales and marketing investments.",
      "Palantir is extremely efficient at acquiring new customers, and its CAC payback period checked in at 16.9 months this quarter. The company’s rapid recovery of its customer acquisition costs indicates it has a highly differentiated product offering and a strong brand reputation. These dynamics give Palantir more resources to pursue new product initiatives while maintaining the flexibility to increase its sales and marketing investments.",
      "We were impressed by how significantly Palantir blew past analysts’ billings expectations this quarter. We were also excited its revenue and EPS outperformed Wall Street’s estimates by a wide margin. Looking ahead, the outlook provided was also encouraging, with the company's 2025 revenue guidance exceeding expectations. Zooming out, we think this was a very good quarter. The stock traded up 15.4% to $96.85 immediately after reporting.",
      "Palantir put up rock-solid earnings, but one quarter doesn’t necessarily make the stock a buy. Let’s see if this is a good investment. What happened in the latest quarter matters, but not as much as longer-term business quality and valuation, when deciding whether to invest in this stock. We cover that in our actionable full research report which you can read here, it’s free."
    ],
    "url": "https://finance.yahoo.com/news/palantir-nasdaq-pltr-delivers-strong-211444638.html",
    "timestamp": "2025-02-03T21:14:44.000Z"
  }
]