[
  {
    "title": "Elon Musk's xAI lands $6B in new cash to fuel AI ambitions",
    "content": [
      "Updated December 25, 12:21 p.m. Pacific: Added details of xAI's valuation and Kingdom Holdings' contribution.",
      "xAI, Elon Musk's AI company, has raised $6 billion in a Series C financing round.",
      "The company announced this week that Andreessen Horowitz , Blackrock, Fidelity, Lightspeed, MGX, Morgan Stanley, OIA, QIA, Sequoia Capital, Valor Equity Partners, Vy Capital, Nvidia, AMD, and others participated.",
      "Kingdom Holdings, the Saudi conglomerate holding company, invested roughly $400 million in the round, according to a public filing. The filing also revealed that xAI is now valued at $45 billion, close to double its previous valuation.",
      "The new cash brings xAI's total raised to $12 billion, adding to the $6 billion tranche xAI raised in May.",
      "According to the Financial Times, only investors who'd backed xAI in its previous fundraising round were permitted to participate in this one. Reportedly, investors who helped finance Musk's Twitter acquisition were given access to up to 25% of xAI's shares.",
      "\"xAI’s most powerful model yet ... is currently training and we are now focused on launching innovative new consumer and enterprise products,\" xAI said in a statement. \"The funds from this financing round will be used to further accelerate our advanced infrastructure, ship groundbreaking products ... and accelerate ... research and development.\"",
      "Musk formed xAI last year. Soon after, the company released Grok, a flagship generative AI model that now powers a number of features on X, including a chatbot accessible to X Premium subscribers and free users in some regions.",
      "Grok has what Musk has described as \"a rebellious streak\" — a willingness to answer \"spicy questions that are rejected by most other AI systems.\" Told to be vulgar, for example, Grok will happily oblige, spewing profanities and colorful language you won’t hear from ChatGPT.",
      "Musk has derided ChatGPT and other AI systems for being too \"woke\" and \"politically correct,\" despite Grok's own unwillingness to cross certain boundaries and hedge on political subjects. He's also referred to Grok as \"maximally truth-seeking\" and less biased than competing models, although there's evidence to suggest that Grok leans to the left.",
      "Over the past year, Grok has become increasingly ingrained in X, the social network formerly known as Twitter. At launch, Grok was only available to X users — and developers skilled enough to get the \"open source\" edition up and running.",
      "Thanks to an integration with xAI's in-house image generation model, Aurora, Grok can generate images on X (without guardrails, controversially). The model can analyze images as well, and summarize news and trending events — imperfectly, mind.",
      "Reports indicate that Grok may handle even more X functions in the future, from enhancing X’s search capabilities and account bios to helping with post analytics and reply settings. X recently got a \"Grok button\" designed to help users discover \"relevant context\" and dive deeper into trending discussions and real-time events.",
      "xAI is sprinting to catch up to formidable competitors like OpenAI and Anthropic in the generative AI race. The company launched an API in October, allowing customers to build Grok into third-party apps, platforms, and services. And it just rolled out a standalone Grok iOS app to a test audience.",
      "Musk asserts that it hasn't been a fair fight.",
      "In a lawsuit filed against OpenAI and Microsoft, OpenAI's close collaborator, attorneys for Musk accuse OpenAI of \"actively trying to eliminate competitors\" like xAI by \"extracting promises from investors not to fund them.\" OpenAI, Musk's counsel says, also unfairly benefits from Microsoft’s infrastructure and expertise in what the attorneys describe as a \"de facto merger.\"",
      "Yet Musk often says that X’s data gives xAI a leg up compared to rivals. Last month, X changed its privacy policy to allow third parties, including xAI, to train models on X posts.",
      "Musk, it's worth noting, was one of the original founders of OpenAI, and left the company in 2018 after disagreements over its direction. He's argued in previous suits that OpenAI profited from his early involvement yet reneged on its nonprofit pledge to make the fruits of its AI research available to all.",
      "OpenAI, unsurprisingly, disagrees with Musk's interpretation of events. In a mid-December press release, the company characterized Musk's lawsuit as misleading, baseless, and a case of sour grapes.",
      "xAI has outlined a vision according to which its models would be trained on data from Musk’s various companies, including Tesla and SpaceX, and the models could then improve technology across those companies. xAI is already powering customer support for SpaceX's Starlink internet service, according to The Wall Street Journal, and the startup is said to be in talks with Tesla to provide R&D in exchange for some of the carmaker's revenue.",
      "Tesla shareholders, for one, object to these plans. Several have sued Musk over his decision to start xAI, arguing that Musk has diverted both talent and resources from Tesla to what's essentially a competing venture.",
      "Nevertheless, the deals — and xAI's developer and consumer-facing products — have driven xAI's revenue to around $100 million a year. For comparison, Anthropic is reportedly on pace to generate $1 billion in revenue this year, and OpenAI is targeting $4 billion by the end of 2024.",
      "Musk said this summer that xAI is training the next generation of Grok models at its Memphis data center, which was apparently built in just 122 days and is currently powered partly by portable diesel generators. The company hopes to upgrade the server farm, which contains 100,000 Nvidia GPUs, next year; in a press release, xAI said it plans to fully double that number. (Because of their ability to perform many calculations in parallel, GPUs are the favored chips for training and running models.)",
      "In November, xAI won approval from the regional power authority in Memphis for 150MW of additional power — enough to power roughly 100,000 homes. To win the agency over, xAI pledged to improve the quality of the city's drinking water and provide the Memphis grid with discounted Tesla-manufactured batteries. But some residents criticized the move, arguing it would strain the grid and worsen the area's air quality.",
      "Tesla is also expected to use the upgraded data center to improve its autonomous driving technologies.",
      "xAI has expanded quite rapidly from an operations standpoint in the year since its founding, growing from just a dozen employees in March 2023 to over 100 today. In October, the startup moved into OpenAI's old corporate offices in San Francisco's Mission neighborhood.",
      "xAI has reportedly told investors it plans to raise more money next year.",
      "It won't be the only AI lab raising immense cash. Anthropic recently secured $4 billion from Amazon, bringing its total raised to $13.7 billion, while OpenAI raised $6.6 billion in October to grow its war chest to $17.9 billion.",
      "Megadeals like OpenAI’s and Anthropic's drove AI venture capital activity to $31.1 billion across over 2,000 deals in Q3 2024, per PitchBook data.",
      "TechCrunch has an AI-focused newsletter! Sign up here to get it in your inbox every Wednesday.",
      "This article originally appeared on TechCrunch at https://techcrunch.com/2024/12/25/elon-musks-xai-lands-billions-in-new-cash-to-fuel-ai-ambitions/"
    ],
    "url": "https://finance.yahoo.com/news/elon-musks-xai-lands-6b-200541312.html",
    "timestamp": "2024-12-25T20:17:00.000Z"
  },
  {
    "title": "No title found",
    "content": [],
    "url": "https://finance.yahoo.com/m/266505ad-eab7-3ed6-8eba-7ebf32da2e4c/is-rivian-stock-a-buy-or-a.html",
    "timestamp": null
  },
  {
    "title": "No title found",
    "content": [],
    "url": "https://finance.yahoo.com/m/7ba4c6e9-e00c-3c14-a4f5-caaf8dfbc5b9/is-tesla-stock-a-buy-or-a.html",
    "timestamp": null
  },
  {
    "title": "How the stock market defied expectations again this year, by the numbers",
    "content": [
      "NEW YORK (AP) — What a wonderful year 2024 has been for investors.",
      "U.S. stocks ripped higher and carried the S&P 500 (^GSPC) to records as the economy kept growing and the Federal Reserve began cutting interest rates.",
      "The year featured many familiar winners, such as Big Tech, which got even bigger as their stock prices kept growing. But it wasn't just Apple, Nvidia and the like. Bitcoin (BTC-USD), gold and other investments also drove higher.",
      "Here's a look at some of the numbers that defined the year. All are as of Dec. 20.",
      "Remember when President Bill Clinton got impeached or when baseball's Mark McGwire hit his 70th home run against the Montreal Expos? That was the last time the U.S. stock market closed out a second straight year with a leap of at least 20%, something the S&P 500 is on track to do again this year. The index has climbed 24.3% so far this year, not including dividends, following last year's spurt of 24.2%.",
      "The number of all-time highs the S&P 500 has set so far this year. The first came early, on Jan. 19, when the index capped a two-year comeback from the swoon caused by high inflation and worries that high interest rates instituted by the Federal Reserve to combat it would create a recession. But the index was methodical through the rest of the year, setting a record in every month outside of April and August, according to S&P Dow Jones Indices. The latest came on Dec. 6.",
      "The number of times the Federal Reserve has cut its main interest rate this year from a two-decade high, offering some relief to the economy. Expectations for those cuts, along with hopes for more in 2025, were a big reason the U.S. stock market has been so successful this year. The 1 percentage point of cuts, though, is still short of the 1.5 percentage points that many traders were forecasting for 2024 at the start of the year. The Fed disappointed investors in December when it said it may cut rates just two more times in 2025, fewer than it had earlier expected.",
      "That’s how many points the Dow Jones Industrial Average rose by the day after Election Day, as investors made bets on what Donald Trump’s return to the White House will mean for the economy and the world. The more widely followed S&P 500 soared 2.5% for its best day in nearly two years. Aside from bitcoin, stocks of banks and smaller winners were also perceived to be big winners. The bump has since diminished amid worries that Trump’s policies could also send inflation higher.",
      "The level that bitcoin topped to set a record above $108,000 this past month. It's been climbing as interest rates come down, and it got a particularly big boost following Trump's election. He's turned around and become a fan of crypto, and he's named a former regulator who’s seen as friendly to digital currencies as the next chair of the Securities and Exchange Commission, replacing someone who critics said was overly aggressive in his oversight. Bitcoin was below $17,000 just two years ago following the collapse of crypto exchange FTX.",
      "Gold's rise for the year, as it also hit records and had as strong a run as U.S. stocks. Wars around the world have helped drive demand for investments seen as safe, such as gold. It's also benefited from the Fed's cut to interest rates. When bonds are paying less in interest, they pull away fewer potential buyers from gold, which pays investors nothing.",
      "It's a favorite number of Elon Musk, and it's also a threshold that Tesla's stock price passed in December as it set a record. The number has a long history among marijuana devotees, and Musk famously said in 2018 that he had secured funding to take Tesla (TSLA) private at $420 per share. Tesla soared this year, up from less than $250 at the start, in part because of expectations that Musk's close relationship with Trump could benefit the company.",
      "That's how much revenue Nvidia (NVDA) made in the nine months through Oct. 27, showing how the artificial-intelligence frenzy is creating mountains of cash. Nvidia's chips are driving much of the move into AI, and its revenue through the last nine months catapulted from less than $39 billion the year before. Such growth has boosted Nvidia's worth to more than $3 trillion in total.",
      "GameStop’s (GME) gain on May 13 after Keith Gill, better known as “Roaring Kitty,” appeared online for the first time in three years to support the video game retailer’s stock, which he helped rocket to unimaginable heights during the “ meme stock craze ” in 2021. Several other meme stocks also jumped following his post in May on the social platform X, including AMC Entertainment. Gill later disclosed a sizeable stake in the online pet products retailer Chewy, but he sold all of his holdings by late October.",
      "That's how much the U.S. economy grew, at annualized seasonally adjusted rates, in each of the three first quarters of this year. Such growth blew past what many pessimists were expecting when inflation was topping 9% in the summer of 2022. The fear was that the medicine prescribed by the Fed to beat high inflation — high interest rates — would create a recession. Households at the lower end of the income spectrum in particular are feeling pain now, as they contend with still-high prices. But the overall economy has remained remarkably resilient.",
      "This is the vacancy rate for U.S. office buildings — an all-time high — through the first three quarters of 2024, according to data from Moody's. The fact the rate held steady for most of the year was something of a win for office building owners, given that it had marched up steadily from 16.8% in the fourth quarter of 2019. Demand for office space weakened as the pandemic led to the popularization of remote work.",
      "That's the total number of previously occupied homes sold nationally through the first 11 months of 2024. Sales would have to surge 20% year-over-year in December for 2024's home sales to match the 4.09 million existing homes sold in 2023, a nearly 30-year low. The U.S. housing market has been in a sales slump dating back to 2022, when mortgage rates began to climb from pandemic-era lows. A shortage of homes for sale and elevated mortgage rates have discouraged many would-be homebuyers."
    ],
    "url": "https://finance.yahoo.com/news/stock-market-defied-expectations-again-120037542.html",
    "timestamp": "2024-12-26T12:00:37.000Z"
  },
  {
    "title": "Social Buzz: Wallstreetbets Stocks Mostly Higher Pre-Bell Thursday; Tesla, KULR Technology to Advance",
    "content": [
      "The most-talked-about stocks in the Reddit subforum Wallstreetbets were mostly higher in the early h"
    ],
    "url": "https://finance.yahoo.com/news/social-buzz-wallstreetbets-stocks-mostly-114519494.html",
    "timestamp": "2024-12-26T11:45:19.000Z"
  },
  {
    "title": "No title found",
    "content": [],
    "url": "https://finance.yahoo.com/m/5d8c5a24-bf0b-38d0-ad33-5e63cb93e4dc/these-stocks-are-moving-the.html",
    "timestamp": null
  },
  {
    "title": "No title found",
    "content": [],
    "url": "https://finance.yahoo.com/m/a18c0955-56f9-31cd-a299-ba5898eca8e8/tech-that-will-change-your.html",
    "timestamp": null
  },
  {
    "title": "38-Year-Old Military Vet With Pension Wants High-Risk Bets for $500/Month – 'Should I Dump It All in TSLA or Go All-In On Leverage?'",
    "content": [
      "Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.",
      "Tesla (TSLA) is one of the most talked-about stocks in the market, which has attracted both skeptics and avid supporters. Some investors see it as a game-changing company with much more to give, while others are not impressed by its stock volatility. For a 38-year-old military veteran with a rather strong financial foundation, this debate is quite relevant.",
      "After retiring because of injuries sustained overseas, this veteran has achieved a remarkable setup: He has maxed out a $15K emergency fund, his Roth 401(k)s, IRAs and he has a steady income thanks to his business.",
      "Don't Miss:",
      "If there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it?",
      "Deloitte's fastest-growing software company partnered with Amazon, Walmart & Target announces the deadline to invest this year is 12/20. – Last Chance to get 4,000 of its pre-IPO shares for just $0.26/share!",
      "With $500 monthly to allot to high-risk investments, he is debating whether to put his money into TSLA or go all-in on leverage. Due to his confusion, he contacted Reddit, where fellow investors advised him.",
      "Skepticism About Leveraged ETFs",
      "The consensus in the r/ETFs community thread started by the inquirer is that leveraged ETFs are not a good option for the 38-year-old military vet’s plans.",
      "“No leveraged ETFs. As far as they shoot up, they can shoot back down. They are more an ultra short-term trade and nothing else,” a comment says.",
      "See Also: Unlock the hidden potential of commercial real estate — This platform allows individuals to invest in commercial real estate offering a 12% target yield with a bonus 1% return boost today!",
      "However, in a reply to this comment, another Redditor mentions a few newer options worth checking.",
      "“There are some new leveraged ETFs that are leveraged for the long run. Check out BTGD. Bitcoin and gold for the long run,” the Reddit member says.",
      "Plenty of Support for Index Funds",
      "The support for Index Funds in the comments of this thread is astonishing. Although the investors on the board have different favorites, some have explained why.",
      "“Something like VOO is more popular than the QQQs because of the expense ratios. You can expect the QQQs to eat up more of your earnings than something like VOO, however, the upside may be slightly higher,” explains a Redditor in the comment section.",
      "Trending: Arrived Home's Private Credit Fund’s has historically paid an annualized dividend yield of 8.1%*, which provides access to a pool of short-term loans backed by residential real estate with just a $100 minimum.",
      "A second board member has enumerated all the funds he invested in and likely recommends that the military vet consider them, too.",
      "“I invest 100% in total-market, index-based, low-cost mutual funds. Specifically, I use mostly Vanguard’s Total Stock Market, Total Bond Market, Total International Stock Market, & Total International Bond Market funds.”",
      "Alternative High-Risk Suggestions",
      "Many more cautious investors who have gone the low-risk ETF route suggested the veteran consider these types of investments, as they would bring him plenty of money in the long run.",
      "“VGT & IYW are proven winners. If you really want moonshots, consider TOPT, MAGS or SMH. Any of those might sh*t the bed pretty hard whenever the inevitable market crash happens, but if you stick with it over time, I think you'll be printing money later,” a risk-taker in the comments said.",
      "Trending: Commercial real estate has historically outperformed the stock market, and this platform allows individuals to invest in commercial real estate with as little as $5,000 offering a 12% target yield with a bonus 1% return boost today!",
      "Another member of the r/ETF community on Reddit mentioned active ETFs, as they are not as high-risk as leveraged ETFs and a great alternative and named a few the retired veteran can look up.",
      "“You can try active ETFs like JEPQ, JEPI, QYLD. They use tech options for holding. Good return. They are good for bull market but still give you return for bear market,” the investor said.",
      "TSLA and Individual Stocks",
      "No one in the comments explicitly recommends TSLA as a good investment and advises against buying individual stocks and equities.",
      "“Buying individual stocks or sector funds creates unnecessary & uncompensated risk; I avoid doing so,” a Redditor writes.",
      "Lower interest rates mean some investments won't yield what they did in months past, but you don't have to lose those gains. Certain private market real estate investments are giving retail investors the opportunity to capitalize on these high-yield opportunities.",
      "Arrived Home's Private Credit Fund’s has historically paid an annualized dividend yield of 8.1%*, which provides access to a pool of short-term loans backed by residential real estate. The best part? Unlike other private credit funds, this one has a minimum investment of only $100.",
      "Looking for fractional real estate investment opportunities? The Benzinga Real Estate Screener features the latest offerings.",
      "This article 38-Year-Old Military Vet With Pension Wants High-Risk Bets for $500/Month – 'Should I Dump It All in TSLA or Go All-In On Leverage?' originally appeared on Benzinga.com",
      "© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved."
    ],
    "url": "https://finance.yahoo.com/news/38-old-military-vet-pension-160013502.html",
    "timestamp": "2024-12-25T16:00:13.000Z"
  },
  {
    "title": "Thinking of buying an EV? You might want to move quickly",
    "content": [
      "The best time to buy an electric vehicle may be right now. That’s because a $7,500 federal tax credit could soon disappear.",
      "President-elect Donald Trump has said he will move to eliminate the tax credit, possibly as soon as he takes office. It is even conceivable that the tax credit’s elimination could be made retroactive to the beginning of January, which would give EV buyers only a week left to be certain of locking in the credit.",
      "“I would be very inclined to say yes, it’s going away,” said Ivan Drury, director of insights at car buying site Edmunds. While it’s unclear exactly how Trump would eliminate the credit, Drury said he expects it won’t last long into the new administration. It could be done as part of tax legislation that Republicans are promising early in 2025. Or a Trump-controlled Internal Revenue Service could simply issue a new rule making the credit unavailable.",
      "“The simplest route that’s possible, is the one that they’re likely to take,” Drury said.",
      "But the tax credit is only part of the reason that it could make sense for potential EV buyers to act sooner than later. The combination of the federal tax incentive, and weakening sales could make this an ideal time to buy an EV.",
      "The slowing demand by American buyers, and more choices of EV models, led to record inventories of electric vehicles on dealer lots earlier this year, and that glut remains in place. Drury said that 64% of EVs sitting at dealerships are last year’s models, nearly twice the percentage of traditional internal combustion vehicles. Automakers traditionally release the next year’s models in the fall rather than waiting for the new year.",
      "The glut of EVs and increased competition has led legacy automakers to offer attractive financing terms to try to move the older EV models. Data from Edmunds shows that the average lease payment on non-Tesla EVs is down 40% from the start of 2023, far more the drop in transaction price alone. The difference is that the average interest rate on the lease has been cut by more than half.",
      "“If you buy an EV now, you’re not only sure of getting the EV tax credit that might not be there for much longer, you got incentives from automakers that can’t move them,” said Drury. “You’re doubling down. It won’t get any better.”",
      "The loss of the tax credit, and the inevitable weaker demand that would follow, could lead legacy automakers to pull back on their EV production more than they already have, Drury said. So the incentives now being offered could vanish as well.",
      "The auto industry will likely fight to preserve the tax credit. The Alliance for Automotive Innovation, an industry trade group that includes most automakers – but not Tesla – wrote a letter to Congress in October, ahead of the election, urging that the tax credit remain in place.",
      "The letter says US manufacturers rely on the credit to compete with Chinese EV production and advancements. Global automakers have invested billions of dollars in the transition from gasoline powered cars to electric vehicles, and a forced pullback could lead to huge losses.",
      "But the group and individual automakers declined to comment on their plans, or their views on what happens if the tax credit goes away, when contacted recently by CNN.",
      "And Tesla CEO Elon Musk, who donated hundreds of millions of dollars to help Trump get elected and who has been spending extensive time with the President-elect, has encouraged Trump to end the credit. Musk has said it would “only help Tesla.”",
      "The disappearance of the tax credit would probably hurt legacy automakers planning to roll out more EVs in the coming years, such as General Motors, Ford and Stellantis, or other small EV upstarts like Rivian, none of which have profited off of EV sales yet, due in large part to vast startup costs. If demand for EVs falls along with the disappearance of the tax credit, those automakers could be forced to pull back on their EV production to trim their losses, reducing competition for Tesla among EV car shoppers.",
      "Even with the slowing EV demand, many experts still forecast that total US sales of EVs could continue to edge higher, just at a much slower pace than in the past.",
      "“We still have upwards of 20 EV models coming into the market in 2025,” said Chris Hopson, principal automotive analyst for S&P Global. He said those increased offerings will bring in new buyers, and more electric cars will be sold as a result.",
      "He said that if the tax credit disappears early in the year, it could cause S&P to pull back on its EV forecast somewhat, but he would still expect a modest gain. But how the automakers react to the lack of tax credit could determine how much sales fall. They could cut prices more than they have in recent years.",
      "“Automakers can play with pricing to adjust for lack of credits,” Hopson said.",
      "And some states may step up with their own tax credits to make up for the loss of federal tax credits. That’s something California is looking to do.",
      "During the campaign President-elect Donald Trump frequently criticized EVs, though he qualified that criticism once Musk became one of his more prominent, and financially important, supporters. Still, Trump promised to get rid of an electric vehicle target from the Environmental Protect Agency of a minimum of 35% of new cars sold by 2032, which he refers to as an “EV mandate.”",
      "For more CNN news and newsletters create an account at CNN.com"
    ],
    "url": "https://finance.yahoo.com/news/thinking-buying-ev-might-want-120043906.html",
    "timestamp": "2024-12-25T12:00:43.000Z"
  },
  {
    "title": "No title found",
    "content": [],
    "url": "https://finance.yahoo.com/m/5602344a-50de-3ec1-987f-a18f385003e7/how-trump%E2%80%99s-ai-crypto-push.html",
    "timestamp": null
  }
]