[
  {
    "title": "Tesla stock jumps amid speculation Musk could buy TikTok",
    "content": [
      "Tesla (TSLA) stock jumped 3% Friday amid speculation that CEO Elon Musk could potentially buy TikTok. The social media platform needs to find an American buyer, or it will effectively face a countrywide ban starting next week — and Musk is reportedly the most likely candidate.",
      "The US Supreme Court on Friday rejected an appeal from TikTok to overturn a federal law banning the social media platform. The ban would penalize major companies for offering TikTok in their app stores. It’s set to take effect Jan. 19 unless TikTok’s Chinese parent company ByteDance sells the app to an American owner, per a federal law signed by President Biden in 2024 citing national security concerns related to the platform.",
      "“We believe ByteDance and ultimately Beijing is looking at the possibility that Musk/X could buy the US TikTok operations,” wrote Wedbush analyst Dan Ives in a note to investors. “Beijing/Xi Jinping has a strong relationship with Musk so there would be added comfort in this deal/potential partnership to avoid a TikTok ban in our view.”",
      "Even before Ives tossed his thoughts into the mix, Bloomberg this week reported that Chinese officials were exploring such an option, citing unnamed sources. Bloomberg’s sources said Beijing preferred TikTok remain under ByteDance rather than selling it to Musk. TikTok denied the claim, calling the report “pure fiction.”",
      "In the meantime, Trump has vowed to “save” the app. Trump has several avenues of action he could take to fend off a TikTok ban. For example, he could push Congress to repeal the ban or extend the deadline for the TikTok sale.",
      "“We continue to believe Musk will be heavily involved in finding a solution for TikTok and ultimately could build a consortium to buy TikTok,” Ives wrote, believing its price tag to be in the $40 billion to $50 billion range.",
      "Musk has become a close ally of Trump over the course of his campaign and even scored a quasi-governmental position heading the new Department of Government Efficiency, an extragovernmental agency that will aim to cut federal spending. Since Trump’s election win in early November, Tesla shares have soared 74% as part of the so-called Trump trade.",
      "Laura Bratton is a reporter for Yahoo Finance. Follow her on Bluesky @laurabratton.bsky.social. Email her at laura.bratton@yahooinc.com.",
      "Click here for the latest stock market news and in-depth analysis, including events that move stocks",
      "Read the latest financial and business news from Yahoo Finance"
    ],
    "url": "https://finance.yahoo.com/news/tesla-stock-jumps-amid-speculation-musk-could-buy-tiktok-191001660.html",
    "timestamp": "2025-01-17T21:01:47.000Z"
  },
  {
    "title": "Why Trump saving TikTok isn't so legally simple",
    "content": [
      "President-elect Donald Trump is reportedly mulling unconventional ways to save TikTok from an impending US ban, including an executive order that would push out enforcement of the new law by months.",
      "But doing so could mean contravening federal law, heightening the danger that such a rescue could face serious legal hurdles.",
      "An executive order offers Trump only a \"narrow chance\" of securing TikTok’s survival, said constitutional scholar and Kent Law School professor Mark Rosen. \"Under current Supreme Court precedent, an executive order is on very shaky ground.\"",
      "The Supreme Court is set to rule on TikTok’s future in the US by Jan. 19.",
      "The executive order being considered by Trump, as reported first by the Washington Post and confirmed by other media outlets, would suspend enforcement of the TikTok law for 60 to 90 days.",
      "It is scheduled to take effect this Sunday unless the Supreme Court overturns it before then. Chinese parent ByteDance can also stop the ban from taking effect by selling TikTok’s US operations to an owner not controlled by a foreign adversary.",
      "Trump, who on the campaign trail suggested in a social media post that he would \"save TikTok,\" has asked the Supreme Court to suspend the divest-or-be-banned deadline and consider his preference for a \"negotiated resolution\" — given that, as president, he will be responsible for national security. Trump takes office on Jan. 20.",
      "The main precedent that makes a Trump executive order an unreliable safe haven for TikTok comes from a limitation on presidential power established in the landmark 1952 Supreme Court case titled Youngstown Sheet & Tube Co. v. Sawyer.",
      "In that case, the court struck down an executive order issued by President Harry Truman directing the US Commerce Department to take over the nation’s steel mills.",
      "Truman’s order purported to keep a labor strike from threatening US steel protection during the Korean War.",
      "Despite that claim, the court ruled the president lacked the power to overtake private property, even during a time of war.",
      "Subsequent courts have been reluctant to identify independent, exclusive presidential authority that conflicts with law, Rosen said, because it risks vesting the president with \"king-like\" power.",
      "When an executive order is inconsistent with a law, Rosen explained, it can only withstand a challenge if the law is proven unconstitutional or if the president proves he has separate executive authority to issue it.",
      "Trump, for example, could try to challenge the TikTok law’s constitutionality on grounds not yet decided by the Supreme Court. In its current deliberations, the Supreme Court is considering whether the law violates the First Amendment’s speech protections, an argument made by TikTok and TikTok users.",
      "Alternatively, Trump could try to assert that executive authority exists despite the law.",
      "But a national security argument would be an uphill road for Trump given that Congress specified that its intent in passing the law was to protect national security.",
      "Any executive order from Trump would also create a new legal dilemma for a number of US tech giants that are required by law to put the TikTok ban into effect.",
      "The way the ban is enforced under the law is that it will no longer be legal for app stores run by companies like Apple (AAPL) and Google (GOOG, GOOGL) to allow users to download TikTok from their app stores, nor can cloud-storage companies like Microsoft (MSFT), Amazon (AMZN), and Oracle (ORCL) host the app.",
      "Penalties for violations range up to $5,000 for each access provided to a US user.",
      "Trump could ask his attorney general not to enforce the law — his nominee Pam Bondi didn’t commit to enforcing it when questioned by lawmakers this week. But Apple and Google still have to weigh whether that’s a risk they want to take.",
      "There are less risky paths for Trump to take. He could push Congress to overturn the law or encourage lawmakers to pass a law extending the Jan. 19 deadline. This week, Sen. Ed Markey did introduce a bill that would extend the deadline by 270 days, according to a statement.",
      "He could also find a buyer for the US operations or even a piece of it. According to reports by Bloomberg and the Wall Street Journal, Chinese government officials have discussed selling the US business to Elon Musk, the owner of X.",
      "The officials would prefer to keep TikTok under ByteDance ownership, according to the media reports, but have discussed the sale to Musk as among their contingency plans.",
      "Antitrust experts predict that Musk could clear US legal hurdles imposed by a TikTok acquisition, which some estimate could amount to $40 billion to $50 billion. One reason is TikTok and X have distinct users.",
      "Musk has a close relationship with the incoming president, having spent more than $250 million supporting his reelection campaign and helping lead a government cost-cutting effort as part of a new Department of Government Efficiency (DOGE).",
      "Musk paid $44 billion for X in 2022 and also runs a number of other companies, including electric vehicle maker Tesla (TSLA), SpaceX, Neuralink, the Boring Co., and artificial intelligence startup xAI.",
      "Tesla has a factory in China and sells a lot of its cars to that part of the world.",
      "But Bloomberg and the Wall Street Journal both reported there are a number of unknowns surrounding any possible deal with Musk.",
      "They include whether he would have to sell any other of his holdings, whether US regulators would approve, and what sort of influence officials in Beijing would have in suggesting ByteDance sell to a particular buyer.",
      "Trump's future national security adviser stated that the new Republican administration will keep the popular app, used by 170 million Americans, active in the US if a viable deal is reached. Meanwhile, Senate Democrat Chuck Schumer called on President Biden to extend the shutdown deadline by 90 days on Sunday.",
      "A TikTok spokesperson responded to the Bloomberg report by saying, \"We cannot be expected to comment on pure fiction.\"",
      "Click here for the latest technology news that will impact the stock market",
      "Read the latest financial and business news from Yahoo Finance"
    ],
    "url": "https://finance.yahoo.com/news/why-trump-saving-tiktok-isnt-so-legally-simple-220939026.html",
    "timestamp": "2025-01-17T11:39:47.000Z"
  },
  {
    "title": "Big Tech execs going to Trump's inauguration is a 'good sign': Mark Penn",
    "content": [
      "Big Tech executives are courting President-elect Donald Trump ahead of his return to the White House as Tesla (TSLA) CEO Elon Musk has emerged as a significant figure in Trump's administration.",
      "Stagwell (STGW) CEO Mark Penn joins Market Domination Overtime to share his take on Musk's role for Trump's second term and Trump's evolving relationship with Big Tech companies.",
      "\"I think it's super interesting that Elon Musk has really agreed to participate in a serious way in the administration and that the other kind of major tech executives are coming out,\" Penn says. \"The financial innovation of the country is driven in large part by these companies and these incredible executives of these companies. So, it is a good sign, I think, that they're coming out well for this inauguration.\"",
      "Penn expects tech companies will \"get back to more open platforms ... [un]involved in government-related censorship\" during Trump's second term.",
      "When asked if Big Tech executives cozying up to Trump could be a defensive move, Penn says he views Trump's biggest policy priority that affects these companies as \"overseas manufacturing breaks\" with the main focus on China.",
      "Watch the video above to hear Penn's thoughts on Musk's emergence as a GOP political leader and more.",
      "To watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime here.",
      "This post was written by Naomi Buchanan."
    ],
    "url": "https://finance.yahoo.com/video/big-tech-execs-going-trumps-004000810.html",
    "timestamp": "2025-01-17T00:40:00.000Z"
  },
  {
    "title": "I Still Can’t Get My Head Around Tesla Stock’s (TSLA) Valuation",
    "content": [
      "Tesla (TSLA) stock jumped again on Wednesday, leading the market upwards following some positive inflation data. However, this only served to make the electric vehicle (EV) maker more expensive, with the stock now trading at 160x forward earnings. Despite being broadly supportive of Elon Musk’s business endeavors, I’m bearish on Tesla simply because the valuation is incredibly hard to justify and Musk’s plans hard to quantify.",
      "Discover outperforming stocks and invest smarter with Top Smart Score Stocks",
      "Filter, analyze, and streamline your search for investment opportunities using Tipranks' Stock Screener",
      "I’m bearish on Tesla, but not because it lacks ambition. Instead, I’d contend that Tesla’s objectives, which extend far beyond electric vehicles with autonomous driving and robotics at the forefront, are very ambitious.",
      "To start with, the company’s progress in these areas has been slower than initially promised. While Tesla continues to tout its Full Self-Driving (FSD) capabilities, it remains at Level 2 autonomy, lagging behind competitors like Waymo and Cruise in achieving true autonomous driving.",
      "Meanwhile, the company’s plans for Optimus robots and Tesla trucks on Mars seem even more far-fetched to some onlookers, bordering on science fiction rather than near-term reality. Some analysts have also suggested that the disconnect between Elon Musk’s bold promises and actual delivery timelines has become a recurring theme, potentially eroding confidence in the company’s ability to achieve its very ambitious goals. Moreover, Tesla’s near-term plans face increasing competition and regulatory scrutiny.",
      "The company’s autonomous driving technology has also faced criticism for its safety record and misleading marketing, while its robotics division remains largely conceptual despite a promise of rollout in 2025. And a traditional automakers and tech giants pour resources into electric vehicles and self-driving technology, Tesla’s first-mover advantage may be eroding.",
      "With this in mind, the company’s ability to maintain its technological edge — especially the strength of its compute power — while scaling production and entering new markets is particularly important in determining whether it can live up to its ambitious plans and justify its lofty valuation.",
      "Secondly, my bearishness is further reinforced by the difficulty of trying to quantify Tesla’s objectives, which may be an exercise in futility, given the company’s penchant for pivoting into uncharted territories. ARK Invest’s ambitious $2,600 share price target for 2029 exemplifies the wide range of forecasts, with projections varying wildly among analysts.",
      "These estimates often rely on speculative assumptions about Tesla’s future ventures, including robotaxis and AI, which are yet to materialize as viable revenue streams. Moreover, the idea of quantifying potential earnings from Mars operations borders on absurdity, highlighting the inherent challenge in valuing a company with such nebulous long-term aspirations.",
      "And I’m not the only one struggling to quantify Tesla’s objectives. Indeed, the most bearish analyst, Gordon Johnson of GLJ Research, who maintains a Sell rating with an extremely low price target of $24.9, assigns no value to Tesla’s long-term objectives.",
      "However, the main reason why I’m bearish is Tesla’s valuation metrics, which stand in contrast to both industry norms and its own historical averages. This raises serious questions about the stock’s current price and its sustainability.",
      "With a forward price-to-earnings (P/E) ratio of 160x on a non-GAAP basis, Tesla trades at a staggering 843.5% premium to the sector median. This disconnect from fundamentals is further emphasized by its forward price-to-earnings-to-growth ratio of 17.5x, which is 971.8% higher than the sector median and 378.3% above Tesla’s own 5-year average.",
      "Even looking ahead, Tesla’s estimated P/E ratios are elevated, with 2027’s projected P/E of 84.2x still significantly above industry norms. These metrics suggest that Tesla’s current valuation is predicated on extraordinary future growth and success in unproven markets rather than its present financial performance. Such a valuation leaves little room for error and poses significant downside risk if the company fails to meet these lofty expectations. As a result, the execution risk is huge.",
      "On TipRanks, TSLA comes in as a Hold based on 13 Buys, 12 Holds, and nine Sell ratings assigned by analysts in the past three months. The average TSLA stock price target is $329.63, implying about 20.3% downside risk.",
      "See more TSLA analyst ratings",
      "I’m bearish on Tesla because its valuation is disconnected from fundamentals and heavily reliant on unproven future ventures. While the company leads in the EV market and boasts ambitious plans in autonomous driving and robotics, execution has typically lagged behind promises, and competition continues to intensify. As much as I want to back this Musk venture, I simply can’t.",
      "The speculative nature of its long-term goals makes quantifying its potential nearly impossible, leaving investors to rely on lofty projections that may not materialize. With a forward P/E of 160x and analysts forecasting downside potential, Tesla’s current price reflects immense risk and suggests an investment would be highly speculative. For these reasons, caution is warranted when considering the stock at its present valuation.",
      "Disclosure"
    ],
    "url": "https://finance.yahoo.com/news/still-t-head-around-tesla-220657328.html",
    "timestamp": "2025-01-17T22:06:57.000Z"
  },
  {
    "title": "Tesla Stock 'Valuation Is Full': Analyst Flags Long-Term Growth Opportunities With Robotaxis, FSD",
    "content": [
      "Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.",
      "A Tesla Inc (NASDAQ:TSLA) analyst highlighted the monetization opportunities for the company with its robotaxis and FSD.",
      "The Tesla Analyst: Goldman Sachs analyst Mark Delaney maintained a Neutral rating on Tesla with a $345 price target.",
      "The Analyst Takeaways: Improvement in Tesla's FSD saw robotaxi revenue now factored into Delaney's financial models for the company in a new investor note.",
      "The analyst expects Tesla's robotaxis to begin operations in the second half of 2026 and hit revenue of around $115 million in 2027.",
      "Don't Miss:",
      "Maker of the $60,000 foldable home has 3 factory buildings, 600+ houses built, and big plans to solve housing — you can become an investor for $0.80 per share today.",
      "This Jeff Bezos-backed startup will allow you to become a landlord in just 10 minutes, with minimum investments as low as $100 for properties like the Byer House from Stranger Things.",
      "Delaney's $115 million estimate was based on Tesla's robotaxi fleet hitting 300 vehicles by the end of 2026 and 1,500 vehicles by the end of 2027 with 20 trips per day per vehicle in 2027 and a price of $2.50 per mile.",
      "\"We believe that the performance of Tesla's FSD software has meaningfully improved with V13 compared to V12 based on our recent ride in a FSD V13-enabled Tesla vehicle, crowdsourced data, and third-party reviews,\" Delaney said.",
      "Crowdsourced data showed more miles between interventions and 97% of drives not requiring a critical intervention, the report said.",
      "\"While we are encouraged by the improvement, recall that Tesla aims to be safer than a human driver in 2Q25, and FSD would need significant improvement to reach this level.\"",
      "While there is more work to be done on FSD, the analyst saw monetization levels picking up in 2026 and 2027.",
      "\"We believe long-term FSD monetization potential will not only depend on technical progress, but the degree to which Tesla's software is differentiated vs. other alternatives.\"",
      "See Also: Commercial real estate has historically outperformed the stock market, and this platform allows individuals to invest in commercial real estate with as little as $5,000 offering a 12% target yield with a bonus 1% return boost today!",
      "Delaney also said FSD licensing to other OEMs could provide an upside scenario for Tesla and this business segment.",
      "The incoming Donald Trump White House administration could change federal standards on robotaxi rules, the report also said.",
      "This could help Tesla launch robotaxi services in several states and feature existing Tesla models first before launching the new Cybercab as part of the services.",
      "\"Globally, the market for robotaxis could reach billions of dollars in TAM at a high number of deployments and across operators.\"",
      "Delaney remains cautious about Tesla and sees \"valuation as full.\" The analyst said the ramp in FSD could take longer than Tesla targets, auto fundamentals could remain volatile and auto delivery volumes could be lower than Tesla's outlook in 2025.",
      "\"We believe Tesla remains well positioned for long-term growth, given its leadership position in EVs; the breadth/depth of its technical capabilities in AI, software, and hardware; and its ability to benefit from a full set of solutions including in charging and storage.\"",
      "Check It Out:",
      "Arrived allows individuals to invest in shares of rental properties for as little as $100, providing the potential for monthly rental income and long-term appreciation without the hassles of being a landlord. With over $1 million in dividends paid out last quarter and a growing selection of properties across various markets, Arrived offers an attractive alternative for investors seeking to build a diversified real estate portfolio.",
      "In October 2024, Arrived sold The Centennial, achieving a total return of 34.7% (11.2% average annual returns) for investors. Arrived aims to continue delivering similar value across our portfolio through careful market selection, attentive property management, and thoughtful timing in sales.",
      "Looking for fractional real estate investment opportunities? The Benzinga Real Estate Screener features the latest offerings.",
      "Photo: Courtesy Tesla",
      "This article Tesla Stock 'Valuation Is Full': Analyst Flags Long-Term Growth Opportunities With Robotaxis, FSD originally appeared on Benzinga.com"
    ],
    "url": "https://finance.yahoo.com/news/tesla-stock-valuation-full-analyst-213016295.html",
    "timestamp": "2025-01-17T21:30:16.000Z"
  },
  {
    "title": "No title found",
    "content": [],
    "url": "https://finance.yahoo.com/m/17cef3fa-9d11-352f-8ce9-cef0442e8c95/tesla-stock-is-up-it%E2%80%99s-about.html",
    "timestamp": null
  },
  {
    "title": "No title found",
    "content": [],
    "url": "https://finance.yahoo.com/m/7ba4c6e9-e00c-3c14-a4f5-caaf8dfbc5b9/is-tesla-stock-a-buy-or-a.html",
    "timestamp": null
  },
  {
    "title": "No title found",
    "content": [],
    "url": "https://finance.yahoo.com/m/4205eaa9-f620-3a0b-a81a-0e82c7c9fd0b/magnificent-seven-stocks-.html",
    "timestamp": null
  },
  {
    "title": "Tesla, Inc. (TSLA): Why Are Hedge Funds Bullish On This Revenue Growth Stock?",
    "content": [
      "We recently compiled a list of the 10 Best Revenue Growth Stocks to Buy According to Hedge Funds. In this article, we are going to take a look at where Tesla, Inc. (NASDAQ:TSLA) stands against the other revenue growth stocks.",
      "Citigroup has forecasted 2025 to be a positive and strong year for global stocks. Citi expects a rally in global equities to extend into the year 2025 and estimates a 10% EPS growth for global equities which is slightly below analysts' consensus of 13%.",
      "The stance was that declining interest rates and easing inflation could help boost corporate earnings. The major world stock benchmark, MSCI All Country World Index Local, is expected to reach 1,140 points by the end of this year which signals a 10% increase from its previous close of 1,035.46. Citi added that the United States and emerging market regions could witness the most robust earnings per share growth of about 15%.",
      "Citi remains 'overweight' on U.S. equities but believes that the new Trump administration brings a lot of uncertainty with potential tariffs, tax cuts, and deregulation resulting in a ‘complicated mix of favorable and adverse economic effects’. In 2024, the S&P 500 index rallied 24%, driven by the expected Fed rate cuts, optimism relating to Artificial Intelligence, and the potential deregulation under the new US President-elect. Regarding the effect of these drivers on 2025, Citigroup analysts stated:",
      "Our Methodology:",
      "In order to compile a list of the 10 best revenue growth stocks to buy according to hedge funds, we first used a stock screener to screen stocks that have more than $2 billion market cap and at least 25% revenue growth over the past 5 years. Moving on, we shortlisted the top 10 stocks from our list which had the highest revenue growth and were the most popular among hedge funds. The 10 best revenue growth stocks to buy according to hedge funds have been arranged in ascending order of their hedge fund sentiment, as of Q3.",
      "At Insider Monkey we are obsessed with the stocks that hedge funds pile into. The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).",
      "25 Most In Demand Cars Heading into 2024",
      "Number of Hedge Fund Holders: 99",
      "5-Year Revenue Growth: 31.81%",
      "Tesla, Inc. (NASDAQ:TSLA) designs, develops, manufactures, sells, and leases high-performance fully electric vehicles and energy generation and storage systems while offering services related to its products. Tesla operates through two reportable segments including automotive and energy generation and storage.",
      "The solid mission to accelerate the world’s transition to sustainable energy complimented by its engineering expertise, vertically integrated business model, and focus on user experience differentiates Tesla from other companies. The electric car maker came out to be one of the biggest beneficiaries of Trump's victory with Elon Musk being pro-Trump as its shares climbed to a record during the stock rally following Trump's win while the company hit the massive $1 trillion market cap.",
      "However, Tesla ended up starting 2025 on a low note since investors were not impressed with the company posting a big fourth-quarter delivery miss. The company also missed analyst estimates for 2024 while witnessing the first year-over-year delivery decline. According to Morgan Stanely, the Q4 deliveries missed consensus by about 3%, stating",
      "Overall TSLA ranks 3rd on our list of the best revenue growth stocks to buy according to hedge funds. While we acknowledge the potential of TSLA as an investment, our conviction lies in the belief that some deeply undervalued AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for a deeply undervalued AI stock that is more promising than TSLA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.",
      "READ NEXT: 20 Best AI Stock To Buy Now and 30 Most Important AI Stocks According to BlackRock.",
      "Disclosure: None. This article is originally published at Insider Monkey."
    ],
    "url": "https://finance.yahoo.com/news/tesla-inc-tsla-why-hedge-162040276.html",
    "timestamp": "2025-01-17T16:20:40.000Z"
  },
  {
    "title": "Tesla Stock Jumps as Investors Bet on Energy, AI, and More",
    "content": [
      "Tesla Inc.'s (TSLA, Financial) shares moved up by 3.5% early in trading on Friday as the prolific trading session provided a solid final day for the week. The stock's gain comes as broader discussions among analysts and investors are highlighting Tesla's diversification beyond its core automotive business.",
      "During a New York lunch discussion, Morgan Stanley analyst Adam Jonas said he had become aware of a shift in the way investors think in a recent report. As investors talked up Tesla's other ventures, Jonas said, Tesla's automotive gross margins and vehicle delivery growth seemed to be an afterthought. They include energy storage solutions, autonomous driving technologies and artificial intelligence initiatives.",
      "The gross automotive profit margin for the Tesla Q3 2024 was around 17% without the sale of regulatory credits, credits that have historically contributed to the company's earnings. In line with this, Tesla's gross automotive margin is expected to hover around 15% for Q4 '24, and it will also see vehicle volume growth of around 10% to 15% for 2025.",
      "Tesla's non-automotive segments are now seen by many in the market as a vital contributor to long-term value. Key areas of interest for stakeholders are innovations in energy products, such as the Powerwall, continued progress in its AI-focused Dojo supercomputer and autonomous driving.",
      "This article first appeared on GuruFocus."
    ],
    "url": "https://finance.yahoo.com/news/tesla-stock-jumps-investors-bet-155223542.html",
    "timestamp": "2025-01-17T15:52:23.000Z"
  }
]