[
  {
    "title": "Tesla stops taking orders in China for US-made cars",
    "content": "The ongoing trade battle between the US and China has led the automaker to stop taking orders in China for vehicles that are made in the United States. Yahoo Finance Senior Reporter Pras Subramanian reports on that story and the new, cheaper Cybertruck trim.\n\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination here.\n\nWell Tesla shares slipping as it stops taking orders in China for two models imported from the US. The EV maker feeling the sting from the tariffs on China. Yahoo Finance's Pras Subramanian joining us now to discuss. So Pras, obviously we've seen a big ripple effect from what's going on and this uh the latest example from Tesla.\n\nYeah, you know you saw these retaliatory tariffs in China, 125% tariffs for US imports coming into China, which makes them not competitive, right? So for Tesla here their higher end models, the Model X and Model S EVs, both made in California, have been pulled from the Chinese market per Tesla's website. These cars cost around $100,000 US dollars or equivalent in China and it would be it would cost double the amount if if the tariff would be placed on them, so which is untenable for them at that point. So you know Tesla sold around 2,000 of these vehicles last year so it isn't a big mover for them, but it sort of highlights the precarious situation that Tesla and other automakers find themselves now in this post-trade war world.\n\nAnd Pras, new lower priced cybertruck, my friend, is out. What are the details there, Pras, and could it help demand?\n\nYou know, Josh, I know you're looking at a pickup truck yourself, but not saying this truck would work for you, but the long range variant is out. This is basically a truck that costs $69,000, about $10,000 less than the than the current all-wheel drive cheapest version. Basically, you're getting, you're getting a real-wheel drive motor, not not an all-wheel drive system. 350 miles of range is not bad, but you get less towing capacity, you get cloth seats, and no retractable tonneau cover, they call it, that goes over the back. And no useful, the outlets, the outlets in the back, in the bed, are gone. So that's not happening either. So, you know, is it enough to move the needle? With the tax credit, you're down to around $62,000, which is fairly competitive, but you're you're up against the Rivian R1T and F150 Lightning, which are very capable trucks that don't have the Musk and Tesla brand baggage, if you will. So hard to say if this cheaper truck will help them, which according to Cox Automotive sales were halved of the cybertruck in Q1 compared to Q4. So a long way to go there for them.\n\nPras, thank you. Josh, you're looking at a pickup truck?\n\nI am. I've been talking to Pras. Well, I'm hoping Pras can maybe, you know, he knows some people. He's a well-connected guy. That's why I've been talking.\n\nGet you some opinions about which ones to get. Now, I can't wait to I can't wait to see pictures of Josh Lipton in his new pickup truck.",
    "url": "https://finance.yahoo.com/video/tesla-stops-taking-orders-china-203704306.html",
    "timestamp": "2025-04-11T20:37:04.000Z"
  },
  {
    "title": "Tesla, Apple, Jamie Dimon comments: Trending Tickers",
    "content": "Brad Smith and Madison Mills take a closer look at some of Yahoo Finance's trending tickers.\n\nTesla (TSLA) has stopped taking orders in China for two car models that are imported from the US amid the ongoing US–China trade war.\n\nApple (AAPL) is in focus after Wedbush analysts said the iPhone maker is the tech company most negatively impacted by President Trump's tariffs.\n\nJPMorgan Chase (JPM) CEO Jamie Dimon says the US economy faces \"considerable turbulence.\"\n\nTo watch more expert insights and analysis on the latest market action, check out more Morning Brief here.\n\nWe're taking a closer look at some trending tickers this morning. Tesla, Apple and JP Morgan Chase. First up, Tesla has stopped taking orders in China for two models that are imported from the US, that that includes the Model S sedan and the Model X sport utility vehicle. You can see on their website, the models Y and three have a button that says order now, while the models S and X say, view the current car. This comes amid an escalating trade war between the countries with the US raising its levy on China to 145% and China retaliating with 125% tariffs on American goods.\n\nPlus Apple, feeling the heat of President Trump's trade war, although many reciprocal tariffs on countries got a 90-day pause. China certainly not one of them. With the US tariff rate on Chinese goods at 145%. Wedbush is Dan Ives saying, no US tech company is more negatively impacted by tariffs than Apple, with 90% of iPhones produced and assembled in China. CFRA sees 50% odds of Apple receiving a tariff exemption. Apple has vowed to invest $500 billion domestically over the next four years. And the White House says Trump believes iPhones could be made in the US. Analysts, however, have their doubts on that.\n\nFinally, JP Morgan Chase CEO, Jamie Diamond is warning Americans that the economy faces quote, considerable turbulence. Jamie Diamond making the comments in JP Morgan's first quarter earnings report where the firm saw a rise in profits. Earnings rose 9% from a year ago, but the bank also set aside 75% more provisions to cover future loan losses, a sign that it expects borrowers to run into more problems ahead. Diamond mentioned quote, potential negatives of tariffs and trade wars, sticky inflation, high fiscal deficits and volatility.\n\nAnd you can scan the QR code below to track the best and worst performing stocks of the session with Yahoo Finances trending tickers page.",
    "url": "https://finance.yahoo.com/video/tesla-apple-jamie-dimon-comments-144826503.html",
    "timestamp": "2025-04-11T14:48:26.000Z"
  },
  {
    "title": "Why Wall Street's biggest bear isn't budging on his calls after Trump tariff pause",
    "content": "It's going to take more than a reciprocal tariff pause to keep Wall Street's biggest bear from roaming the markets and heading into hibernation.\n\n\"Based on my calculations, the tariff rate is still quite high — at least as high as anything we have seen since the 1930s,\" BCA Research chief strategist Peter Berezin told Yahoo Finance. \"There is no guarantee these so-called reciprocal tariffs are going to come down. The fact of the matter is that most countries don't have very large trade barriers with the US.\"\n\nBerezin added, \"The uncertainty is a problem — I think we are still headed into a recession, unfortunately.\"\n\nBerezin told Yahoo Finance recently he sees a 75% chance of a US recession this year and the S&P 500 dropping 15% to 4,450. He hasn't ruled out the US already being in a mild recession.\n\nListen: Why Jamie Dimon may be wrong on a recession\n\nBerezin gained attention for being the lone bear on Wall Street coming into 2025. Further, he correctly called in 2022 that there would be no US recession — despite most on the Street bracing for one. He has been an economist for more than 30 years, with stints at the International Monetary Fund (IMF), Goldman Sachs, and now BCA Research.\n\nThe bearish calls on markets and the economy come amid another turbulent week for stocks as some traders aimed to price in a recession while others took a more optimistic viewpoint.\n\nThe Dow Jones Industrial Average (^DJI) on Thursday tanked 1,014.79 points or 2.5%. The S&P 500 (^GSPC) and Nasdaq Composite (^IXIC) sold off to the tune of 3.46% and 4.31%, respectively. Investor favorites Nvidia (NVDA) and Tesla (TSLA) plunged 6% and 7.3%, respectively.\n\nMarkets essentially dialed back their excitement after a historic day on Wednesday.\n\nThe S&P 500 exploded 9.5% on Wednesday as President Trump announced a 90-day pause on reciprocal tariffs for most countries. He cranked up the pressure on China, however, taking tariffs up to 145%. The tech-heavy Nasdaq Composite surged 12% for its second-best day on record. The Dow Jones Industrial Average shot up 7.8%, or about 3,000 points.\n\nThe about-face on tariffs caused Goldman Sachs economists to reverse their baseline recession call ... made earlier that day.\n\nStocks were solidly in the red on Friday.\n\nDespite the elevated market volatility, some Wall Street strategists are aiming to search the rubble for buying opportunities. Most calls reviewed by Yahoo Finance focus on defensive stock tilts rather than buying recent dips on former highfliers in Apple (AAPL), Nvidia, and Tesla.",
    "url": "https://finance.yahoo.com/news/why-wall-streets-biggest-bear-isnt-budging-on-his-calls-after-trump-tariff-pause-124002190.html",
    "timestamp": "2025-04-11T12:40:02.000Z"
  },
  {
    "title": "Tesla (TSLA) Stock Slides as Market Rises: Facts to Know Before You Trade",
    "content": "The most recent trading session ended with Tesla (TSLA) standing at $252.24, reflecting a -0.06% shift from the previouse trading day's closing. This change lagged the S&P 500's 1.81% gain on the day. Elsewhere, the Dow saw an upswing of 1.56%, while the tech-heavy Nasdaq appreciated by 2.06%.\n\nHeading into today, shares of the electric car maker had gained 4.87% over the past month, outpacing the Auto-Tires-Trucks sector's loss of 0.97% and the S&P 500's loss of 6.14% in that time.\n\nMarket participants will be closely following the financial results of Tesla in its upcoming release. The company plans to announce its earnings on April 22, 2025. The company is predicted to post an EPS of $0.45, indicating constancy compared to the equivalent quarter last year. Simultaneously, our latest consensus estimate expects the revenue to be $21.85 billion, showing a 2.57% escalation compared to the year-ago quarter.\n\nFor the entire fiscal year, the Zacks Consensus Estimates are projecting earnings of $2.65 per share and a revenue of $104.78 billion, representing changes of +9.5% and +7.26%, respectively, from the prior year.\n\nInvestors should also note any recent changes to analyst estimates for Tesla. These revisions typically reflect the latest short-term business trends, which can change frequently. Hence, positive alterations in estimates signify analyst optimism regarding the company's business and profitability.\n\nBased on our research, we believe these estimate revisions are directly related to near-team stock moves. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.\n\nThe Zacks Rank system, which varies between #1 (Strong Buy) and #5 (Strong Sell), carries an impressive track record of exceeding expectations, confirmed by external audits, with stocks at #1 delivering an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate has moved 14.59% lower. Tesla currently has a Zacks Rank of #3 (Hold).\n\nLooking at valuation, Tesla is presently trading at a Forward P/E ratio of 95.19. This expresses a premium compared to the average Forward P/E of 9.51 of its industry.\n\nWe can also see that TSLA currently has a PEG ratio of 4.15. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. By the end of yesterday's trading, the Automotive - Domestic industry had an average PEG ratio of 0.78.\n\nThe Automotive - Domestic industry is part of the Auto-Tires-Trucks sector. Currently, this industry holds a Zacks Industry Rank of 158, positioning it in the bottom 37% of all 250+ industries.",
    "url": "https://finance.yahoo.com/news/tesla-tsla-stock-slides-market-214517188.html",
    "timestamp": "2025-04-11T21:45:17.000Z"
  },
  {
    "title": "Michael Saylor has a biblical take on MicroStrategy’s terrific return",
    "content": "Bitcoin evangelist Michael Saylor has a biblical take on the latest return figures of his business intelligence firm, Strategy (Nasdaq: MSTR), formerly MicroStrategy.\n\nOn Apr. 11, Saylor wrote on X (formerly Twitter), “In the beginning was the Bitcoin. Then came the @Strategy.”\n\nSaylor posted an image along with comparing the 1-year return offered by the Strategy stock to that offered by other giants such as Tesla (Nasdaq: TSLA), SPDR Gold Shares (NYSEArca: GLD), Nvidia (Nasdaq: NVDA), and even Bitcoin — the king coin — itself.\n\nWhile MSTR offered a 1-year return of 92% as of Apr. 11, Elon Musk’s Tesla stood far behind with a 44% annual return.\n\nSPDR Gold Shares, one of the largest gold holders in the world, offered a 1-year return of 36%. Note that gold hit its record high of $3,237 an ounce on Apr. 11.\n\nNvidia, the leading chip manufacturer, generated a 1-year return of 36%.\n\nBitcoin, the world's largest corporate holder of which is Strategy, itself could only offer a 1-year return of 20%.\n\nExcept for Tesla, Nvidia, and Apple, other Magnificent Seven stocks performed rather poorly in terms of annual returns.\n\nWhile Meta with 4% annual return lied in the green zone, Alphabet, Amazon, and Microsoft lied in the red zone as they offered negative annual returns.\n\nThe stock market is still reeling under the drastic impact of President Donald Trump’s tariff war.\n\nThe resilience of Strategy amid such trying times had the Strategy founder founding the Genesis myth for the Bitcoin community.\n\nStrategy holds more than 500,000 Bitcoin worth $44 billion as of now.\n\nAs far as Bitcoin is concerned, it was trading at $83,871.28 at press time as per Kraken’s price feed.",
    "url": "https://finance.yahoo.com/news/michael-saylor-biblical-microstrategy-terrific-205834049.html",
    "timestamp": "2025-04-11T20:58:34.000Z"
  },
  {
    "title": "Is Tesla Inc. (NASDAQ:TSLA) a NASDAQ Stock with the Highest Upside Potential?",
    "content": "We recently published a list of the 13 NASDAQ Stocks with the Highest Upside Potential. In this article, we are going to take a look at where Tesla Inc. (NASDAQ:TSLA) stands against other NASDAQ stocks with high upside potential.\n\nOn April 7, Dan Ives of Wedbush Securities joined CNBC’s ‘Squawk on the Street’ to discuss how the current tariff environment could impact tech supply chains. Musk’s actions and Trump’s tariffs have contributed to broad economic uncertainty, which Ives also referred to as the economic Armageddon for US tech in an earlier conversation. He expressed concern about the structural supply chain challenges posed by recent tariffs and geopolitical tensions. Ives highlighted that the US tech sector has historically maintained an edge over China but this could be wiped out if manufacturing were relocated to the US. The logistical hurdles of building manufacturing plants in the US are not negligible and it would take 4 to 5 years to establish facilities capable of sustaining production levels comparable to those in Asia.\n\nHe also acknowledged that he hasn’t downgraded major stocks like the ones in MAG7 but remains cautious. If these previously highlighted issues persist for months, Ives anticipates drastic cuts in earnings. This uncertainty surrounding tariffs could lead to lower demand for emerging technologies like AI and cybersecurity. He explained that this situation could severely impact the US tech companies and lead to broader cuts across the tech sector — potentially up to 25% in earnings. He also criticized Elon Musk’s political involvement, which he believes has caused permanent damage to his brand and customer base. He estimated a 20% demand destruction in Europe and 10% in the US.\n\nWe used the Finviz stock screener to select the 13 stocks with the highest analysts’ upside potential (at least 35%) as of April 8. The stocks are ranked in ascending order of their upside potential. We have also added the hedge fund sentiment for each stock, as of Q4 2024, which was sourced from Insider Monkey’s database.\n\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\n\nAverage Upside Potential as of April 8: 43.60%\n\nNumber of Hedge Fund Holders: 126\n\nTesla Inc. (NASDAQ:TSLA) is a global EV manufacturer and energy generation and storage systems company. Its Automotive segment offers products and services related to EVs, while the Energy Generation and Storage segment engages with solar products and services for residential, commercial, and industrial customers.",
    "url": "https://finance.yahoo.com/news/tesla-inc-nasdaq-tsla-nasdaq-205050031.html",
    "timestamp": "2025-04-11T20:50:50.000Z"
  },
  {
    "title": "BYD Stock Soars. Trade Wars Can Hae Unintended Consequences.",
    "content": "The stock rose 7.2% in overseas trading. Stock indexes were volatile after China announced 125% tariff rates on U.S. imports. Tesla is no longer taking orders for its Model S, X, or Cybertruck in China, according to its website.",
    "url": "https://finance.yahoo.com/m/7f0c99da-d7af-3c73-9e5d-a0840dda2e39/byd-stock-soars-trade-wars.html",
    "timestamp": "2025-04-11T20:32:00.000Z"
  },
  {
    "title": "Tesla Stock Falls Again. Investors Trading Shares Should Remember This.",
    "content": "It has been another wild week for Tesla stock. Investors feeling anxious or out of breath should remember a couple of things about the stock market. The direct impact of Chinese tariffs on Tesla is small, but it has stopped taking orders for the Model S and X on its Chinese website.",
    "url": "https://finance.yahoo.com/m/339efd2d-e2a0-33be-b199-30efd45dedc6/tesla-stock-falls-again-.html",
    "timestamp": "2025-04-11T20:20:00.000Z"
  },
  {
    "title": "Tesla just hit a big trade war roadblock in China",
    "content": "As Beijing retaliated — again — against President Donald Trump’s tariff hikes, Tesla (TSLA) quietly pulled options to buy new Model S and X electric vehicles from its website in China, several outlets reported Friday.\n\nTesla builds both of these models in the U.S., which makes them subject to China’s newly announced 125% tariffs on U.S. imports; Beijing’s announcement came in response to the Trump administration’s decision to boost effective import taxes on goods from China to 145%.\n\nThe escalating tariffs form yet another roadblock for Tesla. Its year-over-year sales in China were already down 11.5% in March, even with a lift from the debut of the company’s revamped Model Y, as competitors (including BYD (BYDDY)) gained significant ground.\n\nOn the upside, Tesla has a factory in Shanghai that makes its Model Y and 3 vehicles, both of which are more popular in China than the S and X, per Bloomberg.\n\nTesla is also struggling to compete in Europe; in January, as CEO Elon Musk’s role in the second Trump administration grew clear, Tesla’s sales cratered 44%, according to one third-party report. A subsequent report found that Tesla’s sales in Europe dropped again in February. Despite Musk’s close ties with Trump, the billionaire CEO has criticized U.S. tariffs on Europe, where Tesla faces increasing competition from Chinese and European EVs alike.\n\nThings haven’t looked so hot in the U.S., either. A new Kelley Blue Book report concluded that Tesla’s sales in the U.S. declined “nearly 9%” year-over-year in the first quarter of 2025, while overall EV sales in the U.S. grew 11%. The report added: “Without a significant shift in product strategy, Tesla will continue to shrink in the U.S. market.”\n\nTesla was down about 1% as of 3:15 p.m. ET on Friday. Since January 1, the stock has tanked about 34%.\n\nFor the latest news, Facebook, Twitter and Instagram.",
    "url": "https://finance.yahoo.com/news/tesla-just-hit-big-trade-195300168.html",
    "timestamp": "2025-04-11T19:53:00.000Z"
  },
  {
    "title": "Trump tariffs backfire on Elon Musk, as Tesla pulls U.S.-built models from China",
    "content": "Tesla has stopped taking orders for the Model S and Model X in China, which now face retaliatory 125% import duties levied by Beijing. Local customers are only able to choose from new cars still in inventory at its showrooms across the country. Fortunately, they are not in high demand so the damage to Tesla is minimal.\n\nThe Trump administration’s trade war with China backfired for the president’s senior advisor Elon Musk when Tesla was forced to pull two cars from its biggest growth market.\n\nHis electric vehicle manufacturer is no longer accepting orders for its premium Model S sedan and sibling Model X crossover. Both built exclusively in California for worldwide export, the duo are subject to the new 125% import duty Beijing slapped on U.S. goods in retaliation for Trump’s own similarly punitive tariff imposed this week.\n\nSales of the two models are now only possible from the dwindling inventory of vehicles Tesla already shipped from its Fremont plant near San Francisco to Chinese showrooms across the country.\n\nThe decision comes as Trump, whom Musk backed in the election with over a quarter billion dollars, ignited a trade war with the entire world that caused markets to tank. On Wednesday, Trump blinked after his new regime of punitive tariffs had only been in effect for a few hours, blaming “yippy” markets.\n\nBut he held firm on his China tariffs, and Beijing has now responded in kind.\n\nFortunately for investors, the damage is minimal. Current estimates suggest no more than 2,000 Model S and X units are at risk, a little more than a tenth of one percent of Tesla’s global annual volume.\n\nFor one, Tesla doesn’t rely on exports to China for its business. Much like other foreign brands that are major players in China, the overwhelming bulk of its sales come from vehicles locally built and sourced. In Tesla’s case, it builds the Model Y and 3 in its Shanghai factory.\n\nTypically carmakers only export niche models to China that compete in segments so small the added costs of setting up a second assembly line, even in a market its size, simply cannot be justified economically.\n\nThis goes equally for flagship luxury cars like the BMW 7 Series and Mercedes-Benz S-Class as well as Musk’s Model S and X.\n\nSecondly, the Tesla duo at this point are so old they barely factor at all into its business when compared with the newer Model 3 and Model Y. For example, the S has largely been sold unchanged since 2012, save for design tweaks often too minor for the layman to spot.",
    "url": "https://finance.yahoo.com/news/trump-tariffs-backfire-elon-musk-181817796.html",
    "timestamp": "2025-04-11T18:18:17.000Z"
  }
]